{"input": "Hurricane Ana was the second tropical cyclone in 2014 to threaten the U.S. state of Hawaii with a direct hit, after Iselle in August. The twenty-first named storm and fifteenth hurricane of the 2014 Pacific hurricane season, Ana formed from a disturbance that formed in the Central Pacific in mid-October. It rapidly consolidated, and a tropical depression developed by October 13. Aided by favorable conditions, Ana gradually strengthened while moving westward, threatening to pass over the island chain of Hawaii once or several times as indicated by early forecasts. By October 17, it had strengthened to a hurricane south of Hawaii and reached its peak intensity shortly afterwards while also making its closest approach. Afterwards, Ana weakened and began to fluctuate in intensity as it turned to the north and eventually northeast as it rounded a subtropical ridge and interacted with a cold front before becoming a hurricane briefly again on October 25. Ana transitioned into an extratropical cyclone on October 26, and raced across the northwest Pacific before dissipating by October 28 after it came ashore in Western Canada. Because Ana was originally forecasted to strike the Big Island of Hawaii early in its life, tropical storm watches and eventually warnings were issued in advance of the storm. These were later expanded across nearly the whole island chain as Ana nudged more to the west than forecasted. At its closest approach, Ana dropped heavy rain of nearly up to 11 inches (28 cm), although the heaviest rain missed Hawaii by nearly 20 miles (32 km),", "label": 1}
{"input": "The 2013–2016 epidemic of Ebola virus disease, centered in Western Africa, was the most widespread outbreak of the disease in history. It caused major loss of life and socioeconomic disruption in the region, mainly in Guinea, Liberia and Sierra Leone. The first cases were recorded in Guinea in December 2013; later, the disease spread to neighbouring Liberia and Sierra Leone, with minor outbreaks occurring in Nigeria and Mali. Secondary infections of medical workers occurred in the United States and Spain. In addition, isolated cases were recorded in Senegal, the United Kingdom and Italy. The number of cases peaked in October 2014 and then began to decline gradually, following the commitment of substantial international resources. It caused significant mortality, with a considerable case fatality rate. By the end of the epidemic, 28,616 people had been infected; of these, 11,310 had died, for a case-fatality rate of 40%. As of 8 May 2016, the World Health Organization (WHO) and respective governments reported a total of 28,646 suspected cases and 11,323 deaths (39.5%), though the WHO believes that this substantially understates the magnitude of the outbreak.On 8 August 2014, a Public Health Emergency of International Concern was declared and on 29 March 2016, the WHO terminated the Public Health Emergency of International Concern status of the outbreak. Subsequent flare-ups occurred; the epidemic was finally declared over on 9 June 2016, 42 days after the last case tested negative on 28 April 2016 in Monrovia.The outbreak left about 17,000 survivors of the disease, many of whom report post-recovery symptoms termed", "label": 1}
{"input": "The case of Ashya King concerns a boy named Ashya King, who had a brain tumour. His parents, Brett and Naghemeh King, took their son out of Southampton General Hospital (England) in August 2014 over a disagreement with doctors regarding his treatment.Ashya had a medulloblastoma, which was successfully removed through surgery on 24 July 2014. He received further neurosurgery on 22 August.His parents desired their son be treated with proton therapy, which they felt was less harmful than conventional radiotherapy. At that time, the National Health Service (NHS) did not provide proton therapy in the United Kingdom. However, it has funded treatment abroad since April 2008 where evidence has shown there to be benefit. In this case, the doctors did not support moving the boy so that he could get proton therapy and, in response, on 28 August 2014, the parents took their son out of the hospital without informing the medical team and boarded a ferry to France.The same day, an international manhunt for Ashya and his parents commenced. and, on 30 August, they were found in Velez Malaga, Spain. The parents were arrested and their son was sent to a local hospital for urgent treatment.On 2 September 2014, following public outcry against the arrest, then UK prime minister David Cameron called for “an urgent outbreak of common sense” while his deputy said it was not appropriate to “throw the full force of the law” at the couple.On 3 September 2014, Ashya King's parents were freed from the Spanish prison when the request to extradite", "label": 1}
{"input": "The 16th Houston Film Critics Society Awards were announced on February 18, 2023, at the Midtown Arts & Theater Center Houston (MATCH) in Texas. The nominations were announced on January 10, 2023, with The Banshees of Inisherin and Everything Everywhere All at Once leading the nominations with nine each. Both films won the most awards with three each, with Everything Everywhere All at Once winning Best Picture. The nominees for the Texas Independent Film Award were announced on December 7, 2022.Hosted by local film critics and film industry notables, the event featured live, abridged performances of the five Best Original Song nominees, which went to \"Naatu Naatu\" from RRR, and the awarding of the Texas Independent Film Award. \"As the industry continues to debate how we should experience the magic of film, moviemakers continue to imagine creative stories about compelling people,\" said Douglas Harris, HFCS President. \"This year, the films we honor showcase a community daring to rethink, refresh and reinvent,\" she concluded.The performances of the five nominated songs were performed by local performers Sheleah Monea, Cameron Starnes, and Sankar Narayanan, under the direction of music director Scott Benton, and the presence of the Consuls General of Argentina, Belgium, Germany and Korea for the presentation of Best Foreign Language Feature. Following the two-hour production, guests adjourned to the Gallery at MATCH for a reception featuring an Everything Everywhere All at Once-themed bagel buffet courtesy of Ziggy Gruber of \"Kenny and Ziggy's New York Delicatessen\" and Barry Shapiro of \"Bagel Express\". \"As we celebrate a year when", "label": 0}
{"input": "The Cuban thaw (Spanish: Deshielo cubano) was the normalization of Cuba–United States relations that began in December 2014 ending a 54-year stretch of hostility between the nations. In March 2016, Barack Obama became the first U.S. president to visit Cuba since Calvin Coolidge, in 1928.On December 17, 2014, U.S. President Barack Obama and Cuban leader Raúl Castro announced the beginning of the process of normalizing relations between Cuba and the United States. The normalization agreement was secretly negotiated in preceding months, facilitated by Pope Francis and largely hosted by the Government of Canada. Meetings were held in both Canada and Vatican City. The agreement would see the lifting of some U.S. travel restrictions, fewer restrictions on remittances, U.S. banks' access to the Cuban financial system, and the reopening of the U.S. embassy in Havana and the Cuban embassy in Washington, which both closed in 1961 after the breakup of diplomatic relations as a result of Cuba's close alliance with the USSR.On April 14, 2015, the Obama administration announced that Cuba would be removed from the United States State Sponsors of Terrorism list. With no congressional action to block this within the permitted time period, Cuba was officially removed from the list on May 29, 2015. This marked a further departure by the United States from the Cold War conflict and its strain on Cuba–United States relations. On July 20, 2015, the Cuban and U.S. \"interests sections\" in Washington and Havana were upgraded to embassies.On June 16, 2017, President Donald Trump stated that he was \"canceling\" the", "label": 1}
{"input": "On January 19, 2023, the United States hit its debt ceiling, beginning an ongoing debt-ceiling crisis. In response, Janet Yellen, the secretary of the treasury, began enacting temporary \"extraordinary measures\". The crisis is part of a political debate within Congress about federal government spending and the national debt that the U.S. government accrues.In the United States, the debt ceiling is a limit on how much national debt the Treasury Department may incur, defined by Congress. Although the debt ceiling does not authorize new spending, it grants the Treasury greater power over financial endeavors Congress may choose to take. In January 2013, the United States hit the debt ceiling, causing a crisis that persisted until that October, when the Continuing Appropriations Act of 2014 was signed into law by President Barack Obama. Since then, the debt ceiling has been increased multiple times, the most recent one raising it to $31.4 trillion in December 2021.According to reports from Wells Fargo, if the United States does not raise the debt ceiling, the government will begin defaulting on its debts starting sometime between early July and early September. In that event, the Treasury would have to either default on payments to bondholders or immediately curtail payment of funds owed to various companies and individuals that had been mandated but not fully funded by Congress. Both situations would be expected to result in a global economic meltdown. Additionally, if the federal government was unable to issue new debt, it would be forced to impose budget cuts that, in total, would equal", "label": 0}
{"input": "The 2014 Gaza War, also known as Operation Protective Edge (Hebrew: מִבְצָע צוּק אֵיתָן, romanized: Miv'tza Tzuk Eitan, lit. 'Operation Strong Cliff'), was a military operation launched by Israel on 8 July 2014 in the Gaza Strip, a Palestinian territory that has been governed by Hamas since 2007. Following the kidnapping and murder of three Israeli teenagers in the West Bank by Hamas-affiliated Palestinian militants, the Israel Defense Forces (IDF) initiated Operation Brother's Keeper, in which some 350 Palestinians, including nearly all of the active Hamas militants in the West Bank, were arrested. Hamas subsequently fired a greater number of rockets into Israel from the Gaza Strip, triggering a seven-week-long conflict between the two sides. It was one of the deadliest outbreaks of open conflict between Israel and the Palestinians in decades. The combination of Palestinian rocket attacks and Israeli airstrikes resulted in thousands of deaths, the vast majority of which were Gazan Palestinians.The Israeli military operation aimed to stop rocket fire into Israel from the Gaza Strip. Conversely, Hamas' attacks aimed to bring international pressure onto Israel with the strategic goal of forcing the latter to lift the Israeli–Egyptian blockade of the Gaza Strip; among its other goals were to end Israel's military offensive, obtain a third party to monitor and guarantee compliance with a ceasefire, release Palestinian political prisoners and overcome its isolation. According to the BBC, Israel launched airstrikes on the Gaza Strip in retaliation to the rocket attacks by Hamas, Palestinian Islamic Jihad (PIJ), and other Palestinian militant groups.On 7 July, after", "label": 1}
{"input": "The floods in South Africa in February-March 2023 were caused by heavy rainfall as a result of the La Niña weather phenomenon, affecting seven provinces, including Eastern Cape, Northern Cape, Mpumalanga, KwaZulu-Natal, and North West. The floods have caused casualties and damage to homes, businesses, basic infrastructure, roads, bridges and affected crops and livestock. At least twelve people have died across the provinces and others are missing. In addition to that, two more fatalities have been reported in King Sabata Dalindyebo Local Municipality (Eastern Cape Province), and one person in Komani Town (formerly Queenstown). Several people have been evacuated in Lekwa Local Municipality and residents in the area of Vaal, Vanderkloof, and Bloemhof dams along the Orange River (Northern Cape Province) were invited to evacuate after controlled water discharge operate by local authorities. In Mpumalanga province, about 300 families have been evacuated.The South African Weather Service predicted \"persistent and heavy\" rains ahead, with the risk of further flooding due to \"waterlogged soils and saturated rivers\".In response to the floods, President Cyril Ramaphosa declared on February 13 the State of National Disaster in seven provinces.On 23 March, heavy rainfall caused flash flooding in parts of the Eastern Cape. The worst affected municipalities were Ingquza Hill, King Sabata Dalindyebo, and Port St Johns. Local authorities reported at least three people lost their lives and one was reported missing. The flooding caused collapsed bridges, limiting movement in the flood-hit Port St Johns area.The cost of the damage was estimated to be around R4.5 billion in Eastern Cape and R337", "label": 0}
{"input": "Conference of Western Balkan States was a 28 August 2014 conference of heads of states and governments of Western Balkans region initiated by German chancellor Angela Merkel. An idea for organization of conference came in light of the celebration of the 100th anniversary of the beginning of World War I. It is the first conference in this framework and organizers expressed their desire to continue it in future with Vienna and Paris mentioned as a potential next hosts after Berlin (so called Berlin Process). Günther Oettinger confirmed at conference that event will be organised annually with Vienna as a host city in 2015 and Paris in 2016.The German chancellor announced intention to organize a conference on 7 June 2014. Invitation for participation was sent to all the countries of South Eastern Europe including Croatia and Slovenia that were already members of the European Union at the time of conference.The main intention was to show commitment for process of Future enlargement of the European Union, little progress of Bosnia and Herzegovina and Macedonia in that process and relations of Serbia with Russia in the light of International sanctions during the 2014 pro-Russian unrest in Ukraine.During the Foreign Ministers’ segment, Albanian Foreign Minister Bushati underlined the importance of making this initiative periodical, as well as finding the right instruments to enable, in future years, the drafting and implementation of concrete joint projects in the region. In this regard Albanian delegation presented a document under the title \"Albanian Working Paper for the Western Balkans Conference in Berlin\", which is", "label": 1}
{"input": "The war on terror, officially the Global War on Terrorism (GWOT), is a global counterterrorism military campaign initiated by the United States following the September 11 attacks and is also the most recent global conflict spanning multiple wars. The main targets of the campaign were militant Islamist and Salafi jihadist armed organisations such as Al-Qaeda, the Islamic State, and their international affiliates, which were waging military insurgencies to overthrow governments of various Muslim-majority countries. Other major targets included the Ba'athist regime in Iraq, which was toppled during an invasion in 2003, and various militant factions that fought during the ensuing Iraqi insurgency. The \"war on terror\" was officially declared over in May 2010 and again in May 2013. Other American military campaigns during the 2010s have also been considered part of the \"war on terror\" by individuals and the media. With the major wars over and only low-level fighting in some places, the end of the war in Afghanistan in August 2021 marks for most people the end of the war on terror, or at least its main phase. The United States Military ceased awarding the National Defense Service Medal for the Global War on Terror on December 31, 2022. Some consider the campaign to be ongoing.The \"war on terror\" uses war as a metaphor to describe a variety of actions which fall outside the traditional definition of war. 43rd President of the United States George W. Bush first used the term \"war on terrorism\" on 16 September 2001, and then \"war on terror\" a few", "label": 1}
{"input": "Hamas, the governing authority in the Gaza Strip, has constructed a sophisticated network of military tunnels since it seized control of the Strip in 2007. The tunnel system branches beneath many Gazan towns and cities, such as Khan Yunis, Jabalia and the Shati refugee camp. The internal tunnels, running some dozens of kilometres within the Gaza Strip, have several functions. Hamas uses the tunnels to hide its arsenal of rocketry underground, to facilitate communication, to permit munition stocks to be hidden, and to conceal militants, making detection from the air difficult. Hamas leader Khalid Meshal said in an interview with Vanity Fair that the tunnel system is a defensive structure, designed to place obstacles against Israel's powerful military arsenal and engage in counter-strikes behind the lines of the IDF. He admitted that the tunnels are used for infiltration of Israel, but said that offensive operations have never caused the death of civilians in Israel, and denied allegations of planned mass attacks on Israeli civilians.The cross-border tunnels were used in the capture of Gilad Shalit in 2006, and multiple times during the 2014 conflict. Destroying the tunnels was a primary objective of Israeli forces in the 2014 Israel–Gaza conflict. The IDF reported that it \"neutralized\" 32 tunnels, fourteen of which crossed into Israel. On at least four occasions during the conflict, Palestinian militants crossing the border through the tunnels engaged in combat with Israeli soldiers. Officially, Israeli spokesmen has always maintained that the aim of the “terror tunnels” is to harm Israel civilians. According to Prime Minister", "label": 1}
{"input": "Marchetti's constant is the average time spent by a person for commuting each day. Its value is approximately one hour, or half an hour for a one-way trip. It is named after Italian physicist Cesare Marchetti, though Marchetti himself attributed the \"one hour\" finding to transportation analyst and engineer Yacov Zahavi.Marchetti posits that although forms of urban planning and transport may change, and although some live in villages and others in cities, people gradually adjust their lives to their conditions (including location of their homes relative to their workplace) such that the average travel time stays approximately constant. Ever since Neolithic times, people have kept the average time spent per day for travel the same, even though the distance may increase due to the advancements in the means of transportation. In his 1934 book Technics and Civilization, Lewis Mumford attributes this observation to Bertrand Russell: Mr. Bertrand Russell has noted that each improvement in locomotion has increased the area over which people are compelled to move: so that a person who would have had to spend half an hour to walk to work a century ago must still spend half an hour to reach his destination, because the contrivance that would have enabled him to save time had he remained in his original situation now—by driving him to a more distant residential area—effectually cancels out the gain.A related concept is that of Zahavi, who also noticed that people seem to have a constant \"travel time budget\", that is, \"a stable daily amount of time that people", "label": 0}
{"input": "Organizations from around the world responded to the West African Ebola virus epidemic. In July 2014, the World Health Organization (WHO) convened an emergency meeting with health ministers from eleven countries and announced collaboration on a strategy to co-ordinate technical support to combat the epidemic. In August, they declared the outbreak an international public health emergency and published a roadmap to guide and coordinate the international response to the outbreak, aiming to stop ongoing Ebola transmission worldwide within 6–9 months. In September, the United Nations Security Council declared the Ebola virus outbreak in the West Africa subregion a \"threat to international peace and security\" and unanimously adopted a resolution urging UN member states to provide more resources to fight the outbreak; the WHO stated that the cost for combating the epidemic will be a minimum of $1 billion.The Economic Community of West African States (ECOWAS) and the World Bank Group have pledged aid money and the World Food Programme announced plans to mobilize food assistance for an estimated 1 million people living in restricted access areas. Several Non-Governmental Organizations have provided assistance in the efforts to control the spread of the disease. Up until the end of September, the humanitarian aid organisation Médecins Sans Frontières (Doctors Without Borders) is the leading organization responding to the crisis, with several treatment centers in the area. Samaritan's Purse has also provided direct patient care and medical support in Liberia; many nations and charitable organizations, foundations, and individuals have also pledged assistance to control the epidemic. As of September 2014,", "label": 1}
{"input": "Japanese whaling, in terms of active hunting of whales, is estimated by the Japan Whaling Association to have begun around the 12th century. However, Japanese whaling on an industrial scale began around the 1890s when Japan started to participate in the modern whaling industry, at that time an industry in which many countries participated. Japan resumed commercial whaling in July 2019, and since then whaling activities have been confined to its territorial waters and exclusive economic zone.During the 20th century, Japan was heavily involved in commercial whaling. This continued until the International Whaling Commission (IWC) moratorium on commercial whaling went into effect in 1986. Japan continued to hunt whales using the scientific research provision in the agreement and Japanese whaling was conducted by the Institute of Cetacean Research. This was allowed under IWC rules, although most IWC members opposed it. However, in March 2014, the UN's International Court of Justice ruled that the Japanese whaling program called \"JARPA II,\" in the Southern Ocean including inside the Australian Whale Sanctuary, was not in accordance with the International Convention for the Regulation of Whaling, and was not for scientific purposes, as it had claimed. They ordered Japan to cease operations. Despite the court order, Prime Minister Abe called for the resumption of whaling operations one year later. In December 2015, Japan went ahead with their whaling program, renamed \"NEWREP-A.\" On January 15, 2017, a helicopter in the Australian Whale Sanctuary photographed the Japanese whaling vessel Nisshin Maru with a freshly-killed minke whale on its deck. Crew members quickly", "label": 1}
{"input": "Presidential elections were held in Egypt between 26 and 28 May 2014. There were only two candidates, former Egyptian defence minister Abdel Fattah el-Sisi and Egyptian Popular Current candidate Hamdeen Sabahi. El-Sisi won the election in a landslide victory, having received 97% of votes. Before announcing his candidacy in the election, el-Sisi, who as Defence Minister also served as Commander-in-Chief of the Egyptian Armed Forces, was responsible for officially announcing the removal of president Mohamed Morsi from office in the aftermath of the June 2013 Egyptian protests. After Morsi's removal, Sisi installed a temporary interim government, but remained Egypt's Minister of Defence and assumed the role of the country's First Deputy Prime Minister. On 26 March 2014, he officially retired from the military, and announced that he would run as a candidate in the 2014 presidential election. The election, held between 26 and 28 May and which included only one opponent, was boycotted by some political parties, as well as many Islamists, including the Muslim Brotherhood's Freedom & Justice Party, the Brotherhood itself having been previously declared a terrorist organization in December 2013.The elections, which were planned to take place for two days, were extended to a third day. Official figures showed that 25,578,233 people voted in the elections, and the election had a turnout of 47.5% (lower than the 2012 election's 52%), with el-Sisi winning with 23.78 million votes, 96.91%, ten million more votes than former president Mohamed Morsi (who garnered 13 million votes against his opponent in the close runoff of the 2012 election).", "label": 1}
{"input": "Simon Hall (1977 or 1978 – 23 February 2014) was a British murderer who was wrongly helped by 'miscarriage of justice' campaigners, only for him to go on to confess to the murder he was convicted of and prove he was rightly convicted. Hall stabbed 79-year-old pensioner Joan Albert to death in her home in Capel St Mary, Suffolk in 2001, and was convicted of her murder two years later. Subsequently, the high-profile miscarriage of justice programme Rough Justice took up his case and aired a programme campaigning for him. Several MPs, Bristol University's 'Innocence Project' campaign group, his mother and girlfriend were also deceived into campaigning for him, and the Criminal Cases Review Commission (which had itself been set up in response to Rough Justice in 1997) referred his case to the Court of Appeal in 2009. However, the appeal court dismissed the appeal and he subsequently confessed his crime to prison authorities in 2013, before committing suicide in prison in 2014. His case was said to have gravely undermined the claims of many prisoners who claim their innocence and embarrassed miscarriage of justice activists, having proved that they had campaigned for a guilty man. The family of victim Joan Albert, who had to endure 10 years of false claims that Hall had never killed Albert, released a statement following Hall's confession saying: \"During the last 10 years the publicity surrounding the appeals has been very distressing for our family, making moving on impossible... we are also grateful to those who have helped us throughout", "label": 1}
{"input": "Talking Statues is a project created initially in 2013 by David Peter Fox in Copenhagen, Denmark involving pre-recorded voiceovers accompanying various statues available in a smartphone app. The statue of Hans Christian Andersen in the King's Garden in Copenhagen was the first talking statue in the world. Later the idea was applied in Helsinki, New York, London, San Diego, Chicago, Vilnius, Parma, Dublin, Berlin, Manchester, and others. The project works with mobile technology and activated through a QR code found on the statue, when you scan it you will be called. You can also download our app, then you can find the Talking Statues in the world and have it talk to GPS so that they call you on your smartphone when you get close to the statue. The project started in Kings Garden in Copenhagen, where Fox accompanied his two children Alfred and Leah to kindergarten. On the way, they passed the many statues, including H. C. Andersen, who became the first Talking Statue in the world launched on 13th of September 2013. In connection with the launch, a leaflet designed by Mathilde Lunderskov was published with a map of the 10 Talking Statues. The monologues were written by film director Carsten Rudolf in collaboration with David Peter Fox and the performance was made by actor Jens Jacob Tychsen. The first project was overseen from the start by Jens Peter Munk from the Municipality, who has written several books about these statues in Copenhagen. The project in 2013 was supported by the City of Copenhagen", "label": 1}
{"input": "During the ongoing Russo-Ukrainian War between the Ukrainian government forces and pro-Russian separatists in the Donbas region of Ukraine that began in April 2014, many international organisations and states noted a deteriorating humanitarian situation in the conflict zone. A May 2014 report by the United Nations said there had been an \"alarming deterioration\" in human rights in territory held by Russian separatists affiliated with the Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). The UN Human Rights Monitoring Mission in Ukraine (HRMMU) reported growing lawlessness in the region, documenting cases of targeted killings, torture, and abduction. HRMMU also reported threats against, attacks on, and abductions of journalists and international observers, as well as the beatings and attacks on supporters of Ukrainian unity. A report by Human Rights Watch said \"Anti-Kiev forces in eastern Ukraine are abducting, attacking, and harassing people they suspect of supporting the Ukrainian government or consider undesirable...anti-Kiev Russia's controlled extremists are using beatings and kidnappings to send the message that anyone who doesn't support them had better shut up or leave\".Non-governmental organisations, such as Amnesty International, also raised concerns about the behaviour of some Ukrainian volunteer battalions. Amnesty International said that they often acted like \"renegade gangs\", and were implicated in torture, abductions, and summary executions.In a report from HRMMU, again in May 2014, Ivan Šimonović, UN Assistant Secretary General for Human Rights, wrote about illegal detention, abduction and intimidation of election officials in the self-proclaimed pro-Russian republics, and called for urgent action to prevent a Balkans-style war. He also warned of", "label": 1}
{"input": "Operation Car Wash (Portuguese: Operação Lava Jato) was a criminal investigation by the Federal Police of Brazil's Curitiba branch. It began in March 2014 and was initially headed by investigative judge Sérgio Moro, and in 2019 by Judge Luiz Antônio Bonat. It has resulted in more than a thousand warrants of various types. According to the Operation Car Wash task force, investigations implicate administrative members of the state-owned oil company Petrobras, politicians from Brazil's largest parties (including presidents of the Republic), presidents of the Chamber of Deputies and the Federal Senate, state governors, and businessmen from large Brazilian companies. The Federal Police consider it the largest corruption investigation in the country's history. The taskforce was officially disbanded on 1 February 2021.Originally a money laundering investigation, it expanded to cover allegations of corruption at Petrobras, where executives allegedly accepted bribes in return for awarding contracts to construction firms at inflated prices. This criminal scheme was initially known as Petrolão (Portuguese for \"big oil\") because of the Petrobras scandal. The investigation is called \"Operation Car Wash\" because it was first uncovered at a car wash in Brasília. The aim of the investigation was to ascertain the extent of a money laundering scheme, estimated by the Regional Superintendent of the Federal Police of Paraná State in 2015 at R$6.4–42.8 billion (US$2–13 billion), largely through the embezzlement of Petrobras funds.: 16 : 60 It has included more than a thousand warrants for search and seizure, temporary and preventive detention, and plea bargaining, against business figures and politicians in numerous parties.", "label": 1}
{"input": "Euromaidan (; Ukrainian: Євромайдан, romanized: Yevromaidan, lit. 'Euro Square', IPA: [jeu̯romɐjˈdɑn]), or the Maidan Uprising, was a wave of demonstrations and civil unrest in Ukraine, which began on 21 November 2013 with large protests in Maidan Nezalezhnosti (Independence Square) in Kyiv. The protests were sparked by President Viktor Yanukovych's sudden decision not to sign the European Union–Ukraine Association Agreement, instead choosing closer ties to Russia and the Eurasian Economic Union. Ukraine's parliament had overwhelmingly approved of finalizing the Agreement with the EU, but Russia had put pressure on Ukraine to reject it. The scope of the protests widened, with calls for the resignation of Yanukovych and the Azarov government. Protesters opposed what they saw as widespread government corruption, abuse of power, human rights violations, and the influence of oligarchs. Transparency International named Yanukovych as the top example of corruption in the world. The violent dispersal of protesters on 30 November caused further anger. Euromaidan led to the 2014 Revolution of Dignity. During the uprising, Independence Square (Maidan) in Kyiv was a huge protest camp occupied by thousands of protesters and protected by makeshift barricades. It had kitchens, first aid posts and broadcasting facilities, as well as stages for speeches, lectures, debates and performances. It was guarded by 'Maidan Self-Defense' units made up of volunteers in improvised uniform and helmets, carrying shields and armed with sticks, stones and petrol bombs. Protests were also held in many other parts of Ukraine. In Kyiv, there were clashes with police on 1 December; and police assaulted the camp on 11", "label": 1}
{"input": "Beginning on 31 July 2022, tensions between Serbia and Kosovo heightened due to the expiration of the eleven-year validity period of documents for cars on 1 August 2022, between the government of Kosovo and the Serbs in North Kosovo. Kosovo, which declared independence in 2008, signed an agreement with Serbia in 2011 that concluded on the use of license plates in North Kosovo. This agreement was supposed to change license plates from the ones that were issued by Serbia to neutral ones. The agreement was extended in 2016 and it expired in 2021 after which a crisis occurred and it ended with an agreement that ended the ban of Kosovo-issued license plates in Serbia. After the announcement that Serbian citizens who enter Kosovo will receive entry and exit documents, a number of barricades were formed in North Kosovo on 31 July 2022 but were removed two days later after Kosovo announced that it would postpone the ban on license plates issued by Serbia. In August 2022, unsuccessful negotiations regarding license plates were held, although the ID document dispute was solved. A proposed agreement, dubbed the \"German-French proposal\" by the media, which was written by Jens Plötner and Emmanuel Bonne, was sent to Aleksandar Vučić, the president of Serbia, and Albin Kurti, the prime minister of Kosovo, the next month, while consultations regarding the agreement began in January 2023. Kurti declined to postpone the deadline for license plates and instead announced a phased implementation that would last until April 2023. This began in November, and early on", "label": 0}
{"input": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later, after seeing stories in the local media that 45-year old Atsumi Yoshikubo (吉窪昌美) who had been visiting the city from her home in southern Japan, had gone missing, she reported the sighting. It was the last time she was seen alive. Yoshikubo's absence was first noted five days after that sighting, when staff at her hotel noticed she had not checked out two days after her stay was due to have ended. In her room they found her luggage, still packed; she had apparently never boarded her flight home. Footage from the hotel's security camera showed her leaving shortly before she was last seen along the road. When that sighting was reported in the news, it suggested to many residents that she might have gotten lost in the vast expanse of taiga surrounding the city, and they augmented official search efforts with their own ventures into the bush.The case attracted considerable media interest not only across Canada but also in Japan, where Yellowknife is a popular destination for those seeking to view the northern lights. A week after Yoshikubo's disappearance, the Royal Canadian Mounted Police (RCMP) announced that they were calling off the search, as their investigation, in cooperation with Japanese police, had led them to believe that she had intended to take her own life. Her family, from whom she had been estranged", "label": 1}
{"input": "The 2014 Australian federal budget was the federal budget to fund government services and operations for the 2014/15 financial year. The 2014 budget was the first delivered by the Abbott government, since the Coalition's victory in the 2013 Australian federal election. Treasurer Joe Hockey presented the budget to the House of Representatives on 13 May 2014.The budget featured significant changes to address a perceived deficit crisis. This included a proposed dramatic downsizing of government bureaucracy, and contained significant changes to welfare, new initiatives for a medical research fund and spending on roads. A budget surplus exceeding 1% of GDP was not expected until 2023.The austere budget faced widespread criticism and was overwhelmingly rejected by the Australian public as reflected in all opinion polls after its release. Opposition to \"unfair\" budget measures came from the opposition and cross-bench, pensioners, economists, the union movement, students and welfare, community and disability groups with some taking to the streets in protest. The budget included changes which were contrary to pre-election commitments and promises made by the Liberals in opposition. Critics argue that every one of the following pre-election commitments made by Tony Abbott were broken in the first budget: \"No cuts to education, no cuts to health, no change to pensions, no change to the GST and no cuts to the ABC or SBS.\" Echos of the \"dead and buried\" Fightback! policy package from the 1993 election occurred with proposals to defer unemployment benefits for six months for under 30s and the removal of GP bulk billing. Most proposals have", "label": 1}
{"input": "The Argentine debt restructuring is a process of debt restructuring by Argentina that began on January 14, 2005, and allowed it to resume payment on 76% of the US$82 billion in sovereign bonds that defaulted in 2001 at the depth of the worst economic crisis in the nation's history. A second debt restructuring in 2010 brought the percentage of bonds under some form of repayment to 93%, though ongoing disputes with holdouts remained. Bondholders who participated in the restructuring settled for repayments of around 30% of face value and deferred payment terms, and began to be paid punctually; the value of their nearly worthless bonds also began to rise. The remaining 7% of bondholders were later repaid 25% less then they were demanding, after centre-right and US-aligned leader Mauricio Macri came to power in 2015.As part of the restructuring process, Argentina drafted agreements in which repayments would be handled through a New York corporation and governed by United States law. The holdout bondholders found themselves unable to seize Argentine sovereign assets in settlement, but realized that Argentina had omitted to provide for holdout situations and had instead deemed all bonds repayable on pari passu (equal) terms that prevented preferential treatment among bondholders. The holdout bondholders therefore sought, and won, an injunction in 2012 that prohibited Argentina from repaying the 93% of bonds that had been renegotiated, unless they simultaneously paid the 7% holdouts their full amount due as well. Together with the agreement's rights upon future offers (\"RUFO\") clause, this created a deadlock in which the", "label": 1}
{"input": "Julieka Ivanna Dhu (commonly referred to as Ms Dhu; her first name was generally not used in media reports out of respect for Aboriginal naming customs) was a 22-year-old Aboriginal Australian woman who died in police custody in South Hedland, Western Australia, in 2014. On 2 August that year, police responded to a report that Dhu's partner had violated an apprehended violence order. Upon arriving at their address, the officers arrested both Dhu and her partner after realising there was also an outstanding arrest warrant for unpaid fines against Dhu. She was detained in police custody in South Hedland and was ordered to serve four days in custody in default of her debt. While in custody, Dhu complained of pain and was twice taken to the Hedland Health Campus hospital. Medical staff judged that her complaints were exaggerated and associated with drug withdrawal. On 4 August, Dhu complained that she could no longer stand. Police officers, who accused her of faking her condition, handcuffed her, carried her to the back of their van and returned her to the hospital; she was pronounced dead shortly after arrival. The official cause of death was an infection due to her partner's breaking of her ribs three months earlier. An internal police investigation found that 11 officers had failed to comply with regulations or were otherwise guilty of misconduct. They were given written and oral warnings. A coronial inquest found that she had suffered \"unprofessional and inhumane\" handling by police and \"deficient\" treatment from hospital staff. It also established that", "label": 1}
{"input": "Arturo (1985 – July 3, 2016) was a polar bear living in Mendoza Zoological Park in Mendoza, Argentina, the only polar bear living in the country. He was born in the United States and transferred to Argentina in 1993. His companion, a female named Pelusa, died of cancer in 2012. The living conditions of the cage Arturo resided in were controversial, as temperatures reach up to 40 °C (104 °F) in Argentina, and the pool in Arturo's cage was only 51 centimetres (20 in) deep. Animal rights activists had, in response, dubbed Arturo the \"world's saddest animal\" and promoted a petition to have him moved to Assiniboine Park Zoo, a zoo in Winnipeg, Manitoba, Canada. The petition was created by Laura Morales of Hamilton, Ontario. It gained considerable attention after the hashtag #Freearturo began trending on Twitter. Supporters of the petition also noted that a polar bear died in Buenos Aires in December 2012 due to excessive heat, and argued that Arturo exhibited symptoms of depression and other mental health problems.As of July 19, 2014, the petition had over 400,000 signatures, and had been endorsed by Newt Gingrich and Cher. Assiniboine Park Zoo responded that while they would have gladly accepted Arturo there, they did not have the authority to do so unless Argentina agreed to transfer him there, and that the Mendoza zoo could not supply the necessary medical records to make such a trip possible.On July 24, 2014, the director of the Mendoza Zoo, Gustavo Pronotto, told the Associated Press that Arturo was too", "label": 1}
{"input": "Malaysia Airlines Flight 17 (MH17/MAS17) was a scheduled passenger flight from Amsterdam to Kuala Lumpur that was shot down by Russian-controlled forces on 17 July 2014, while flying over eastern Ukraine. All 283 passengers and 15 crew were killed. Contact with the aircraft, a Boeing 777-200ER, was lost when it was about 50 km (31 mi) from the Ukraine–Russia border, and wreckage from the aircraft fell near Hrabove in Donetsk Oblast, Ukraine, 40 km (25 mi) from the border. The shoot-down occurred during the war in Donbas over territory controlled by Russian separatist forces.The responsibility for investigation was delegated to the Dutch Safety Board (DSB) and the Dutch-led joint investigation team (JIT), who in 2016 reported that the airliner had been downed by a Buk surface-to-air missile launched from pro-Russian separatist-controlled territory in Ukraine. The JIT found that the Buk originated from the 53rd Anti-Aircraft Missile Brigade of the Russian Federation and had been transported from Russia on the day of the crash, fired from a field in a rebel-controlled area and the launch system returned to Russia afterwards.The findings by the DSB and JIT were consistent with the earlier claims by American and German intelligence sources and claims by the Ukrainian government. On the basis of the JIT's conclusions, the governments of the Netherlands and Australia held Russia responsible for the deployment of the Buk installation and began pursuing legal remedies in May 2018. The Russian government denied involvement in the shooting down of the airplane, and its account of how the aircraft was shot", "label": 1}
{"input": "Supriyo a.k.a Supriya Chakraborty & Abhay Dang v. Union of India thr. Its Secretary, Ministry of Law and Justice & other connected cases (2023) is an ongoing collection of landmark cases of the Supreme Court of India, which are set to consider whether to extend right to marry and establish a family to queer Indians. A 5-judge Constitution Bench, consisting of Chief Justice of India D.Y. Chandrachud, Justice S.K. Kaul, Justice Ravindra Bhat, Justice Hima Kohli and Justice P.S. Narasimha, will hear 20 connected cases brought by 52 petitioners.The petitioners, consisting of queer couples and individuals, request recognition of the right to marry and establish a family based on protections from discrimination, the right to equality, dignity, personal liberty, privacy and personal autonomy, and freedom of conscience and expression. Delhi Commission for Protection of Child Rights, a statutory body of the Aam Aadmi Party-led Delhi Government, intervened to support extending the right to marry and adopt for queer people.The respondent, the Union Government under the Bharatiya Janata Party leadership and its statutory body National Commission for Protection of Child Rights, opposes extending the right to marry and establish a family to queer Indians due to societal, cultural and religious history, consistent legislative policy, popular morality and majoritarian views. Islamic organisations Jamiat Ulema-e-Hind and Telangana Markazi Shia Ulema Council intervened to oppose the right to marry and establish a family for queer Indians on socio-legal and religious grounds.Independent professional association, the Indian Psychiatric Society, supported marriage and adoption rights for queer people based on scientific evidence, as", "label": 0}
{"input": "In April 2023, two sets of classified foreign intelligence documents of the United States began circulating on Twitter, Telegram, and 4chan. Jack Teixeira, an airman first class of the Massachusetts Air National Guard, had allegedly photographed printouts of the documents at his parents' home in Dighton, Massachusetts and posted them to the instant messaging platform Discord on a server named \"Thug Shaker Central\". The earliest posts dated to October 2022. The documents are primarily related to the Russo-Ukrainian War, but also include foreign intelligence assessments concerning nations including North Korea, China, Iran, and the United Arab Emirates. A subset of documents were shared to Discord servers for a YouTuber and the sandbox video game Minecraft in late February and early March 2023. In April, a 4chan user posted several documents on the website's political imageboard /pol/. The documents were then spread throughout pro-Russian Telegram channels; at least one image was altered to show more Ukrainian casualties than Russian casualties. The leaked documents contain operational briefs from the Joint Staff. Regarding the Russo-Ukrainian War, the documents suggest difficulties for both Russians and Ukrainians, in equal part; while one slide suggests that more Russians have died in the war than Ukrainians, several documents covering the Battle of Bakhmut suggest difficulties for Ukrainians in countering Russian flanking maneuvers and supply shortages in the area. Additionally, relations between Russia and other nations are covered, with multiple documents detailing efforts by Russian military intelligence agency GRU and paramilitary organization Wagner Group in promoting Russian ideals while downplaying American values. Other documents", "label": 0}
{"input": "The analysis of communications between Malaysia Airlines Flight 370 and Inmarsat's satellite telecommunication network provide the primary source of information about Flight 370's location and possible in-flight events after it disappeared from military radar coverage at 2:22 Malaysia Standard Time (MYT) on 8 March 2014 (17:22 UTC, 7 March), one hour after communication with air traffic control ended and the aircraft departed from its planned flight path while over the South China Sea. Flight 370 was a scheduled commercial flight with 227 passengers and 12 crew which departed Kuala Lumpur, Malaysia at 0:41 and was scheduled to land in Beijing, China at 6:30 China Standard Time (6:30 MYT; 22:30 UTC, 7 March). Malaysia has worked in conjunction with the Australian Transport Safety Bureau to co-ordinate the analysis, which has also involved the UK's Air Accidents Investigation Branch, Inmarsat, and US National Transportation Safety Board. Other groups have also made efforts to analyse the satellite communications, albeit challenged by a lack of publicly available information for several months after the disappearance. On 29 July 2015, debris was discovered on Réunion Island which was later confirmed to have come from Flight 370; it is the first physical evidence that Flight 370 ended in the Indian Ocean.During flight, the aircraft maintains a datalink with a satellite communication network for data and telephone calls. The datalink connects the aircraft and a ground station via satellite, which translates (changes) the signal's frequency and amplifies the signal; the ground station is connected to telecommunication networks which allows messages to be sent to", "label": 1}
{"input": "Presidential elections were held in Croatia on 28 December 2014 and 11 January 2015, the sixth such elections since independence in 1991. Only four candidates contested the elections, the lowest number since 1997. Incumbent President Ivo Josipović, who had been elected as the candidate of the Social Democratic Party in 2009–2010 but ran as an independent, was eligible to seek reelection for a second and final five-year term. As no candidate received 50% of the vote in the first round in December 2014, a run-off took place in January 2015 between the two candidates with the most votes; Josipović and Kolinda Grabar-Kitarović. Grabar-Kitarović went on to win the elections by a slim margin of 32,509 votes or 1.48%, making her Croatia's first female president.The elections were the second to have a woman in the run-off, the first having been the 2005 elections, and also featured the youngest candidate to run in a presidential contest, Ivan Vilibor Sinčić, aged 24. The election of Grabar-Kitarović was the first victory for the Croatian Democratic Union (HDZ) in a presidential election since the death of Franjo Tuđman in December 1999, making her the first right-wing President of Croatia in 15 years. The defeat of Josipović marked the first time that an incumbent Croatian President had failed to win reelection for a second five-year term, with both his predecessors Franjo Tuđman and Stjepan Mesić serving two terms. The number of votes (1,114,900) received by Grabar-Kitarović in the second round was the lowest number of votes received by an elected Croatian President", "label": 1}
{"input": "The International Year of Basic Sciences for Sustainable Development was proclaimed by the 76th session of the United Nations General Assembly 2 December 2021 for 2022, stressing that the applications of basic sciences are vital for advances in medicine, industry, agriculture, water resources, energy planning, environment, communications and culture, and that basic sciences rupture technologies respond to the needs of humankind by providing access to information and increasing societal well-being, and promoting peace through improved collaboration toward Sustainable Development Goals (SDGs). The official opening ceremony of the year took place in UNESCO headquarters in Paris on 8 July 2022. The official closure is planned to take place at CERN in Geneva on 15 December 2023.The International Union of Pure and Applied Physics (IUPAP) and 28 other science unions and organizations constituted a Steering Committee, chaired by Michel Spiro with vice chairs Jean Trần Thanh Vân, and Prajval Shastri, which goal from 2017 was to promote the proclamation by the United Nations General Assembly of 2022 as the International Year for Basic Science for Sustainable Development. Over 80 other organizations, among them many national science academies and their networks, are also supporting the initiative.UNESCO acts as the lead agency and focal point for the Year. The programme for the Year is developed in collaboration with other relevant entities of the United Nations system, IUPAP, CERN, and their associated organizations and federations across the world. So far a series of events have taken place around the world, among others the flagship events “Science, Ethics and Human Development” in", "label": 0}
{"input": "The 2014 Nuclear Security Summit was a summit held in The Hague, the Netherlands, on March 24 and 25, 2014. It was the third edition of the conference, succeeding the 2012 Nuclear Security Summit. The 2014 summit was attended by 58 world leaders (5 of which from observing international organizations), some 5,000 delegates and some 3,000 journalists. The representatives attending the summit included US President Barack Obama and Chinese President Xi Jinping. The main goal of the conference was generally to improve international cooperation and more specifically to assess which of the objectives that were set at the previous summits in Washington, D.C., and Seoul had not been accomplished in the previous four years and proposing ways of achieving them.The Nuclear Security Summit aimed to prevent nuclear terrorism by: reducing the amount of dangerous nuclear material in the world – especially highly enriched uranium improving the security of all nuclear material and radioactive sources improving international cooperationCountries that participated were interested in leading a certain security theme to a higher level. They could do so by offering a \"gift basket\", which is an extra initiative that can functioned as a role model for a specific security aspect (provided that it is supported by other countries). The Netherlands, for example, has been developing a gift basket that improves expertise and (international) cooperation regarding nuclear forensics with the help of the Netherlands Forensic Institute. Although nuclear terrorism and its prevention to reduce and secure nuclear supplies are officially the main topic, the Ukraine crisis overshadowed the talks. The", "label": 1}
{"input": "A motion of no confidence in the Spanish government of Pedro Sánchez was tabled by the far-right party Vox on 27 February 2023, and will be debated and voted in the Congress of Deputies between 21 and 22 March 2023. It was the sixth motion of no confidence in Spain since the country's transition to democracy.Vox announced the motion of no confidence on 9 December 2022, proposing it to be tabled under an independent candidate with government experience, voicing that Sánchez's proposed reforms of the Criminal Code to modify the embezzlement and sedition crimes were akin to a \"self-coup\" similar to \"that of Pedro Castillo in Peru\" two days earlier. The opposition People's Party (PP) under Alberto Núñez Feijóo stated that it would not vote against the motion, unlike the 2020 vote, but it did not clarify whether it would abstain or vote in favour of it depending on the proposed candidate.After a period in which Vox was unable to get the consent of any of the candidates it reached out for, on 1 February 2023 the party proposed economist and former politician Ramón Tamames, aged 89, to lead the motion. Tamames accepted on 21 February, with the motion's registration being announced for the next Monday. His speech highlights the maneuvers against the separation of powers towards an \"absorbing autocracy\" with abuse of the decree-law, elimination of the crime of sedition or reduction of sentences for embezzlement, support in pro-independence parties, little conciliatory line of government, partisan manipulation of history, attacks on legal certainty and businessmen", "label": 0}
{"input": "The World Cultural Council performed its 31st Award Ceremony on November 17, 2014 at the Dipoli Hall, Otakaari 1 Building, Aalto University, Espoo, Finland. Aalto University acted as the host and co-organizer of the event, which was the opening act prior to the Aalto University Academic Summit titled \"The Impact of Universities on Economic Growth.\"The WCC presented awards to two distinguished scientists. Acclaimed enzymologist Professor Sir Philip Cohen received the Albert Einstein World Award of Science for his forty-year research into cellular communication. Professor Federico Rosei accepted the José Vasconcelos World Award of Education, granted for his excellence in the field of university teaching. Jussi Nuorteva, Director of the National Archives of Finland and member of the WCC, presented the Winners' Book to the laureates. Professor Sir Philip Cohen and Professor Federico Rosei signed the book in presence of witnesses from Aalto University and WCC. Also, the WCC conferred Aalto University President, Professor Tuula Teeri, the Medal for Educational Merit. As part of the award ceremony, honorary mentions were granted to Aalto University researchers Assistant Professor Camilla Hollanti, Assistant Professor Katri Kauppi, Assistant Professor Mauri Kostiainen, Doctoral Candidate Matti Kuittinen, Assistant Professor Jani Romanoff and Assistant Professor Hele Savin.Finally, Professor Edmond Fischer handed over the Presidential Emblem to Professor Sir Colin Blakemore, a founding member of the council. The WCC acknowledged the work of Professor Fischer, in the last eight years as Honorary President, and in the last fifteen supporting the work of the council. The first duty of Professor Blakemore as new Honorary President was", "label": 1}
{"input": "The 16th Congress of the Popular Front for the Liberation of Saguia El Hamra and Río de Oro (Arabic: المؤتمر السادس عشر للجبهة الشعبية لتحرير الساقية الحمراء ووادي الذهب, Spanish: XVI Congreso del Frente Popular para la Liberación de Saguia El Hamra y Río de Oro) was held in the Dajla refugee camp in Tindouf, Algeria between 13 and 22 January 2023 to renovate the governing bodies of the POLISARIO Front and establish the movement's main lines of action and strategy for the next leadership term. The Congress was also used to elect a new General-Secretary for the POLISARIO Front, which would automatically become the President of the Sahrawi Arab Democratic Republic. For the first time ever, the candidate for general-secretary was not agreed upon before the Congress. Bachir Mustafa Sayed, brother of the late first president El Uali Mustafa Sayed, ran for the office against the incumbent Brahim Ghali, making this the first truly competitive race for the office and breaking the tradition of establishing a consensus for the office.The Congress' slogan is \"Escalating the fighting to expel the occupation and complete sovereignty\" (Arabic: تصعيد القتال لطرد الاحتلال لفرض السيادة, Spanish: Escalar la lucha para expulsar al ocupante e imponer la soberanía). The Congress was also named after M'hamed Jaddad, the late Sahrawi coordinator with the MINURSO.The Congress is the first one to be held in a wartime situation since 1991, due to the breakout of the Second Western Sahara War in 2020. This situation led to the Congress having little international promotion since the", "label": 0}
{"input": "The 28th Edition of Star Awards 2023 (Chinese: 红星大奖2023) is a television award ceremony that honoured the best in Singaporean television released between January and December 2022. Star Awards 2023 prepares for the largest celebration of local Chinese entertainment industry talent and content in Singapore! The Star Awards 2023, with the theme \"Beyond | Celebrations,\" have been redefined as a star-studded concert, bringing together the best performers from Singapore and the region for an exhilarating night of glitz, excitement, and celebrations unlike any other. The Ceremony was once again held at Marina Bay Sands, Singapore on 9 April 2023.The current All-Time Favorite Artiste Felicia Chin and Rebecca Lim earned their tenth Top 10 Most Favorite Artiste awards, in last years' ceremony, making Rebecca Lim the ninth celebrity to receive the Top 10 honour for ten consecutive years. The Nominees of the professional categories were announced on 15 February 2023, on Me Watch official website.This year's show and red carpet will be broadcast on Channel 8, Mediacorp Channel U, mewatch, Mediacorp Entertainment YouTube, Astro AEC and Astro GO Channel 302 at 5pm until 6.30pm (Walk-of-fame), 7pm until 10pm (ceremony) while the backstage commentary will be broadcast on mewatch, Mediacorp Entertainment YouTube 3.30pm until 10.30pm. The repeat telecast of the ceremony will be at 16 April 2023 2pm until 6.30pm on Channel 8. This ceremony will also include an international host —— Taiwanese Singer, Matilda Tao and Lee Teng will first being collaborated as the host of the ceremony, while Lee Teng will get to host the 3rd", "label": 0}
{"input": "A series of changes to the judicial system and the balance of powers in Israel was proposed in January 2023. The effort has been spearheaded by Deputy Prime Minister and Minister of Justice Yariv Levin and the Chair of the Knesset's Constitution, Law and Justice Committee, Simcha Rothman. It seeks to curb the judiciary's influence over lawmaking and public policy by limiting the Supreme Court's power to exercise judicial review, granting the government control over judicial appointments and limiting the authority of its legal advisors.If adopted, the reform would grant the Knesset the power to override Supreme Court rulings that deem legislation passed by the Knesset as unconstitutional, by reintroducing the legislation and approving it with a majority of Knesset members. The reform would additionally diminish the ability of courts to conduct judicial review of the Basic Laws and change the makeup of the Judicial Selection Committee, so that control over the appointment of judges is effectively given to the government. Levin and the ruling government coalition have stated that the above is the first step in their judicial reform, and that additional steps are planned, including changing the appointment process of legal advisors to government ministries, such that they are appointed and dismissed by the ministers; making their legal advice a recommendation rather than binding on the ministers; and making them subordinate directly to the ministers rather than to the Justice Ministry's professional oversight. Prime Minister Benjamin Netanyahu maintains that the reform is necessary because the judiciary has too much control over public policy, and", "label": 0}
{"input": "The 2013–2014 Thai political crisis was a period of political instability in Thailand. Anti-government protests took place between November 2013 and May 2014, organised by the People's Democratic Reform Committee (PDRC), a political pressure group led by former Democrat Party parliamentary representative (MP) Suthep Thaugsuban. The crisis eventually resulted in the removal of incumbent Prime Minister Yingluck Shinawatra, a coup d'état, and the establishment of a military junta. The primary aim of the protests was the removal of former prime minister Thaksin Shinawatra's – the brother of Yingluck – influence on Thai politics and the creation of an unelected \"people's council\" to oversee reforms of the political system. Protesters viewed Thaksin as corrupt and damaging to Thailand's democracy, although he enjoyed strong support in many areas of Thailand, particularly the poorer north and northeast, due to his reforming social programs and economic policies. Political parties allied to Thaksin had won a majority in every election since 2001. Other issues, such as the royal succession, a rural-urban or north-south divide, social inequality, over-centralised bureaucracy, royal and military influence in politics, and class conflict were suggested as factors behind the crisis by analysts and commentators. Protests were first triggered by a proposed amnesty bill which would have pardoned politicians of various charges from the period following the 2006 coup d'état. Anti-government protestors argued the bill, and a simultaneous government attempt to alter the 2007 constitution, favoured Thaksin and would potentially allow him to return from self-imposed exile due to a corruption conviction. The pro-government Red Shirt movement also", "label": 1}
{"input": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to the prosecutors for the state, Schellenberg attempted to smuggle methamphetamine with a net weight of just over 222 kg (489 lb) from Dalian to Australia in November 2014, and after discovering that his translator had informed the police, he boarded a plane at Dalian Zhoushuizi International Airport with the intention of fleeing to Thailand. Schellenberg was arrested by Chinese police when the plane had a stopover at Guangzhou Baiyun International Airport. Schellenberg argued that he was framed by drug dealer Xu Qing and that he was an innocent tourist. On November 20, 2018, the Dalian Intermediate People's Court tried and sentenced Schellenberg to 15 years in prison for drug smuggling, confiscation of 150,000 yuan in personal property, and deportation. Schellenberg appealed the verdict. On December 29 of the same year, the Liaoning Provincial High People's Court retried him. During the trial, the prosecutor claimed that the initial trial that Schellenberg was an accessory criminal, and the crime did not succeed, so the punishment should be light was inappropriate. The High Court of Liaoning Province ruled in court to send the case back to Dalian Intermediate People's Court for retrial. On January 14, 2019, the Dalian Intermediate People's Court opened a retrial to review the case, sentencing Schellenberg to death and confiscation of all property. After the retrial, Schellenberg's defense team stated that it would", "label": 1}
{"input": "The 2014 UEC European Track Championships was the fifth edition of the elite UEC European Track Championships in track cycling and took place at the Vélodrome Amédée Détraux in Baie-Mahault, Guadeloupe, France, between 16 and 19 October. The Event was organised by the European Cycling Union. All European champions are awarded the UEC European Champion jersey which may be worn by the champion throughout the year when competing in the same event at other competitions. The programme for the 2014 championships was considerably extended, and all World Championship track events were held; ten Olympic events, (sprint, team sprint, keirin, team pursuit and omnium, for both men and women), for which qualification points for the 2016 Summer Olympics were available for the first time, and nine non-Olympic events; the men's madison race and points races, scratch races, sprint time trials (1000 metres for men, 500 metres for women) and individual pursuits for both genders were held as part of the championships. The omnium was held in its new format for the first time, ending with the points race, rather than the sprint time trial. Unusually, the event was held on a fully outdoor concrete track with a 333-metre circumference, as opposed to the now standard 250 metre indoor wooden velodromes normally used in such events. As a result, several of the events (team sprints, omniums and points races) will be held over non-standard distances. In addition, the event took place outside continental Europe for the first time, being held in the French caribbean province department of Guadeloupe.", "label": 1}
{"input": "In July 2014, an internationally publicised incident occurred in which a Thai woman, Pattaramon Janbua, who had been hired as a surrogate mother for an Australian couple, sought to raise money for her critically ill surrogate son. The baby had been in her care since she gave birth in December 2013; biological parents David John Farnell and Wenyu Wendy Li had left Thailand 2 months later with baby Gammy's twin sister Pipah.When ultrasound results seven months into the surrogate pregnancy indicated that Ms Pattaramon was carrying twins and that one of the twins, a boy, had Down syndrome, Farnell and Li requested that she abort him, and that they would keep only the child's twin sister. Ms Pattaramon refused, citing her Buddhist beliefs, and instead opted to raise the boy (named Gammy) on her own. Thai surrogacy laws dictate that a child's legal mother is its birth mother. The Farnells returned to Australia in December 2013, bringing baby Gammy's twin sister Pipah with them. After the story broke to media, donors amassed a fund of over $250,000 to help baby Gammy.The incident raised questions about the ethics of gestational surrogacy. The fact that David Farnell is a convicted sex offender (he was sentenced to three years in prison in 1997 for molesting two girls aged 7 and 10) has also caused controversy. There were also rumors that the Farnells believed that Gammy had died, but this was not true; it was David Farnell's adult daughter who claimed that Gammy died and she did so because she", "label": 1}
{"input": "The 2023 Stanley Cup playoffs is the ongoing playoff tournament of the National Hockey League (NHL) for the 2022–23 season. The playoffs began on April 17, 2023, three days after the end of the regular season, and will end in June 2023 with the 2023 Stanley Cup Finals, to determine the winner of the Stanley Cup.The Boston Bruins made the playoffs as the Presidents' Trophy winners with the most points (i.e. best record) during the regular season. The Pittsburgh Penguins failed to make the playoffs for the first time since the 2005–06 NHL season, ending the NHL's longest active playoff streak at sixteen consecutive seasons. The longest active streak moved to the Boston Bruins and Toronto Maple Leafs at seven consecutive seasons after the Nashville Predators and Washington Capitals also had their eight-season playoff streaks end. As a result, this is the first time since 1976 that the longest active playoff streak was less than ten consecutive seasons. The Seattle Kraken became the second fastest NHL expansion team since 1991 to qualify for the playoffs, after the Vegas Golden Knights, and the first to clinch their inaugural playoff appearance in their second season in the league since the Quebec Nordiques in 1981. The Kraken also became the first NHL exclusive expansion team to make their first playoff appearance in their second season since the Atlanta Flames in 1974. All three New York metropolitan area teams (the Devils, Islanders and Rangers) made the playoffs in the same year for the first time since 2007. For the first", "label": 0}
{"input": "The 2014 Burkina Faso uprising was a series of demonstrations and riots in Burkina Faso in October 2014 that quickly spread to multiple cities. They began in response to attempts at changing the constitution to allow President Blaise Compaoré to run again and extend his 27 years in office. Pressure for political change came from civil society and in particular from the country's youth. Following a tumultuous day on 30 October, which included the involvement of former Defence Minister Kouamé Lougué and the burning of the National Assembly and other government buildings as well as the ruling Congress for Democracy and Progress party's headquarters, Compaoré dissolved the government and declared a state of emergency before eventually fleeing to Côte d'Ivoire with the support of President Alassane Ouattara. General Honoré Nabéré Traoré announced that a transitional government would run the country until an election within 12 months. After another day of mass protests and initially refusing to resign, after mounting domestic pressure Compaoré resigned from his 27-year presidency on 31 October and Traoré took over as the interim head of state. However, Lieutenant Colonel Yacouba Isaac Zida also staked a claim to be interim head of state citing Traoré's unpopularity. A statement by military chiefs asserted that Zida had their unanimous backing. A coalition of unnamed opposition parties rejected the military takeover. Further protests were called for the morning of 2 November, but were smaller yet there was at least one casualty amidst a police response. The African Union gave the country a fortnight to end military", "label": 1}
{"input": "From March 2012 to May 2014, the Salvadoran government, the Catholic Church, and the country's two largest criminal gangs, Mara Salvatrucha (MS-13) and the 18th Street gang (Barrio 18), came to a truce, known in El Salvador simply as the Gang Truce (Spanish: Tregua entre Pandillas), to lower the country's rate of homicides and extortions in exchange for improved prison conditions and certain visitation privileges. The truce's principal negotiators were Minister of Public Security David Munguía Payés, former deputy Raúl Mijango, and Bishop Fabio Colindres, and the negotiations were overseen by President Mauricio Funes. The existence of the truce was alleged by the online newspaper El Faro in early March 2012, after 30 gang leaders were transferred from a maximum-security prison to a lower-security prison, and confirmed after representatives from the gangs and the Catholic Church admitted that they negotiated a truce with the government. However, the government initially denied that they had negotiated with the gangs and that any truce existed; as the truce resulted in a decrease in crime, the government began to acknowledge its existence, but continued to attribute the decrease in crime to its security policies. The government formally recognized its role in negotiating the truce in September 2012. Although fractures in the truce began to manifest in July and August 2012, in November 2012 an effort to establish \"peace zones\" in Salvadoran municipalities helped restore the truce and reaffirm the gangs' commitments to reduce their criminal activities. Although the gang surrendered its weapons and the government removed soldiers from the designated", "label": 1}
{"input": "The Reddings was an American funk, soul and disco band, founded by Otis Redding's sons Dexter (bass and vocals) and Otis Redding III (December 17, 1963 – April 18, 2023 age 59; guitar) together with Mark Lockett (drums, keyboards, and lead vocal).Their most well-known songs include \"Remote Control\" (1980) / \"Doin' it\" / \"Funkin on the One\" / \"Class (Is What You Got)\" (1981) / \"Sittin' on the Dock of the Bay\" (1982) / \"Hand Dance\" (1983) and \"The Awakening\" (1980), a bass-drums-duet which is often performed live by Les Claypool (Primus) and on his album Highball with the Devil. Their album The Reddings was released on November 26, 1988, and reached a peak position of #88 on the US Billboard album chart. It featured a hit single \"Call The Law,\" which reached peak position of #16 on the Billboard Hot Black Singles Chart on November 26, 1988. In December 1980, \"Remote Control,\" from the first album by the Reddings (The Awakening), went to #6 on the Billboard Hot Soul Singles chart, and peaked at #89 on the Billboard Hot 100. The tune was sampled in an episode of the 1980s television programme, WKRP in Cincinnati. Written by Nick Mann, Bill Beard, and Chet Fortune of the Washington, D.C. based songwriting team of Last Colony Music, \"Remote Control\" continues to receive airplay in countries including Belgium, France, Italy, and the Netherlands. In 1979–1980, Dexter, Otis III, and Mark had recorded The Awakening with producers Russell Timmons and Nick Mann at the Believe in a Dream studio,", "label": 0}
{"input": "From January 28 to February 4, 2023, a Chinese-operated high-altitude balloon was spotted in North American airspace, including Alaska, western Canada, and the contiguous United States. On February 4, the U.S. Air Force shot down the balloon over U.S. territorial waters off the coast of South Carolina, on the order of U.S. President Joe Biden. It was shot down by a U.S. F-22 Raptor. Debris from the wreckage was recovered and sent to the FBI Laboratory in Quantico, Virginia, for analysis.The American and Canadian militaries announced that the balloon was for surveillance, while the Chinese government maintained it was a civilian (mainly meteorological) airship that had been blown off course. The U.S. said that the balloon was capable of geolocating electronic communications and carried intelligence surveillance equipment inconsistent with that of a weather balloon. It added that similar Chinese spy balloons have flown over more than 40 nations. Analysts said that its flight path and structural characteristics were dissimilar from those of a typical weather balloon. American officials later disclosed that they had been tracking the Chinese balloon since it was launched from Hainan. Its original destinations were likely Guam and Hawaii, but prevailing winds blew it off course and across North America.The incident increased U.S.–China tensions. The United States called the balloon's presence a violation of its sovereignty, and its Secretary of State Antony Blinken postponed a long-awaited diplomatic visit to Beijing. Canada summoned the Chinese ambassador in response to the incident.On February 2, a similar Chinese balloon was observed flying over Latin America. In", "label": 0}
{"input": "The Willis Resilience Expedition was a scientific and exploratory program that took place in Antarctica from November 2013 to January 2014, with the goal of a better understanding of changes in the Earth's climate brought on by global warming in addition to weather-related risk. Announced in August 2013, the expedition was led by explorer Douglas Stoup and Parker Liautaud, a teenage polar adventurer and environmental campaigner. The expedition was underwritten by Willis Group, a global risk advisor, insurance and reinsurance broker. The communications team, including driver and mechanic Eyjo Furteitsson, communication manager Nathan Hambrook-Skinner, and cinematographer Paddy Scott trailed the team in the 6x6 expedition truck built especially for the expedition by Arctic Trucks.The expedition consisted of three main components: Science. Liautaud and Stoup conducted an isotope transect of Antarctica by collecting snow samples on which stable isotope analysis will be conducted in the hope of providing a valuable contribution to human understanding of Antarctic climate and potential for climate change. World Record Attempt. Parker Liautaud attempted to ski 640 km unsupported from the coast of Antarctica to the South Pole in 22 days, setting a “coast to Pole” speed record. At 19 years old, he also broke the record of the youngest person to ski to both the North and the South Poles. Live Communications. The Expedition was accompanied by a custom-built 6x6 communications truck outfitted with equipment that provided 24/7 connectivity to the rest of the world, enabling Paddy Scott, the expedition cameraman and photographer to document Liautaud and Stoup's journey in real time.", "label": 1}
{"input": "The 7th Crunchyroll Anime Awards was held on March 4, 2023, at the Main Banquet Hall of the Grand Prince Hotel New Takanawa in Tokyo, Japan. It was the first ceremony to be held in person since 2020; both ceremonies in 2021 and 2022 were held virtually. Additionally, it was the first ceremony to be held in Japan, as previous physical ceremonies were held in the United States. Anime released on television or online in Japan from November 2021 to September 2022 were eligible for nominations for this edition. The ceremony was hosted by voice actress Sally Amaki and presenter Jon Kabira, with Sony CEO Kenichiro Yoshida opening the show. Previous winners ALI and AKLO, Yuki Kajiura, and Kohta Yamamoto performed at the ceremony, while singer Haruka Kaki of Nogizaka46, comedian Kendo Kobayashi, entertainer Roland, and actress Sawa Suzuki presented the awards to the winners together with various voice actors and entertainers. Sony Music Solutions collaborated with Crunchyroll in planning and operations, with Telescope Inc. administering the voting process. Crunchyroll streamed the ceremony live on YouTube and Twitch, as well as on SonyLIV in India. Voting for the Anime of the Year category included \"social voting\" for the first time, which allowed Twitter users to vote for the category by posting the necessary hashtags or by retweeting. The list of nominees were announced on the first day of voting, January 19. Voting closed on January 25.Crunchyroll announced the judges and categories on December 8, 2022. This edition featured 31 categories, and was divided into \"main categories\"", "label": 0}
{"input": "Presidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The registration period for presidential nominations was open from 16 September 2013 until 6 October 2013. A total of 27 candidates were confirmed to be running for office. However, on 22 October Afghanistan's Independent Election Commission disqualified 16 of the candidates, leaving only 11 in the race. By April 2014 three candidates gave up the race and decided to support some of the eight remaining candidates. Opinion polls showed Abdullah Abdullah and Ashraf Ghani as the front-runners and indeed the results of the first round of the election had Abdullah in the lead and Ghani behind him. The second set of results came after the run-off on 14 June, two months after the first round. Preliminary results were expected on 2 July and the final result on 22 July. However, widespread accusations of fraud delayed these results. As a result, John Kerry, then United States Secretary of State, mediated the negotiations between the two final candidates, Ghani and Abdullah. After a series of negotiations and talks between Ghani, Abdullah and Kerry, the two candidates agreed to sign an Agreement to form a National Unity Government based on 50–50 power sharing. As a result of that political agreement, a separate position was created for Abdullah as Chief Executive. The National Unity Government's term ran out after the next Afghan presidential election was held in September 2019.The", "label": 1}
{"input": "An ongoing refugee crisis began in Europe in late February 2022 after Russia's invasion of Ukraine. Over 8.1 million refugees fleeing Ukraine have been recorded across Europe, while an estimated 8 million others had been displaced within the country by late May 2022. Approximately one-quarter of the country's total population had left their homes in Ukraine by 20 March. 90% of Ukrainian refugees are women and children, while most Ukrainian men age 18 to 60 are banned from leaving the country. By 24 March, more than half of all children in Ukraine had left their homes, of whom a quarter had left the country. The invasion caused Europe's largest refugee crisis since World War II and its aftermath, is the first of its kind in Europe since the Yugoslav Wars in the 1990s, as well as the fourth largest refugee crisis in history, and is the largest refugee crisis of the 21st century, with the highest refugee flight rate globally.The vast majority of refugees initially entered neighbouring countries to the west of Ukraine (Poland, Slovakia, Hungary, Romania, and Moldova). Around 3 million people then moved further west to other European countries. As of 18 October 2022, according to UNHCR data, the countries receiving the largest numbers of Ukrainians were Russia (2.77 million), Poland (1.5 million), Germany (1 million) and the Czech Republic (0.5 million), As of September 2022, Human Rights Watch documented that Ukrainian civilians were being forcibly transferred to Russia. The UN Human Rights Office stated \"There have been credible allegations of forced transfers of", "label": 0}
{"input": "On the afternoon of 24 May 2014, a gunman opened fire at the Jewish Museum of Belgium in Brussels, killing four people. Three of them, an Israeli couple on holiday and a French woman, died at the scene. The fourth victim, a Belgian employee of the museum, was taken to the hospital but died of his injuries on 6 June. A little less than a week later, on 30 May 2014, a suspect was arrested in the French city of Marseille in connection with the shooting. The suspect was Mehdi Nemmouche, a 29-year-old French national of Algerian origin. A second suspect, Nacer Bendrer, was identified and arrested later. Prior to the shooting, Nemmouche had already spent time in French prisons, where he became involved in radical Islam. After his imprisonment, he also spent more than a year in Syria. It is also in prison where he met Bendrer, who was suspected of having supplied Nemmouche with the weapons used in the attack. Investigators identified a third suspect as well, but the charges against the third suspect were later dismissed due to the evidence against him being considered too weak. Nemmouche and Bendrer were formally indicted in April 2018, and tried before the court of assizes of Brussels in early 2019. After two months of trial hearings, a verdict was rendered: Nemmouche was found guilty of having committed the attack, whilst Bendrer was found guilty of being the co-author of the attack by having supplied Nemmouche with the weapons used in the attack. The theory that Nemmouche", "label": 1}
{"input": "Parliamentary elections were held in Estonia on 5 March 2023 to elect all 101 members of the Riigikogu. The officially published election data indicate the victory of the Reform Party, which won 37 seats in total, while the Conservative People's Party of Estonia (EKRE) placed second with 17 seats. The Centre Party won 16 seats, a loss of 10, while Estonia 200 won 14 seats, gaining representation in Riigikogu. After the previous parliamentary election in 2019, the Centre Party, led by Jüri Ratas, formed a government with Ratas serving as prime minister. His government was brought down in January 2021 after a corruption investigation, and Kaja Kallas of the Reform Party formed a coalition government with the Centre Party; which collapsed in June 2022. Kallas then formed a government with Isamaa and the Social Democratic Party and remained in the position of prime minister. In January 2023, the National Electoral Committee announced that nine political parties and ten individual candidates had registered to take part in the 2023 parliamentary election. During the campaign period, issues discussed most extensively regarded the Estonian economy, and the country's national defence and security due to the current Russian invasion of Ukraine. Individuals from contesting political parties also participated in multiple organised debates in January and February 2023. Voting at foreign embassies for Estonians outside the country took place from 18 to 23 February, while Estonian residents could vote during the pre-election period from 27 February to 4 March. These were the first national elections where more than half of the", "label": 0}
{"input": "The 2023 Princess Auto Players' Championship was held from April 11 to 16 at the Mattamy Athletic Centre in Toronto, Ontario. It was the fifth Grand Slam event and final major of the 2022–23 curling season. In the women's final, Sweden's Isabella Wranå won her first Slam title, defeating the World Champion Silvana Tirinzoni rink from Switzerland 6–5. In the game, Wranå took a commanding lead in the fourth end, making an open hit for three to take a 4–1 lead. Tirinzoni scored a single in the fifth, but Wranå replied by getting a deuce in the sixth. The Tirinzoni rink had a chance to score three in the seventh to even the gap, but fourth thrower Alina Pätz missed a split attempt, but did end up getting two, as at least her shooter rolled in the house to score. In the final end, Wranå only had to hit one Tirinzoni rock on her last to win the title.In the men's final, Calgary's Kevin Koe rink, defeated Switzerland's Yannick Schwaller team 5–4, giving Koe's fifth Grand Slam title as a skip. Up 1–0 after the first, Koe missed a long raise takeout in the second, allowing Schwaller's last rock thrower Benoît Schwarz to draw for two. Schwaller went up 3–1 after Koe missed an angle raise double in the fourth. Koe made a hit and stick for one in the fifth, and Schwarz replied with a draw to the button in the sixth to go up 4–2. The seventh end was blanked, and in the eigth", "label": 0}
{"input": "Wrestle Kingdom 17 was a two-day professional wrestling pay-per-view (PPV) event co-produced by the New Japan Pro-Wrestling (NJPW) and Pro Wrestling Noah (Noah) promotions. The first day of the event took place on January 4, 2023, at the Tokyo Dome in Tokyo, Japan and the second day of the event took place on January 21, 2023, at the Yokohama Arena in Yokohama, Japan. It is the 32nd January 4 Tokyo Dome Show and the 17th promoted under the Wrestle Kingdom name. The event was held in honor of the NJPW founder Antonio Inoki, who died on October 1, 2022. In the main event of night 1, Kazuchika Okada defeated Jay White to win the IWGP World Heavyweight Championship. In other prominent matches, Kenny Omega defeated Will Ospreay to win the IWGP United States Heavyweight Championship, Keiji Muto teamed with Hiroshi Tanahashi and Shota Umino to defeat Los Ingobernables de Japon (Tetsuya Naito, Sanada and Bushi) in Muto's final NJPW match, and Kairi defeated Tam Nakano to retain the IWGP Women's Championship – following the match, Mercedes Moné, formerly known as Sasha Banks in WWE, made her NJPW debut. The event's first night also notably featured appearances from wrestlers signed to All Elite Wrestling, WWE, NJPW's sister promotion World Wonder Ring Stardom, and Noah. In the main event of the second night, which was co-promoted by Noah, Tetsuya Naito defeated Kenoh – after the match, Naito was announced as Keiji Muto's last ever opponent at Keiji Muto Grand Final Pro-Wrestling \"Last-Love\". In other prominent matches, Shingo Takagi", "label": 0}
{"input": "The Vienna Summer of Logic was a scientific event in the summer of 2014, combining 12 major conferences and several workshops from the fields of mathematical logic, logic in computer science, and logic in artificial intelligence. The meetings took place from July 9 to 24, 2014, and attracted more than 2000 scientists and researchers.The event was organized by the Kurt Gödel Society at Vienna University of Technology. Participating meetings include:In the Logic in Computer Science stream (representing the Federated Logic Conference (FLoC)): International Conference on Computer Aided Verification (CAV) IEEE Computer Security Foundations Symposium (CSF) International Conference on Logic Programming (ICLP) International Joint Conference on Automated Reasoning (IJCAR) Conference on Interactive Theorem Proving (ITP) Joint meeting of the EACSL Annual Conference on Computer Science Logic (CSL) and the ACM/IEEE Symposium on Logic in Computer Science (LICS) International Conference on Rewriting Techniques and Applications (RTA) joint with the International Conference on Typed Lambda Calculi and Applications (TLCA) International Conference on Theory and Applications of Satisfiability Testing (SAT) more than 70 FLoC workshops FLoC Olympic Games (system competitions) SAT/SMT Summer SchoolIn the Mathematical Logic stream: Logic Colloquium 2014 (LC) Logic, Algebra and Truth Degrees 2014 (LATD) Workshop on Compositional Meaning in Logic (GeTFun 2.0) The Infinity Workshop (INFINITY) Workshop on Logic and Games (LG) Workshop on Nonclassical Proofs: Theory, Applications and Tools (NCPROOFS) Kurt Gödel Fellowship CompetitionIn the Logic in Artificial Intelligence stream: International Conference on Principles of Knowledge Representation and Reasoning (KR) International Workshop on Description Logics (DL) International Workshop on Non-Monotonic Reasoning (NMR) International Workshop on", "label": 1}
{"input": "The Minsk agreements were a series of international agreements which sought to end the Donbas war fought between armed Russian separatist groups and Armed Forces of Ukraine, with Russian regular forces playing a central part. The first, known as the Minsk Protocol, was drafted in 2014 by the Trilateral Contact Group on Ukraine, consisting of Ukraine, Russia, and the Organization for Security and Co-operation in Europe (OSCE), with mediation by the leaders of France and Germany in the so-called Normandy Format. After extensive talks in Minsk, Belarus, the agreement was signed on 5 September 2014 by representatives of the Trilateral Contact Group and, without recognition of their status, by the then-leaders of the self-proclaimed Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). This agreement followed multiple previous attempts to stop the fighting in the region and aimed to implement an immediate ceasefire. The agreement failed to stop fighting, and was thus followed with a revised and updated agreement, Minsk II, which was signed on 12 February 2015. This agreement consisted of a package of measures, including a ceasefire, withdrawal of heavy weapons from the front line, release of prisoners of war, constitutional reform in Ukraine granting self-government to certain areas of Donbas and restoring control of the state border to the Ukrainian government. While fighting subsided following the agreement's signing, it never ended completely, and the agreement's provisions were never fully implemented. The Minsk II was suggested by former German Foreign Minister Frank-Walter Steinmeier as a mechanism of granting a special status to Donbass, and", "label": 1}
{"input": "Global news flow (also referred to as international news flow) is a field of study that deals with the news coverage of events in foreign countries. It describes and explains the flow of news from one country to another.Studies on global news flow typically attempt to understand why certain countries are more newsworthy than others.. Along the years it has been found that the economic power of countries plays a particularly crucial role in their news prominence as well as the presence of international news agencies. Thus, the US has been found to be very prominent in news mentions around the world (18%), followed by China, Western European and Middle Eastern countries (about 3-5% each).The unequal representation of the world and the under-representation of developing countries have been already of a great concern at least since the 1950s, since they influence the way people perceive the world and the image of countries. This problem was later addressed in the MacBride report, and his set of recommendations for a New World Information and Communication Order. The unequal representation of the world has been also linked to the World System Theory, and the unequal economic structure of the world.A 2014 study, examining 35 popular news website in ten different languages over a two-year study period, found that \"the United States is by far the most prominent country in the news sites that we studied from around the world, except for the French and Arabic ones\" and the \"network structure of news links clearly exhibits [the U.S.'s] key position", "label": 0}
{"input": "The 2014–15 North American winter was frigid and prolifically wintry, especially across the eastern half of North America in the months of January–March. The season began early, with many places in North America experiencing their first wintry weather during mid-November. A period of below-average temperatures affected much of the contiguous United States, and several records were broken. An early trace of snowfall was recorded in Arkansas. There were greater accumulations of snow across parts of Oklahoma as well. A quasi-permanent phenomenon referred to as the polar vortex may have been partly responsible for the cold weather. Temperatures in much of the United States dropped 15 to 35 °F (8.3 to 19 °C) below average by November 19, following a southward \"dip\" of the polar vortex into the eastern two-thirds of the country. The effects of this dip were widespread, bringing about temperatures as low as 28 °F (−2 °C) in Pensacola, Florida. Following a significant snowstorm there, Buffalo, New York received several feet of snow from November 17–21. In addition, significant winter weather occurred throughout the season, including a major blizzard that struck the Northeastern United States at the end of January, another blizzard that affected much of the Northern United States days later in early February, and several significant snow events paired with very frigid temperatures for much of February. Many records for snowfall and temperature were broken, many for the month of February, with every state east of the Mississippi River being colder than average, some for the entire winter. However, this meteorological winter", "label": 1}
{"input": "The 29th Annual Screen Actors Guild Awards, honoring the best achievements in film and television performances for the year 2022, were presented on February 26, 2023 at the Fairmont Century Plaza in Century City, California. The ceremony streamed live on Netflix's YouTube channel, starting at 8:00 p.m. EST / 5:00 p.m. PST. The nominees were announced on January 11, 2023 by Ashley Park and Haley Lu Richardson via Instagram Live.In May 2022, it was confirmed that the ceremony would no longer air on TNT and TBS (the ceremony had aired on TNT since 1998 and had been also broadcast on TBS since 2006); a spokesperson insisted that finding a new home for the ceremony \"is not unusual and has occurred several times over the history of the SAG Awards. This is no different\". The day of the nominations announcement, it was confirmed that the ceremony would stream live on Netflix's YouTube channel.The Banshees of Inisherin and Everything Everywhere All at Once both received five nominations, tying the record for the most nominations in SAG Awards history with Shakespeare in Love (1998), Chicago (2002), and Doubt (2008).Everything Everywhere All at Once ultimately won the most awards of the ceremony with four wins, the most for any film in SAG Awards history, with Michelle Yeoh and Ke Huy Quan both becoming the first Asian actors to win for individual categories: Outstanding Performance by a Female Actor in a Leading Role and Outstanding Performance by a Male Actor in a Supporting Role, respectively.Sally Field was announced as the 2022", "label": 0}
{"input": "The 19th Empire Awards ceremony (officially known as the Jameson Empire Awards), presented by the British film magazine Empire, honored the best films of 2013 and took place on 30 March 2014 at the Grosvenor House Hotel in London, England. During the ceremony, Empire presented Empire Awards in 14 categories as well as five honorary awards. The awards for Best Best Supporting Actor and Best Supporting Actress were first introduced this year. To celebrate the 25th anniversary of Empire magazine two special honorary awards were presented, the Action Hero of our Lifetime and the Legend of our Lifetime awards. Irish actor James Nesbitt hosted the show for the first time. The awards were sponsored by Jameson Irish Whiskey for the sixth consecutive year.In related events, Empire and Jameson Irish Whiskey held the 5th Done In 60 Seconds Competition Global Final on March 29, 2014 at The Brewery, London, England. The team of judges consisted of Empire editor-in-chief Mark Dinning, Sky Movies Premiere English presenter Alex Zane, Scottish radio DJ Edith Bowman, Scottish director Jon S. Baird and English director Ben Wheatley, which selected from a shortlist of 24 nominees the five Done In 60 Seconds Award finalists that were invited to the Empire Awards where the winner was announced.Gravity won two awards including Best Film and Best Director for Alfonso Cuarón. Other winners included The Hobbit: The Desolation of Smaug also with two awards and 12 Years a Slave, Alan Partridge: Alpha Papa, Blue Jasmine, Filth, Saving Mr. Banks, The Conjuring, The Hunger Games: Catching Fire,", "label": 1}
{"input": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals, Patagotitan mayorum, which was first announced in 2014 and then validly named in 2017 by José Carballido and colleagues. Preliminary studies and press releases suggested that Patagotitan was the largest known titanosaur and land animal overall, with an estimated length of 37 m (121 ft) and an estimated weight of 69 tonnes (76 short tons). Later research revised the length estimate down to 31 m (102 ft) and weight estimates down to approximately 50–57 tonnes (55–63 short tons), suggesting that Patagotitan was of a similar size to, if not smaller than, its closest relatives Argentinosaurus and Puertasaurus. Still, Patagotitan is one of the most completely-known titanosaurs, and so its interrelationships with other titanosaurs have been relatively consistent in phylogenetic analyses. This led to its use in a re-definition of the group Colossosauria by Carballido and colleagues in 2022. Like Argentinosaurus and other members of the Lognkosauria, Patagotitan was a particularly large and robust titanosaur. It can be distinguished from its close relatives by a suite of unique characteristics in its back and tail vertebrae, scapulae and humeri in the forelimb, and ischia and femora in the hindlimb. Among these was the presence of accessory vertebral articulations known as the hyposphene-hypantrum articulations between only one pair of vertebrae at the level of the scapular blade, which was likely a weight-bearing adaptation not seen in any", "label": 1}
{"input": "Severe Tropical Cyclone Gabrielle was a severe tropical cyclone that devastated the North Island of New Zealand and affected parts of Vanuatu and Australia in February 2023. It is the costliest tropical cyclone on record in the Southern Hemisphere, with total damages estimated to be at least NZ$13.5 billion (US$8.4 billion), of which the provisional cost of insured damage is at least NZ$1.15 billion (US$730 million). It was also the deadliest cyclone and weather event overall to hit New Zealand since Cyclone Giselle in 1968, surpassing Cyclone Bola in 1988. The fifth named storm of the 2022–23 Australian region cyclone season, and the first severe tropical cyclone of the 2022–23 South Pacific cyclone season, Gabrielle was first noted as a developing tropical low on 6 February 2023, while it was located to the south of the Solomon Islands, before it was classified as a tropical cyclone and named Gabrielle by the Bureau of Meteorology. The system peaked as a Category 3 severe tropical cyclone before moving into the South Pacific basin, then rapidly degenerated into a subtropical low on 11 February 2023. Norfolk Island was placed under a red alert as Gabrielle approached, while heavy rain and wind warnings were issued across the North Island of New Zealand. Existing states of emergency in Auckland and the Coromandel due to recent floods were extended, and new states of emergency were declared in other areas. The cyclone hit New Zealand from 12 to 16 February, with a national state of emergency being declared on 14 February 2023. All", "label": 0}
{"input": "The 76th British Academy Film Awards, more commonly known as the BAFTAs, were held on 19 February 2023, honouring the best national and foreign films of 2022, at the Royal Festival Hall within London's Southbank Centre. Presented by the British Academy of Film and Television Arts, accolades were handed out for the best feature-length film and documentaries of any nationality that were screened at British cinemas in 2022. The nominations were announced on 19 January 2023 via a global livestream, hosted by actors Hayley Atwell and Toheeb Jimoh, from the arts charity's newly redeveloped HQ at 195 Piccadilly, London. The EE Rising Star Award nominees, which is the only category voted for by the British public, were announced on 17 January 2023.The German-language epic anti-war drama All Quiet on the Western Front received the most nominations with fourteen, tying the record set by Crouching Tiger, Hidden Dragon (2000) as the most nominated non-English language film in the awards' history; winning seven of these, including Best Film, Best Director (Edward Berger) and Best Film Not in the English Language, the World War I epic set a new record for the most BAFTA wins for a non-English language film.The ceremony was co-hosted by Swazi-English BAFTA- and Academy Award-nominated actor Richard E. Grant and British television personality Alison Hammond, who also helmed the backstage interviews. Presenters Vick Hope and BBC Radio 1 film critic Ali Plumb hosted the red carpet pre-show. The broadcast aired on BBC One and BBC iPlayer in the UK, and was simulcast globally in eight", "label": 0}
{"input": "2023 International Conference on Climate Resilient Pakistan, more commonly referred to as 2023 Geneva conference, was a one-day international conference on aid to Pakistani Government after the devastating floods in 2022. The conference was co-hosted by the Pakistani Government and the United Nations, held on 9 January 2023 in Geneva, Switzerland. Shehbaz Sharif, the Prime Minister of Pakistan, and Antonio Guterres, the Secretary-General of the United Nations, began the one-day conference, the more than 450 attendees including private donors, international financial organizations, and government representatives from around 40 countries.In the conference, Pakistan presented the “Resilient, Recovery, Rehabilitation, and Reconstruction Framework” (4RF) and seek international support and long-term partnerships for its implementation. The 4RF document covers the funding mechanism and institutional arrangements for its execution in an open, transparent, and collaborative way, and it describes a prioritized and sequenced plan that is set at the federal and provincial levels.Pakistan had created a Post-Disaster Needs Assessment (PDNA) with assistance from the United Nations system, World Bank Group, Asian Development Bank, and European Union. This estimate places the flood damages at over US$14.9 billion, the economic losses at over US$15.2 billion, and the cost of reconstruction at over US$16.3 billion.Pakistan raised more money than it had asked at this conference, more than $9 billion, from international financial institutions, donor agencies and development partners for the rehabilitation, recovery and reconstruction of flood-affected areas. Prime Minister Shehbaz had asked for at least $8 billion from Pakistan's international allies over the following three years, to rebuild the nation, while Guterres urged for", "label": 0}
{"input": "The Eurovision Song Contest 2014 was the 59th edition of the Eurovision Song Contest. It took place in Copenhagen, Denmark, following the country's victory at the 2013 contest with the song \"Only Teardrops\" by Emmelie de Forest. Organised by the European Broadcasting Union (EBU) and host broadcaster Danish Broadcasting Corporation (DR), the contest was held at B&W Hallerne, and consisted of two semi-finals on 6 and 8 May, and a final on 10 May 2014. The three live shows were presented by Danish television presenter Lise Rønne, musician Nikolaj Koppel and actor Pilou Asbæk.Thirty-seven countries participated in the contest; this included the return of Poland and Portugal after absences of two years and one year respectively. Overall, there were two fewer countries competing compared to the previous year, making thirty-seven participants, the smallest number since 2006. Bulgaria, Croatia, Cyprus and Serbia announced that they would not be taking part. The winner was Austria with the song \"Rise Like a Phoenix\", performed by Conchita Wurst and written by Charley Mason, Joey Patulka, Ali Zuckowski, and Julian Maas. Austria's victory was the longest gap between victories for any country at the time - 48 years, not having won since 1966. The Netherlands, Sweden, Armenia and Hungary rounded out the top five, with the Netherlands achieving their best result since their victory in 1975, Hungary achieving their best result since their fourth place in 1994, and Armenia equalling their best result from 2008. Of the \"Big Five\" countries, only Spain achieved a place in the top ten, while France", "label": 1}
{"input": "The Swedish anti-terrorism bill of 2023 refers to the anti-terrorism legislation debated by the Swedish parliament. The new legislation has been first proposed in 2017 following the Stockholm truck attack and would criminalise \"the participation in a terrorist organisation\". Sweden has debated introducing anti-terrorism legislation before but those efforts has been hampered by human rights activists. The legislation has not been finalized but gained new momentum following the Russian invasion of Ukraine in 2022, after which Sweden applied to join NATO, only for the Swedish application to run into opposition from Turkey, on the grounds that Sweden and Finland (which also applied at the same time) \"host terrorist organisations which act against Turkey\", including the PKK, PYD, YPG and Gülen movement. While the PKK is recognised as a terrorist organisation in both Sweden and Turkey, the Gülen movement is not recognised as a terrorist organisation in Sweden. The Turkish government has since requested the extradition of members of the Gülen movement and the PKK from Finland and Sweden; that the countries stop supporting the Gülen movement, the PKK, and terrorism; and that Finland and Sweden should address Turkish security concerns.In March 2023 representatives of the Swedish government announced that the government would submit an anti-terrorism bill, partially aimed at addressing Turkish concerns, in the near future, with tentative plans to see the legislation enacted by June. A necessary amendment to the Swedish constitution related to the proposed law already entered into force in January that year after a parliamentary vote in preceding November. The legislation may", "label": 0}
{"input": "Anti-government protests (Khmer: បាតុកម្មប្រឆាំងរាជរដ្ឋាភិបាល) were a series of protests in Cambodia from July 2013 to July 2014. Popular demonstrations in Phnom Penh took place against the government of Prime Minister Hun Sen, triggered by widespread allegations of electoral fraud during the Cambodian general election of 2013. Demands to raise the minimum wage to $160 a month and resentment at Vietnamese influence in Cambodia have also contributed to the protests. The main opposition party refused to participate in parliament after the elections, and major demonstrations took place throughout December 2013. A government crackdown in January 2014 led to the deaths of 4 people and the clearing of the main protest camp.Cambodian protests may have been partly precipitated by the perception of corruption, lack of freedom and poor quality of life in the country. Cambodia is near the bottom of international rankings in the measurement of those factors. Inequality in the distribution of wealth is a recognized problem, as is the statistic that a third of children are malnourished, and the difficulty that government critics are rounded up and detained on dubious charges.Cambodia's strongman Hun Sen has affirmed his 'pre-eminence' by closing Freedom Park, an opposition protest site in central Phnom Penh that is now strictly off limits to the public and appears to be like a 'fortified military base'. Cambodians are 'riled by incessant land grabs, official corruption and labor disputes in a country tightly controlled by one man for nearly three decades.' Freedom Park, is closed now indefinitely. Protests have now \"fizzled out after a crackdown", "label": 1}
{"input": "The 2023 Berlin repeat state election was held on 12 February 2023 to once again elect the 19th Abgeordnetenhaus of Berlin. The 19th Abgeordnetenhaus was originally elected on 26 September 2021. On 16 November 2022, the Constitutional Court of the State of Berlin declared the results invalid due to numerous irregularities and ordered a repeat election within 90 days. A decision by the Federal Constitutional Court regarding five constitutional complaints is still pending, but will not be decided until after the repeat election. The incumbent government was a coalition of the Social Democratic Party (SPD), The Greens, and The Left led by Governing Mayor Franziska Giffey. Alongside the Abgeordnetenhaus election, the borough council results were also ruled invalid and repeat elections ordered for the same date.With 28% of votes, the opposition Christian Democratic Union (CDU) grew by over ten percentage points and emerged as the largest party by a wide margin, the first time it had done so since 1999. All three governing parties declined; the SPD suffered its worst result in over a century with 18.4%, and only barely remained ahead of the Greens by a margin of 53 votes. The Left also slipped to 12%. The Alternative for Germany (AfD) recorded a small upswing to 9%, while the Free Democratic Party (FDP) fell to 4.6% and lost all their seats. Overall, the incumbent government retained a reduced majority. The CDU claimed a mandate to govern given its first-place result, while mayor Giffey committed to remaining in government. The Left called for a renewal of", "label": 0}
{"input": "Malaysia Airlines Flight 370 (MH370/MAS370) was an international passenger flight operated by Malaysia Airlines that disappeared on 8 March 2014 while flying from Kuala Lumpur International Airport in Malaysia to its planned destination, Beijing Capital International Airport in China. The crew of the Boeing 777-200ER, registered as 9M-MRO, last communicated with air traffic control (ATC) around 38 minutes after takeoff when the flight was over the South China Sea. The aircraft was lost from ATC’s secondary surveillance radar screens minutes later, but was tracked by the Malaysian military’s primary radar system for another hour, deviating westward from its planned flight path, crossing the Malay Peninsula and Andaman Sea. It left radar range 200 nautical miles (370 km; 230 mi) northwest of Penang Island in northwestern Peninsular Malaysia. With all 227 passengers and 12 crew aboard presumed dead, the disappearance of Flight 370 was the deadliest incident involving a Boeing 777 and the deadliest in Malaysia Airlines' history until it was surpassed in both regards by Malaysia Airlines Flight 17, which was shot down while flying over eastern Ukraine four months later on 17 July 2014. The combined loss caused significant financial problems for Malaysia Airlines, which was renationalised by the Malaysian government in August 2014. The search for the missing airplane became the most expensive search in the history of aviation. It focused initially on the South China Sea and Andaman Sea, before a novel analysis of the aircraft's automated communications with an Inmarsat satellite indicated that the plane had traveled far southward over the southern", "label": 1}
{"input": "General elections were held in Costa Rica on Sunday, 2 February 2014 to elect a new president, two vice presidents, and 57 Legislative Assembly lawmakers. In accordance with Article 132 of the constitution, incumbent President Laura Chinchilla Miranda was ineligible to run for a second consecutive term.The ruling National Liberation Party put forward San José Mayor Johnny Araya Monge as its presidential candidate; the Libertarian Movement party nominated former legislator Otto Guevara Guth; the leftist Broad Front nominated José María Villalta Florez-Estrada; and the center-left Citizens' Action Party nominated Luis Guillermo Solís Rivera. Opinion polls in December 2013 showed Araya ahead with 37 percent, Villalta close behind at 32 percent, Guevara at 15 percent, and Solís trailing at eight percent, suggesting the likelihood of a run-off vote in February. Villalta's strong showing in the polls caused concern among Araya supporters and business leaders in Costa Rica. La Nacion, Costa Rica's most important newspaper and a historical ally of Liberacion Nacional, began a concerted series of attacks against Villalta, comparing him to Venezuela's Hugo Chávez. Political experts later concluded that this focus on Villalta helped Luis Guillermo Solis in the election.In the presidential election, Solís and Araya came first and second, respectively, with neither candidate reaching 40 percent of the valid poll in the first round of voting, so a second round of voting was held from 6am to 6pm on 6 April, the first run-off election since 2002.In a surprise move, Araya announced on 6 March that he would abandon his campaign for the run-off election.", "label": 1}
{"input": "The Rotherham child sexual exploitation scandal consists of the organised child sexual abuse that occurred in the town of Rotherham, South Yorkshire, Northern England from the late 1980s until the 2010s and the failure of local authorities to act on reports of the abuse throughout most of that period. Researcher Angie Heal, who was hired by local officials and warned them about child exploitation occurring between 2002 and 2007, has since described it as the \"biggest child protection scandal in UK history\". Evidence of the abuse was first noted in the early 1990s, when care home managers investigated reports that children in their care were being picked up by taxi drivers. From at least 2001, multiple reports passed names of alleged perpetrators, several from one family, to the police and Rotherham Council. The first group conviction took place in 2010, when five British-Pakistani men were convicted of sexual offences against girls aged 12–16. From January 2011 Andrew Norfolk of The Times pressed the issue, reporting in 2012 that the abuse in the town was widespread and that the police and council had known about it for over ten years.The Times articles, along with the 2012 trial of the Rochdale child sex abuse ring, prompted the House of Commons Home Affairs Committee to conduct hearings. Following this and further articles from Norfolk, Rotherham Council commissioned an independent inquiry led by Professor Alexis Jay. In August 2014 the Jay report concluded that an estimated 1,400 children had been sexually abused in Rotherham between 1997 and 2013, predominantly by", "label": 1}
{"input": "World news or international news or even foreign coverage is the news media jargon for news from abroad, about a country or a global subject. For journalism, it is a branch that deals with news either sent by foreign correspondents or news agencies, or – more recently – information that is gathered or researched through distance communication technologies, such as telephone, satellite TV or the internet. Although in most of the English-speaking world this field is not usually regarded as a specific specialization for journalists, it is so in nearly all the world. Particularly in the United States, there is a blurred distinction between world news and \"national\" news when they include directly the national government or national institutions, such as wars in which the US are involved or summits of multilateral organizations in which the US are a member. At the birth of modern journalism, most news were foreign, as registered by the courants of the 17th century in West and Central Europe, such as the Daily Courant (England), the Nieuwe Tijudinger (Antwerp), the Relation (Strasbourg), the Avisa Relation oder Zeitung (Wolfenbüttel) and the Courante Uyt Italien, Duytsland & C. (Amsterdam). Since these papers were aimed at bankers and merchants, they brought mostly news from other markets, which usually meant other nations. In any case, it is worthy to remark that nation-states were still incipient in 17th-century Europe. From the 19th century on, with newspapers already established in Europe, the United States and a few other countries, innovations in telecommunications such as the telegraph made", "label": 0}
{"input": "The 65th Annual Grammy Awards ceremony was a music awards ceremony held at the Crypto.com Arena in Los Angeles on February 5, 2023. It recognized the best recordings, compositions, and artists of the eligibility year – October 1, 2021 to September 30, 2022 – as determined by the members of National Academy of Recording Arts and Sciences. The nominations were announced on November 15, 2022. South African comedian Trevor Noah, who hosted the 63rd and 64th ceremonies, returned again.Beyoncé received the most nominations (nine) and tied Maverick City Music for wins (four), followed by Kendrick Lamar with eight nominations and three wins, and Adele and Brandi Carlile with seven nominations each. With a career total of 88 nominations, Beyoncé tied with her husband Jay-Z as the most nominated artists in Grammy history. Bad Bunny's Un Verano Sin Ti (2022) became the first Spanish-language album to be nominated for Album of the Year.With her win in the Best Dance/Electronic Album category, Beyoncé passed Hungarian-British conductor Georg Solti for the record of most Grammy awards in the ceremony's history, with 32. Harry Styles won Album of the Year for Harry's House, becoming the first male British solo artist to win since George Michael in 1989. Lizzo won Record of the Year for \"About Damn Time\", becoming the first black woman to win the award since Whitney Houston in 1994. Bonnie Raitt won Song of the Year for \"Just Like That\", becoming the first female solo songwriter to win since Amy Winehouse in 2008. Samara Joy won Best New", "label": 0}
{"input": "S.A.S. v. France was a case brought for the European Court of Human Rights which ruled that the French ban on face covering did not violate European Convention on Human Rights's (ECHR) provisions on right to privacy or freedom of religion, nor other invoked provisions. On these two points, the Court held her decision by fifteen votes to two. The two judges in the minority expressed their partly dissenting opinion. The French ban against face covering, loi n° 2010-1192 du 11 octobre 2010 interdisant la dissimulation du visage dans l'espace public, was adopted on 11 October 2010 and went into effect on 11 April 2011. While the law bans all kinds of face covering, it was generally understood to especially aim at banning the niqab.On the same day the law came into force, a French woman born in 1990 of Pakistani origin referred to as S.A.S. filed a complaint against the French state as the law prevented to her from wearing the niqab in public places.The woman argued that the law violated articles 3 (against inhuman or degrading treatment or punishment), 8 (on the right to privacy), 9 (on the freedom of religion), 10 (on the right to freedom of expression), 11 (on the right to freedom of assembly), and 14 (which prohibits discrimination) of the ECHR.On their side, the French state argued with regard to articles 8 and 9, that the exceptions in paragraph 2 of these articles applied. Paragraph 2 of article 9 allows limitations on the right to religion if the limitations \"are", "label": 1}
{"input": "The blockade of the Gaza Strip is the ongoing land, air, and sea blockade of the Gaza Strip imposed by Israel and Egypt temporarily in 2005–2006 and permanently from 2007 onwards, following the Israeli disengagement from Gaza.The blockade was made permanent after Hamas took control of the Gaza Strip during the Battle of Gaza, seizing government institutions and replacing Fatah and other Palestinian Authority (PA) officials with Hamas members. Earlier, after Hamas won elections and formed the PA government in March 2006, led by Ismail Haniya, Israel and the Quartet on the Middle East set conditions before they would continue to provide aid to the PA or have any dialogue with any member of a Hamas-led PA government. These conditions were: recognition of Israel, disavowal of violent actions, and acceptance of previous agreements between Israel and the PA, including the Oslo Accords. Hamas refused to accept these conditions and aid to the PA was stopped and sanctions against the PA imposed.When Hamas took over Gaza, Egypt and Israel largely closed their border crossings with Gaza, on the grounds that Fatah and PA forces had fled the Strip and were no longer able to provide security on the Palestinian side. Egypt was worried that Hamas control of Gaza would increase Iranian influence. Egyptian Foreign Minister Aboul Gheit also explained that opening the Rafah border crossing, the only crossing on the Egypt-Gaza border, would undermine the legitimacy of the PA. Israel said that the blockade was necessary to protect Israeli citizens from \"terrorism, rocket attacks and any other", "label": 1}
{"input": "Mercedes-Benz Fashion Week is an annual fashion industry event held in Sydney, Australia. The event is a part of Australian Fashion Week and has taken place at Carriageworks for two consecutive years. The 2014 event was held from 6–10 April. The event focuses on providing Australian designers a platform to connect with a global audience of fashion buyers, press and consumers.The industry-only event showcased over 70 designers, including 25 designers from Sydney, four from Melbourne, four from Perth, two from Brisbane and one from Adelaide. There was also one designer from Bali and China. The 2014 designer showcase featured mostly start-up labels fresh from fashion school. Lan Yu became the first Chinese designer to showcase at Mercedes-Benz Fashion Week Australia. In 2013, Mercedes-Benz Fashion Week Sydney generated an estimate $4.8 million into the New South Wales economy. It costs between $6000 to $14,500 to secure a show at Fashion Week and can end up exceeding costs of $80,000 when models and all other production costs are factored in. The 2014 event had 20 confirmed buyers from ASOS, Addison Crescent, Browns Fashion, House of Fraser, Harvey Nichols, Nasty Gal, Net-a-Porter and Selfridges. Mercedes-Benz Fashion Week Sydney 2014 also featured an Indigenous Fashion Week at Sydney's Town Hall and also supported the first Mercedes-Benz Fashion Week Weekend Edition which was open to for the public to attend. Mercedes-Benz Fashion Week Sydney 2014 caused a debate about the use of skinny models in runway shows, when Marie Claire editor Jackie Frank called a model's agent to enquire about her", "label": 1}
{"input": "On 3 October 2014, Canadian Prime Minister Stephen Harper announced that he would put forth a motion to send forces to participate in the coalition for military intervention against ISIL by deploying combat aircraft. On 7 October 2014, the House of Commons approved of sending nine aircraft to join coalition airstrikes against ISIL in Iraq along with 69 special forces advisors to train the Iraqi government's military. The Canadian Armed Forces' contribution to the coalition against ISIL was later dubbed Operation Impact. On 30 March 2015, the House of Commons voted to extend the mission to targets in Syria. No additional forces were announced.In late November 2015, new Prime Minister Justin Trudeau announced the withdrawal of Canada's fighter aircraft from the fight against ISIL, but their surveillance and transport and refuelling aircraft would remain in the area. All airstrikes by the Canadian fighter aircraft ended as of 15 February 2016. As part of the Canadian reorganization of the operation in February 2016, it was announced the number of military trainers would triple to a total of 600 ground personnel. This force was later augmented in mid-May 2016 by three Bell CH-146 Griffon helicopters.On 20 July 2016, it was announced by Defence Minister Harjit Sajjan that Canada was deploying a field hospital in support of United States and French troops in their effort to retake Mosul. The hospital requires 60 personnel, however the Minister said that the number of committed to the overall operation would not climb. The hospital's deployment would be for one year.On 7 January", "label": 1}
{"input": "The Good News International Ministries (GNIM), commonly known as the Malindi cult and previously as the Servant P. N. Mackenzie Ministries, is a new religious movement based in Shakahola, Kilifi, Kenya, that was founded by Paul Nthenge Mackenzie and his wife in 2003. Though often listed as a Christian organisation, many of its teachings contradict mainstream Christianity. The group attracted international attention in April 2023 when it was revealed that Mackenzie had allegedly instructed members to starve themselves en masse to \"meet Jesus\", resulting in the deaths of at least 110 people. The group, often described as a cult, is adamantly anti-Western, with amenities such as health care, education, and sports being dismissed as \"evils of western life\" and with Mackenzie condemning the United States, the United Nations, and the Catholic Church as \"tools of Satan\". The group also devotes much of its teachings to the end times. They purport to be followers of the End-Time Message of William Branham. Homicide detectives working the case said the group was radicalized by Branham's teachings, leading to their deaths.Mackenzie founded the GNIM in 2003 and accumulated a sizable following, largely due to convincing his followers that he could speak directly with God. Beginning in the late 2010s, Mackenzie's church began to receive a renewed wave of scrutiny regarding the internal practices of the organization. In 2017, Mackenzie and his wife faced several charges relating to the church. He was chastised for inciting students to abandon their education after denouncing it as \"ungodly\", as well as radicalizing and denying", "label": 0}
{"input": "The Trojan Horse scandal, also known as \"Operation Trojan Horse\" or the Trojan Horse affair, involves claims of an alleged conspiracy to introduce an \"Islamist\" or \"Salafist\" ethos into several schools in Birmingham, England. The name, based on the Greek legend, comes from an anonymous letter sent to Birmingham City Council in late 2013, alleged to be from Birmingham \"Islamists\" detailing how to wrest control of a school, and speculating about expanding the scheme to other cities. The letter was leaked to the press in March 2014. Around a month later, Birmingham City Council revealed that following the letter release it had received hundreds of allegations of plots similar to those described in the letter, some claims dating back over 20 years.Tahir Alam, former chairman of the Park View Educational Trust which ran three schools in Birmingham, was alleged to have written a 72-page document for the Muslim Council of Britain in 2007 detailing a blueprint for the \"Islamisation\" of secular state schools, a claim that has been widely debunked. This document provided guidance about the religious needs and practices of Muslim parents and pupils that would facilitate their integration into schools. It was entitled Towards Greater Understanding: Meeting the Needs of Muslim Pupils in State Schools. Information and Guidance for Schools and is available as an appendix to the Kershaw Report. The introduction of the document states that the \"purpose is to promote greater understanding of the faith, religious and cultural needs of Muslim pupils and how they can be accommodated within schools. It also", "label": 1}
{"input": "The Battle of Shuja'iyya occurred between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades on 20 July 2014 during 2014 Israel–Gaza conflict in the Shuja'iyya neighborhood of Gaza City, in the Gaza Strip.: 71 Shuja'iyya, with 92,000 people in 6 sq-kilometres, is one of the most densely populated areas of the Gaza Strip. According to the IDF, it had become a \"terrorist fortress\", that between 8 and 20 July had fired over 140 rockets into Israel after the outbreak of hostilities. Casualty figures are not known with precision, partly because bodies were recovered long after the fighting, and people had also died of injuries afterwards. The UN Protection Cluster states that between the 19-20th, 55 civilians, including 19 children and 14 women, were killed as a result of the IDF's actions. At the time, estimates varied from 66 to about 120 Palestinians killed, with a third of them women and children, and at least 288 wounded. The UN figures of Palestinian casualties are preliminary and subject to revision. 13 Israeli soldiers were killed.On 16 July, Israeli forces told residents of Shuja'iyya to leave and relocate to central Gaza City until further notice by means of leaflets, loudspeaker announcements, telephone calls, text messages, and radio messages. Residents interviewed afterwards by The Independent claimed lack of safe refuges and the difficulty of fleeing as reasons for staying put. By 19 July, OCHA reported that while the majority ignored the warnings and had not left their homes, up to half had gone as bombardments intensified. Israel condemned", "label": 1}
{"input": "On 24 February 2022, Russia invaded and occupied parts of Ukraine in a major escalation of the Russo-Ukrainian War, which had begun in 2014. The invasion has resulted in tens of thousands of deaths on both sides, and instigated Europe's largest refugee crisis since World War II. About 8 million Ukrainians were displaced within their country by June, and more than 8.1 million had fled the country by March 2023. For months before the invasion, Russian troops massed around Ukraine's borders while Russian officials repeatedly denied plans to attack Ukraine. On 24 February 2022, Russian President Vladimir Putin announced a \"special military operation\" to support the Russian-controlled breakaway republics of Donetsk and Luhansk, whose military forces had been fighting Ukraine in the Donbas conflict. He said the goal was to \"demilitarise\" and \"denazify\" Ukraine. Putin espoused irredentist views, challenged Ukraine's right to statehood, and falsely claimed that Ukraine was governed by neo-Nazis who persecuted the ethnic Russian minority. Minutes later, Russian air strikes and a ground invasion were launched along a northern front from Belarus towards Kyiv, a north-eastern front towards Kharkiv, a southern front from Crimea, and a south-eastern front from the Donbas. In response, Ukrainian president Volodymyr Zelenskyy enacted martial law and ordered a general mobilisation. Russian troops had retreated from the northern front by April. On the southern and south-eastern fronts, Russia captured Kherson in March and then Mariupol in May after a destructive siege. On 18 April, Russia launched a renewed battle of Donbas. Russian forces continued to bomb both military and", "label": 0}
