{"input": "The 12th Circle Chart Music Awards ceremony was held at KSPO Dome in Seoul on February 18, 2023, to recognise the best artists and recordings, primarily based on Circle Music Chart of", "label": 0}
{"input": "Hurricane Ana was the second tropical cyclone in 2014 to threaten the U.S. state of Hawaii with a direct hit, after Iselle in August. The twenty-first named storm and fifteenth hurricane of", "label": 1}
{"input": "On 6 February 2023 a referendum was held in the Wolayita, Gamo, Gofa, South Omo, Gedeo, and Konso Zones, as well as the Dirashe, Amaro, Burji, Ale, and Basketo special woredas of", "label": 0}
{"input": "The Swedish Centre Party's party leadership election was held at an extraordinary party meeting on 2 February 2023 in Helsingborg. The Centre Party nominated Muharrem Demirok to succeed to outgoing party leader", "label": 0}
{"input": "Between the months of March and April 2014, a court in Minya, Egypt, has recommended the death sentence to hundreds of members and supporters of the banned Muslim Brotherhood over an attack", "label": 1}
{"input": "A crisis at the National Public Health Laboratory in Khartoum, Sudan, started after it was seized by armed forces during the Sudan conflict in April 2023. The World Health Organization (WHO) said", "label": 0}
{"input": "The 2014 Coupe de la Ligue Final was the 20th final of France's football league cup competition, the Coupe de la Ligue, a competition for the 42 teams that the Ligue de", "label": 1}
{"input": "The 2013–2016 epidemic of Ebola virus disease, centered in Western Africa, was the most widespread outbreak of the disease in history. It caused major loss of life and socioeconomic disruption in the", "label": 1}
{"input": "The BRW Rich 200, 2014 is the 31st annual survey of the wealthiest people resident in Australia, published online by The Australian Financial Review on 26 June 2014.In the 2014 list, the", "label": 1}
{"input": "On February 11, 2023, NORAD, at the direction of the Canadian Minister of National Defence and Chief of the Defence Staff, downed an unidentified object over the Yukon.After snowfall in the area", "label": 0}
{"input": "The case of Ashya King concerns a boy named Ashya King, who had a brain tumour. His parents, Brett and Naghemeh King, took their son out of Southampton General Hospital (England) in", "label": 1}
{"input": "Cyprus selected their Junior Eurovision Song Contest 2014 entry through an internal selection. On 21 July 2014 it was revealed that Sophia Patsalides would represent Cyprus in the contest with the song", "label": 1}
{"input": "The 67th British Academy Film Awards, more commonly known as the BAFTAs, were held on 16 February 2014 at the Royal Opera House in London, honouring the best national and foreign films", "label": 1}
{"input": "A by-election was held on 20 November 2014 for the UK parliamentary constituency of Rochester and Strood in Kent, England. The sitting Member of Parliament (MP) Mark Reckless called it on joining", "label": 1}
{"input": "Miss Brazil World 2014 was the 25th edition of the Miss Brazil World pageant and the 9th under MMB Productions & Events. The contest took place on August 9, 2014. Each state,", "label": 1}
{"input": "The 2022–23 Australian bushfire season was the season of summer bushfires in Australia. The outlook for the season was below average in coastal parts of south-eastern Australia due high rainfall associated with", "label": 0}
{"input": "An explosion occurred on April 10, 2023, at the South Fork Dairy Farm in Dimmitt, Texas, United States. The explosion and subsequent fire killed approximately 18,000 cows and injured one person. The", "label": 0}
{"input": "The 80th Golden Globe Awards honored the best in film and American television of 2022, as chosen by the Hollywood Foreign Press Association (HFPA). The ceremony was held on January 10, 2023,", "label": 0}
{"input": "The 3rd Critics' Choice Super Awards, presented by the Critics Choice Association and honoring the best in genre fiction film and television. The nominees were announced on February 22, 2023. The winners", "label": 0}
{"input": "The Pocklington Iron Age burial ground is a prehistoric cemetery discovered in 2014 on the outskirts of Pocklington in the East Riding of Yorkshire, England. Excavations carried out on an ongoing basis", "label": 1}
{"input": "The 2023 NBA playoffs is the ongoing postseason tournament of the National Basketball Association's 2022–23 season. The playoffs began on April 15 and will end with the conclusion of the 2023 NBA", "label": 0}
{"input": "On 2 April 2023, a bombing occurred in the Street Food Bar №1 café on Universitetskaya Embankment in Saint Petersburg, Russia. Russian military blogger Vladlen Tatarsky, real name Maxim Fomin, died as", "label": 0}
{"input": "The 2014 Georgian local elections (Georgian: საქართველოს ადგილობრივი თვითმმართველობის ორგანოების არჩევნები) were held on 15 June and 12 July 2014 to elect the councils of local government, sakrebulo, mayors of 12 self-governing", "label": 1}
{"input": "The 2022–23 season is the 118th season in the existence of Galatasaray and the club's 65th consecutive season in the top flight of Turkish football. In addition to the domestic league, Galatasaray", "label": 0}
{"input": "The 16th Houston Film Critics Society Awards were announced on February 18, 2023, at the Midtown Arts & Theater Center Houston (MATCH) in Texas. The nominations were announced on January 10, 2023,", "label": 0}
{"input": "Music Awards Ceremony (MAC) 2023, presented by Sky Music, was held on 25 and 26 January 2023 to recognize the best in the music of former Yugoslav countries. The ceremony took place", "label": 0}
{"input": "A constitutional referendum was planned to be held in Mali on 19 March 2023. It was initially scheduled for 9 July 2017. However, in late June it was postponed with no date", "label": 0}
{"input": "The SIM Registration Act, officially designated as Republic Act No. 11934 and commonly referred to as the SIM card law, is a Philippine law mandating the registration of SIM cards before activation.", "label": 0}
{"input": "Mister World 2014 was the 8th edition of the Mister World competition. It was held at The Riviera International Conference Centre in Torbay, Devon, England on June 15, 2014. Francisco Javier Escobar", "label": 1}
{"input": "The Cuban thaw (Spanish: Deshielo cubano) was the normalization of Cuba–United States relations that began in December 2014 ending a 54-year stretch of hostility between the nations. In March 2016, Barack Obama", "label": 1}
{"input": "Presidential elections are scheduled to be held in the Maldives on Monday 9 September 2023. Incumbent president Ibrahim Mohamed Solih will be seeking re-election, after defeating Speaker of the People's Majlis Mohamed", "label": 0}
{"input": "International reactions to the annexation of Crimea by the Russian Federation have largely been condemnatory of Russia's actions, supportive of Ukraine's sovereignty and territorial integrity, and supportive of finding a quick end", "label": 1}
{"input": "The 2014 Berlin Marathon was the 41st edition of the Berlin Marathon. The marathon took place in Berlin, Germany, on 28 September 2014 and was the fourth World Marathon Majors race of", "label": 1}
{"input": "Concluding observations on the second periodic report of the Holy See was a 2014 report issued by the Office of the United Nations High Commissioner for Human Rights, regarding the handling by", "label": 1}
{"input": "The 28th Critics' Choice Awards were presented on January 15, 2023, at the Fairmont Century Plaza Hotel in Los Angeles, California, honoring the finest achievements of filmmaking and television programming in 2022.", "label": 0}
{"input": "Local elections are being held in four municipalities in the north of Kosovo on 23 April 2023. They were initially scheduled to be held in December 2022 but were subsequently postoned. The", "label": 0}
{"input": "China–Brazil Earth Resources Satellite 4 (CBERS-4), also known as Ziyuan I-04 or Ziyuan 1E, is a remote sensing satellite intended for operation as part of the China–Brazil Earth Resources Satellite program between", "label": 1}
{"input": "The 10th Platino Awards, presented by the Entidad de Gestión de Derechos de los Productores Audiovisuales (EGEDA) and the Federación Iberoamericana de Productores Cinematográficos y Audiovisuales (FIPCA), took place on 22 April", "label": 0}
{"input": "Snap legislative elections are scheduled to be held in Guinea-Bissau on 4 June 2023. Incumbent president Umaro Sissoco Embalo dissolved the parliament on 16 May 2022, accusing deputies of corruption and \"unresolvable\"", "label": 0}
{"input": "The Yarkand Massacre was an episode of violence that began on 28 July 2014 in Yarkant County, Kashgar Region of the Xinjiang Uyghur Autonomous Region, China, and lasted for several days, as", "label": 1}
{"input": "The General Debate of the sixty-ninth session of the United Nations General Assembly commenced on 24 September 2014 and ended on 1 October 2014. Leaders from a number of member states addressed", "label": 1}
{"input": "EgyptSat 2 (also called MisrSat 2) was Egypt's second remote sensing Earth observation satellite. It was built by the Russian RSC Energia and the Egyptian NARSS while the incorporated cameras and payload", "label": 1}
{"input": "Operation Full Disclosure (Hebrew: מבצע חשיפה מלאה) was a military operation carried out by the Israel Defense Forces on March 5, 2014, in the Red Sea. After days of surveillance far out", "label": 1}
{"input": "Miss USA 2023 will be the 72nd Miss USA pageant that will be held in 2023 at the Grand Sierra Resort in Reno, Nevada. Morgan Romano of North Carolina will crown her", "label": 0}
{"input": "Occupy Ghana also known as Occupy Flagstaff House is a protest or pressure movement in Ghana which started online as #occupyflagstaffhouse or #occupyflagstaff, and generated into an offline protest. On July 1,", "label": 1}
{"input": "On 20 March 2014, Taliban militants carried out a mass shooting in the restaurant of the Kabul Serena Hotel, in Kabul, Afghanistan. The shooting, which took place in a hotel popular with", "label": 1}
{"input": "The 41st Hong Kong Film Awards presentation ceremony took place at Hong Kong Cultural Centre on 16 April 2023. Nominations were announced on 9 February 2023. The Sparring Partner received 16 nominations", "label": 0}
{"input": "The 13N was a Cacerolazo against President Cristina Fernández de Kirchner that took place in Argentina on November 13, 2014. It was organized by social networks. The people in the demonstration protested", "label": 1}
{"input": "The Cemfjord was a Cyprus-registered cargo ship which foundered in the Pentland Firth off the north-east coast of Scotland on 2 January 2015. Built as the general cargo ship Margareta in 1984,", "label": 1}
{"input": "The 2014 Paris Municipal elections took place on 23 and 30 March 2014, at the same time as other French municipal elections. Anne Hidalgo of the Socialist Party was elected mayor of", "label": 1}
{"input": "A concert and rally took place on 22 February 2023 at Luzhniki Stadium in Moscow. TASS reported that the rally commemorated Defender of the Fatherland Day. Ukrainska Pravda stated that the date", "label": 0}
{"input": "25 Churchill Place is a 118 metres (387 ft) tall skyscraper in the eastern part of the London financial district Canary Wharf. It was built in 2014 and has 23 storeys. The", "label": 1}
{"input": "The 2014 Iquique earthquake struck off the coast of Chile on 1 April, with a moment magnitude of 8.2, at 20:46 local time (23:46 UTC). The epicenter of the earthquake was approximately", "label": 1}
{"input": "On January 19, 2023, the United States hit its debt ceiling, beginning an ongoing debt-ceiling crisis. In response, Janet Yellen, the secretary of the treasury, began enacting temporary \"extraordinary measures\". The crisis", "label": 0}
{"input": "The First Cabinet of Kim Kielsen was a former administration of Greenland. It was appointed on 10 December 2014 with Kim Kielsen from Forward (Siumut) as Prime Minister, leading a coalition between", "label": 1}
{"input": "The 2014 Gaza War, also known as Operation Protective Edge (Hebrew: מִבְצָע צוּק אֵיתָן, romanized: Miv'tza Tzuk Eitan, lit. 'Operation Strong Cliff'), was a military operation launched by Israel on 8 July", "label": 1}
{"input": "The 2014 G20 Brisbane summit was the ninth meeting of the G20 heads of government/heads of state. It was held in Brisbane, the capital city of Queensland, Australia, on 15–16 November 2014.", "label": 1}
{"input": "Spectra is the name of a series of art installations by Ryoji Ikeda which use intense white light as a sculptural material. The most recent presentation of spectra was in Hobart, Tasmania,", "label": 1}
{"input": "On the morning of 18 November 2014, two Palestinian men from Jerusalem entered Kehilat Bnei Torah synagogue, in the Har Nof neighborhood of Jerusalem, and attacked the praying congregants with axes, knives,", "label": 1}
{"input": "The Local Audit and Accountability Act 2014 is a United Kingdom act of parliament. Its main provisions: abolish the Audit Commission and repeal the Audit Commission Act 1998 (section 1) establish new", "label": 1}
{"input": "General elections were due to be held in Sark on 10 December 2014. However, only 16 candidates nominated for the 16 seats in the Chief Pleas, meaning that all were elected unopposed,", "label": 1}
{"input": "Marius (6 February 2012 – 9 February 2014) was a male giraffe living at Copenhagen Zoo. Though healthy, he was genetically unsuitable for future captive breeding, as his genes were over-represented in", "label": 1}
{"input": "Miss Philippines Earth 2023 was the 23rd edition of the Miss Philippines Earth pageant, it was held at the Toledo City Sports Center in Toledo, Cebu, Philippines on April 29, 2023.At the", "label": 0}
{"input": "The 2023 Nobel Peace Prize is an international peace prize established according to Alfred Nobel's will that will be announced on October 2023 by the Norwegian Nobel Committee in Oslo, Norway, and", "label": 0}
{"input": "The Eurovision Debate is a live televised debate between the lead political candidates (“Spitzenkandidaten”) running to be the next President of the European Commission. Produced by the European Broadcasting Union (EBU) and", "label": 1}
{"input": "A photograph of then-Labour Party leader Ed Miliband eating a bacon sandwich became a source of sustained commentary and the subject of an internet meme in 2014 and 2015. Taken for the", "label": 1}
{"input": "On 23 June 2014, a German Eurofighter Typhoon fighter jet and a Learjet 35 business jet participating in a military exercise collided mid-air over Olsberg, North Rhine-Westphalia, Germany. The Learjet subsequently crashed", "label": 1}
{"input": "The removal of Indonesia as FIFA U-20 World Cup 2023 hosts was a political controversy that occurred in March 2023, when FIFA, the world governing body of association football, decided to strip", "label": 0}
{"input": "Armenia participated in the Junior Eurovision Song Contest 2014 which took place on 15 November 2014, in Marsa, Malta. The Armenian broadcaster Armenia 1 (ARMTV) was responsible for organising their entry for", "label": 1}
{"input": "This article is about the 2023 flower protests in Russia. There have also been other flower protests, e.g. in Myanmar in 2021 on Suu Kyi's 76th birthday Flower protests are a wave", "label": 0}
{"input": "The 2023 Nouakchott prison break was the result of a prison riot in the Nouakchott Civil Prison, the central prison of Mauritania. Four AQMI members managed to escape from the Nouakchott civil", "label": 0}
{"input": "The 2023 Chinese military exercises around Taiwan (simplified Chinese: 2023年环台军事演练; traditional Chinese: 2023年環台軍事演練) are a series of ongoing military exercises by the People's Liberation Army (PLA) of the People's Republic of China", "label": 0}
{"input": "The 2014 Vorarlberg state election was held on 21 September 2014 to elect the members of the Landtag of Vorarlberg. The Austrian People's Party (ÖVP) suffered substantial losses, and was deprived of", "label": 1}
{"input": "The XX International AIDS Conference was held in Melbourne, Australia from 20 to 25 July 2014 at the Melbourne Convention and Exhibition Centre. It was organized by the International AIDS Society). Over", "label": 1}
{"input": "On 15 May 2014, the double-decker ferry MV Miraj-4 capsized in the Meghna River, 50 kilometres (31 mi) southeast of Dhaka, Bangladesh. Between 150 and 200 people were on board at the", "label": 1}
{"input": "In 2022, heavy tensions broke out between the Democratic Republic of the Congo and Rwanda, which have led to several alleged attacks by Congolese and Rwandan forces on each other's territory. Rwandan", "label": 0}
{"input": "The 59th Baeksang Arts Awards (Korean: 제59회 백상예술대상) ceremony, organised by Ilgan Sports and JTBC Plus, was held at Incheon Paradise City, Incheon on April 28, 2023, at 17:30 KST. The event", "label": 0}
{"input": "Armenia is set to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom, having internally selected Brunette to represent the country with the song \"Future Lover\". Brunette was announced as", "label": 0}
{"input": "General elections were held in Paraguay on 30 April 2023. Incumbent president Mario Abdo Benítez and vice president Hugo Velázquez Moreno of the Colorado Party were ineligible from seeking re-election. Colorado candidate", "label": 0}
{"input": "Binibining Pilipinas 2023 will be the 59th edition of Binibining Pilipinas to be held on May 28, 2023 at the Smart Araneta Coliseum in Quezon City, Metro Manila, Philippines.At the end of", "label": 0}
{"input": "The 2023 South African National Shutdown was a protest held by the political party EFF on 20 March 2023, the day before Human Rights Day. The EFF called for the resignation of", "label": 0}
{"input": "Blockupy is a movement protesting against austerity. The Blockupy alliance includes trade unions and Germany's Linkspartei.Representing grass-roots critics of supranational financial institutions such as the “troika”: the European Commission (EC), European Central", "label": 1}
{"input": "The 2023 Belgian Cup Final, named Croky Cup after the sponsor, will be the 68th Belgian Cup final and is scheduled to be played on 30 April 2023. KV Mechelen qualified for", "label": 0}
{"input": "The 19th Irish Film & Television Academy Awards, also called the IFTA Film & Drama Awards 2023 or the 20th Anniversary IFTA Awards, will take place on 7 May 2023, hosted by", "label": 0}
{"input": "The FATCA agreement is an international agreement signed between Canada and the United States that allows the implementation of the Foreign Account Tax Compliance Act (an Act of the U.S. Congress) in", "label": 1}
{"input": "The floods in South Africa in February-March 2023 were caused by heavy rainfall as a result of the La Niña weather phenomenon, affecting seven provinces, including Eastern Cape, Northern Cape, Mpumalanga, KwaZulu-Natal,", "label": 0}
{"input": "The 2014 Toronto FC season was the eighth season in club history. During the off-season, Toronto FC agreed to a one-year partnership with USL outfit Wilmington Hammerheads. Jackson, Justin Morrow, Dwayne De", "label": 1}
{"input": "March in March refers to a series of marches which were held around Australia on 15–16 March 2014, and in Canberra, the national capital, on 17 March 2014, a parliamentary sitting day.", "label": 1}
{"input": "Serbia is set to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom, with \"Samo mi se spava\" performed by Luke Black. The Serbian national broadcaster, Radio Television of Serbia", "label": 0}
{"input": "The 2023 Backlash is the upcoming 18th Backlash professional wrestling pay-per-view (PPV) and livestreaming event produced by WWE. It will be held for wrestlers from the promotion's Raw and SmackDown brand divisions.", "label": 0}
{"input": "2013–2014 Atlantic winter storms in Europe were a series of winter storms affecting areas of Atlantic Europe and beyond. The French Atlantic coastal regions (chiefly Brittany), South West and Southern England, West", "label": 1}
{"input": "Conference of Western Balkan States was a 28 August 2014 conference of heads of states and governments of Western Balkans region initiated by German chancellor Angela Merkel. An idea for organization of", "label": 1}
{"input": "2014 Kalbajar incident refers to the crossing of a small group of Azerbaijanis into Kalbajar district, their subsequent capture and conviction for murder and sabotage by the Republic of Artsakh. In July", "label": 1}
{"input": "Parliamentary elections are scheduled to be held in Slovakia on 30 September 2023 to elect members of the National Council. The 2020 Slovak parliamentary election resulted in a coalition government led by", "label": 0}
{"input": "The 15th Negeri Sembilan state election will be held in 2023 to elect the State Assembly members of the 15th Negeri Sembilan State Legislative Assembly, the legislature of the Malaysian state of", "label": 0}
{"input": "General elections will be held in Guatemala on 25 June 2023 to elect the president and vice president, all 160 seats of the Congress, all 20 members of the Central American Parliament,", "label": 0}
{"input": "An ongoing refugee crisis began in Africa in mid-April 2023 after the outbreak of the 2023 Sudan conflict. By 1 May 2023, an estimated 73,000 to 100,000 people [1] have fled the", "label": 0}
{"input": "The 35th Lo Nuestro Awards were held at the Dade Arena in Miami on February 23, 2023, to recognize the most popular Spanish-language music of 2022. The ceremony will be broadcast on", "label": 0}
{"input": "Art Buff is a graffiti artwork by Banksy which was created in Folkestone in 2014, Banksy announcing it as \"part of the Folkestone triennial. Kind of\". The work depicts a woman wearing", "label": 1}
{"input": "The 14th National People's Congress is the current meeting of the legislative branch and, constitutionally, the supreme authority of the People's Republic of China. It convened in Beijing, on 5 March 2023,", "label": 0}
{"input": "The 23rd Actors and Actresses Union Awards ceremony was held on 10 March 2014 at the Teatro Coliseum in Madrid. The gala was hosted by Llum Barrera and Secun de la Rosa.In", "label": 1}
{"input": "Breck David Lafave Bednar (17 March 1999 – 17 February 2014) was an English teenager of American descent from Caterham, Surrey, who was murdered by 18-year-old Lewis Daynes on 17 February 2014,", "label": 1}
{"input": "2014 Commonwealth of Independent States Cup was the 22nd annual Commonwealth of Independent States Cup since its establishment in 1993. It was hosted in Saint Petersburg, Russia between 24 January and 2", "label": 1}
{"input": "Clashes on the Armenian–Azerbaijan border (Tavush–Qazakh) and the line of contact between the Nagorno-Karabakh and Azerbaijan started on 27 July 2014. Reported casualties of the clashes were some of the highest since", "label": 1}
{"input": "The Anti-Social Behaviour, Crime and Policing Act 2014 (c. 12) is an Act of the Parliament of the United Kingdom which consolidated and expanded law enforcement powers in addressing anti-social behaviour. One", "label": 1}
{"input": "Miss Universe Colombia 2023 will be the 3rd edition of the Miss Universe Colombia pageant, to be held in Colombia. María Fernanda Aristizabal Urrea of Quindio will crown her successor at the", "label": 0}
{"input": "Aljaž Bedene was the defending champion, and returned to defend his title but lost to Viktor Troicki in the quarterfinals. Viktor Troicki won the title by defeating Albert Ramos 7–5, 4–6, 7–5", "label": 1}
{"input": "The 18th Canadian Folk Music Awards will be presented between March 31 and April 2, 2023, to honour achievements in folk music by Canadian artists in 2022. Nominees were announced in October", "label": 0}
{"input": "Various countries and organizations have responded to the 6 February 2023 Turkey–Syria earthquake. At least 105 countries and 16 international organizations pledged support for victims of the earthquake, including humanitarian aid. More", "label": 0}
{"input": "Advanced Land Observing Satellite 3 (ALOS-3), also called Daichi 3, was a 3-ton Japanese satellite launched on March 7 2023. It was to succeed the optical sensor PRISM (Panchromatic Remote-sensing Instruments for", "label": 0}
{"input": "The 6th Hollywood Critics Association Film Awards, presented by the Hollywood Critics Association, took place on the evening of February 24, 2023 at the Beverly Wilshire Hotel, Beverly Hills, while the winners", "label": 0}
{"input": "In March 2023, pro-Khalistan Sikhs protested across the United States, the United Kingdom, Australia, Canada and Punjab, India, against the manhunt of the pro-Khalistan activist Amritpal Singh and crackdown on his organisation", "label": 0}
{"input": "The 2023 New Year Honours are appointments by some of the 15 Commonwealth realms to various orders and honours to recognise and reward good works by citizens of those countries. The New", "label": 0}
{"input": "The 2023 Census of Nigeria will be a detailed enumeration of the Nigerian population that will be the fifth national census in the country since Independence. It will be the first national", "label": 0}
{"input": "The war on terror, officially the Global War on Terrorism (GWOT), is a global counterterrorism military campaign initiated by the United States following the September 11 attacks and is also the most", "label": 1}
{"input": "The 2023 Nobel Prize in Literature is an international literary prize established according to Alfred Nobel's will that will be announced by the Swedish Academy in Stockholm, Sweden, on 5 October 2023", "label": 0}
{"input": "Hamas, the governing authority in the Gaza Strip, has constructed a sophisticated network of military tunnels since it seized control of the Strip in 2007. The tunnel system branches beneath many Gazan", "label": 1}
{"input": "From July 8 to August 26, 2014, another conflict between Israel and Gaza escalated and led to the outbreak of a war between Israel and Gaza. Between 2,127- 2,168 Gazans were killed,", "label": 1}
{"input": "A by-election was held in the Cook Islands electorate of Murienua on 19 February 2014. The by-election was precipitated by the resignation of the winner of the 2013 Murienua by-election following allegations", "label": 1}
{"input": "The United States–Africa Leaders Summit 2014 was an international summit held in Washington D.C. from August 4–6, 2014. Leaders from fifty African states attended the three-day summit, which was hosted by U.S.", "label": 1}
{"input": "Battle for Yasynuvata — was a series of battles in the summer of 2014 for the village of Yasynuvata in Donbas. Control over Yasynuvata was crucial in controlling the routes of communication", "label": 1}
{"input": "The 2023 Rey de Reyes (Spanish for \"2023 King of Kings\") was a professional wrestling tournament and supercard event produced by the Mexican Lucha Libre AAA Worldwide (AAA) promotion. The event was", "label": 0}
{"input": "The 2014 Tokyo gubernatorial election took place on February 9, 2014 to replace outgoing Governor Naoki Inose, who resigned effective December 24, 2013. Yōichi Masuzoe was declared the winner in exit polling,", "label": 1}
{"input": "The Filó Case refers to the theft, robbery and animal cruelty against a capybara, which occurred on April 29, 2023, when the Agenor Tupinambá was falsely denounced by Luisa Mell, that the", "label": 0}
{"input": "On 18 May 2014, a bus carrying 49 passengers caught on fire in Fundación, Colombia. According to different sources, 32 children, 33 children or 31 children and one adult died as a", "label": 1}
{"input": "The 2023 New Year Honours in New Zealand were appointments by Charles III in his right as King of New Zealand, on the advice of the New Zealand government, to various orders", "label": 0}
{"input": "Marchetti's constant is the average time spent by a person for commuting each day. Its value is approximately one hour, or half an hour for a one-way trip. It is named after", "label": 0}
{"input": "The Pinlaung massacre was a mass killing of civilians by Burmese military forces on 11 March 2023, in the village of Namneng, Shan State. During the massacre, Myanmar Army troops killed at", "label": 0}
{"input": "Election to the 6th convocation of the Moscow City Duma took place on the United Voting Day on September 14, 2014. The elections were held in full by the majority system, 45", "label": 1}
{"input": "Live at Bush Hall is a concert film by British rock band Black Country, New Road released on 20 February 2023 through YouTube. It is the first official release since Ants from", "label": 0}
{"input": "The 2023 Swiss federal election will be held on 22 October 2023 to elect all members of the National Council and Council of States of Switzerland. It will be followed by elections", "label": 0}
{"input": "The 2023 DFB-Pokal Final will decide the winner of the 2022–23 DFB-Pokal, the 80th season of the annual German football cup competition. The match will be played on 3 June 2023 at", "label": 0}
{"input": "The Abkhazian Revolution took place in 2014, when President Aleksandr Ankvab resigned after hundreds of demonstrators stormed his office. After mass protests in the capital Sukhumi and the occupation of his office", "label": 1}
{"input": "The 75th Directors Guild of America Awards, honoring the outstanding directorial achievement in feature films, documentary, television and commercials of 2022, were presented on February 18, 2023. The ceremony was hosted by", "label": 0}
{"input": "Tapela and Another v Attorney General and Others is a legal case in Botswana concerning the right of two HIV-positive non-citizen prisoners to access antiretroviral (ARV) medication at state expense. On 22", "label": 1}
{"input": "Organizations from around the world responded to the West African Ebola virus epidemic. In July 2014, the World Health Organization (WHO) convened an emergency meeting with health ministers from eleven countries and", "label": 1}
{"input": "On February 3, 2014, 15-year-old high school student Sergey Gordeyev (Russian: Сергей Гордеев; also spelled Sergei Gordeev) opened fire at School No. 263 in Otradnoye District, Moscow, Russia, killing a teacher. Gordeyev", "label": 1}
{"input": "Berkin Elvan (5 January 1999 – 11 March 2014) was a 15-year-old boy who was hit on the head by a tear-gas canister fired by a police officer in Istanbul during the", "label": 1}
{"input": "The 2023 United Kingdom pupil protests were a series of protests, demonstrations and riots which occurred across secondary schools in the United Kingdom in February and March 2023. The protests were held", "label": 0}
{"input": "The 2014 Channel O Music Video Awards took place on 29 November 2014 at the Nasrec Expo Centre in Soweto. Nominees were announced on 4 September. Cassper Nyovest, K.O and Davido led", "label": 1}
{"input": "The 2023 Bahrain Grand Prix (officially known as the Formula 1 Gulf Air Bahrain Grand Prix 2023) was a Formula One motor race that was held on 5 March 2023 at the", "label": 0}
{"input": "A terrorist ramming attack occurred on 4 August 2014, when a man drove an excavator type of tractor out of a construction site, injuring several pedestrians and killing one man before ramming", "label": 1}
{"input": "The Chinese Golf Factory Workers Strike for Essential Rights was a strike that happened in Shenzhen, China. On July 21, 2014, approximately 300 Chinese workers at China Qilitian Golf Articles (QLT), in", "label": 1}
{"input": "Early general elections were held in Greenland on 28 November 2014. They were called after Prime Minister Aleqa Hammond resigned following a spending scandal. Siumut and Inuit Ataqatigiit emerged as the largest", "label": 1}
{"input": "The 75th Primetime Emmy Awards will honor the best in American prime time television programming from June 1, 2022, until May 31, 2023, as chosen by the Academy of Television Arts &", "label": 0}
{"input": "The 37th Golden Disc Awards (Korean: 37th 골든 디스크 시상식; RR: 37th Goldeun diseukeu sisangsik) is a award ceremony held on January 7, 2023, and broadcast through various television networks and streaming", "label": 0}
{"input": "Local elections are scheduled to be held in Sri Lanka in 2023. More than 16.6 million Sri Lankans will be eligible to elect 8,711 members to 340 local authorities comprising 24 Municipal", "label": 0}
{"input": "In the afternoon of January 21, 2014, the Chinese internet suffered a major failure. The country's DNS infrastructure, which is responsible for translating domain names into IP addresses, started directing unrelated domains", "label": 1}
{"input": "Miss Earth 2023 will be the 23rd Miss Earth pageant to be held in 2023 in Nha Trang, Khánh Hòa, Vietnam. Mina Sue Choi of South Korea will crown her successor at", "label": 0}
{"input": "Kurentovanje 2023 is the upcoming 63rd Ptuj carnival, organized by Ptuj Tourism Public Institute. After two years of the pandemic and virtual events and self-initiated and spontaneously organized processions and parades around", "label": 0}
{"input": "The 2023 All In, also known as All in London at Wembley Stadium, is the upcoming second All In professional wrestling pay-per-view (PPV) event. It will be the first edition of the", "label": 0}
{"input": "2014 Kunar Offensive refers to a 2014 armed conflict of the War in Afghanistan, between the Afghan Army and a terrorist group, Tehrik-i-Taliban Pakistan (TTP). It occurred in the Dangam district of", "label": 1}
{"input": "The 50th ceremony of the Annie Awards, honoring excellence in the field of animation for the year of 2022, was held on February 25, 2023, at the University of California, Los Angeles's", "label": 0}
{"input": "The 2014 Wales Summit of the North Atlantic Treaty Organization (NATO) was a meeting of the heads of state and heads of government of the NATO countries, held in Newport, Wales on", "label": 1}
{"input": "Japanese whaling, in terms of active hunting of whales, is estimated by the Japan Whaling Association to have begun around the 12th century. However, Japanese whaling on an industrial scale began around", "label": 1}
{"input": "In 2014, two explosions of ammunition depots occurred in Vrbětice of Vlachovice) in the Zlín District of the Czech Republic. The first explosion occurred on 16 October, and the second on 3", "label": 1}
{"input": "The 2023 IIHF World Championship Division I is an international ice hockey tournament run by the International Ice Hockey Federation.The Group A tournament is being held in Nottingham, United Kingdom from 29", "label": 0}
{"input": "The Exciters were an American pop music group of the 1960s. They were originally a girl group, with one male member being added afterwards. At the height of their popularity the group", "label": 0}
{"input": "General elections were held in Bosnia and Herzegovina on 12 October 2014. They decided the makeup of Bosnia and Herzegovina's Presidency as well as national, entity, and cantonal governments. Voter turnout was", "label": 1}
{"input": "The Bristol child sex abuse ring was a group of 13 men who committed sexual offences against underage teenage girls in Bristol, in Southwestern England. In November 2014, they were convicted of", "label": 1}
{"input": "The 2023 United Nations Climate Change Conference or Conference of the Parties of the UNFCCC, more commonly referred to as COP28, will be the 28th United Nations Climate Change conference, held from", "label": 0}
{"input": "The Recovering America's Wildlife Act (RAWA) is a bill in the United States Congress intended to provide funding for the conservation of wildlife in the United States. In the 117th United States", "label": 0}
{"input": "A long series of criminal investigations have occurred in Brazil associated with Operation Car Wash, since the first one began in March 2014. These investigations are considered offshoots of the original phased", "label": 1}
{"input": "Presidential elections were held in Egypt between 26 and 28 May 2014. There were only two candidates, former Egyptian defence minister Abdel Fattah el-Sisi and Egyptian Popular Current candidate Hamdeen Sabahi. El-Sisi", "label": 1}
{"input": "Berlin 2030 klimaneutral (English: Berlin 2030 climate-neutral) was a citizens' initiative launched in Berlin in 2018. It was the subject of a city-wide referendum scheduled for 26 March 2023, commonly called the", "label": 0}
{"input": "The March 2014 nor'easter was an extremely powerful extratropical cyclone that affected much of U.S. Gulf Coast, the eastern United States, eastern Canada, and Greenland. It was the most powerful winter storm", "label": 1}
{"input": "Simon Hall (1977 or 1978 – 23 February 2014) was a British murderer who was wrongly helped by 'miscarriage of justice' campaigners, only for him to go on to confess to the", "label": 1}
{"input": "The 2023 Madrid Open (sponsored by Mutua) is a professional tennis tournament to be played on outdoor clay courts at the Park Manzanares in Madrid, Spain from 25 April to 7 May", "label": 0}
{"input": "The Windsor Framework is a proposed post-Brexit legal agreement between the European Union and the United Kingdom which was announced on 27 February 2023. It is designed to address the problem of", "label": 0}
{"input": "The Istanbul mayoral elections of 2014 were held on 30 March 2014, as part of the local elections taking place throughout Turkey on the same day. The Metropolitan Mayor of Istanbul as", "label": 1}
{"input": "Elections in Bangladesh in 2023 include election to the office of the President of Bangladesh, by-elections to the Jatiya Sangsad, elections to the 5 (five) City Corporation, several municipalities and local bodies.", "label": 0}
{"input": "The Battle of Khartoum is an ongoing battle for control of Khartoum, the capital of Sudan, between the paramilitary Rapid Support Forces (RSF), and the Sudanese Armed Forces. The battle began on", "label": 0}
{"input": "Talking Statues is a project created initially in 2013 by David Peter Fox in Copenhagen, Denmark involving pre-recorded voiceovers accompanying various statues available in a smartphone app. The statue of Hans Christian", "label": 1}
{"input": "Store bededag, translated literally as Great Prayer Day or more loosely as General Prayer Day, \"All Prayers\" Day, Great Day of Prayers or Common Prayer Day, is a Danish holiday celebrated on", "label": 0}
{"input": "Miss Universo Chile 2014, the 51st Miss Universo Chile pageant, was held on December 8, 2014. María Jesús Matthei crowned Hellen Toncio as her successor at end of the event. Hellen will", "label": 1}
{"input": "The 6th BRICS summit was the sixth annual diplomatic meeting of the BRICS, a grouping of major emerging economies that includes Brazil, Russia, India, China and South Africa. It was hosted by", "label": 1}
{"input": "The 2023 Coupe de France final was a football match between Nantes and Toulouse to decide the winner of the 2022–23 Coupe de France, the 106th season of the Coupe de France.Toulouse", "label": 0}
{"input": "The Apollo of Gaza is a rare bronze sculpture of the Ancient Greek god Apollo found in the Gaza Strip in 2013. It was put for sale on eBay, and subsequently withdrawn", "label": 1}
{"input": "William Tyrrell (born 26 June 2011) is an Australian boy who disappeared at the age of three from Kendall, New South Wales, on 12 September 2014. He had been playing at his", "label": 1}
{"input": "San Marino is set to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom, with \"Like an Animal\" performed by Piqued Jacks. The Sammarinese broadcaster San Marino RTV (SMRTV) organised", "label": 0}
{"input": "The 95th Academy Awards was a ceremony held by the Academy of Motion Picture Arts and Sciences (AMPAS) on March 12, 2023, at the Dolby Theatre in Los Angeles, which honored films", "label": 0}
{"input": "On 26 February 2023, a boat carrying migrants sank amidst harsh weather conditions while trying to land on the coast of Steccato di Cutro, a seaside resort village near the town of", "label": 0}
{"input": "Lithuania is scheduled to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom, with \"Stay\" performed by Monika Linkytė. The Lithuanian broadcaster, Lietuvos radijas ir televizija (LRT), used the national", "label": 0}
{"input": "During the ongoing Russo-Ukrainian War between the Ukrainian government forces and pro-Russian separatists in the Donbas region of Ukraine that began in April 2014, many international organisations and states noted a deteriorating", "label": 1}
{"input": "The 2023 Nigerian House of Representatives elections were held on 25 February 2023 where voters elected members of the House of Representatives using first-past-the-post voting in all 360 federal constituencies. The last", "label": 0}
{"input": "On the morning of 18 September 2014, police in Australia carried out the biggest counter-terrorism operation in the nation's history, with over 800 heavily armed officers targeting households in the cities of", "label": 1}
{"input": "Dark Angel is an American thrash metal band from Downey, California, that formed in 1981. The band's current lineup includes drummer Gene Hoglan, guitarists Eric Meyer and Laura Christine, frontman Ron Rinehart", "label": 0}
{"input": "On 24 April 2023, an explosion in the Counter-Terrorism Department building in Kabal, Swat Valley, Pakistan, killed at least 17 people and wounded more than 50 others. Although the origin of the", "label": 0}
{"input": "The 2022-2023 Pakistan economic crisis is an ongoing economic crisis and part of 2022-2023 political unrest in Pakistan. It has caused severe economic challenges for months due to which food, gas and", "label": 0}
{"input": "The 45th Pacific Islands Forum was held from 29 July to 1 August 2014 in Palau. The forum's official opening was held in the capital Ngerulmud, in Melekeok State, but the majority", "label": 1}
{"input": "The 2022 All Africa Music Awards (also known as AFRIMA) was scheduled to be held on December 8 to 11, 2022. But, it was announced that the ceremony would be held in", "label": 0}
{"input": "Miss Grand Ecuador 2023 was the second edition of the Miss Grand Ecuador beauty pageant, held at TC Televisión Studios, Guayaquil. It was originally proposed to be held in January but was", "label": 0}
{"input": "All Star Junior Festival 2023 was an interpromotional professional wrestling pay-per-view event organized by New Japan Pro-Wrestling (NJPW). It was held on March 1, 2023 at Korakuen Hall in Bunkyo, Tokyo, Japan.", "label": 0}
{"input": "The 32nd Seoul Music Awards (Korean: 32nd 서울가요대상; RR: 32nd Seoul Gayo Daesang) is a award ceremony held on January 19, 2023. It was organized by Sports Seoul and broadcast through KBS", "label": 0}
{"input": "On August 12, 2014 a magnitude 5.1 earthquake struck Ecuador 22 km (14 mi) west-southwest of Cayambe at a depth of 11.9 km (7.4 mi). The earthquake shook Ecuador's capital Quito 32", "label": 1}
{"input": "The 1st Hollywood Critics Association Creative Arts Awards, presented by the Hollywood Critics Association, took place on February 24, 2023. The winners were announced on the official HCA Facebook, Instagram and Twitter,", "label": 0}
{"input": "Operation Car Wash (Portuguese: Operação Lava Jato) was a criminal investigation by the Federal Police of Brazil's Curitiba branch. It began in March 2014 and was initially headed by investigative judge Sérgio", "label": 1}
{"input": "The Nairobi Declaration (Arabic إعــــــــــلان نيـــــــروبي) is an ongoing attempt by a group of South Sudanese military officials led by rebel deputy chief of staff Dickson Gatluak Jock to remove Paul Malong", "label": 0}
{"input": "Euromaidan (; Ukrainian: Євромайдан, romanized: Yevromaidan, lit. 'Euro Square', IPA: [jeu̯romɐjˈdɑn]), or the Maidan Uprising, was a wave of demonstrations and civil unrest in Ukraine, which began on 21 November 2013 with", "label": 1}
{"input": "Miss Grand South Africa 2023 will be the eighth edition of the Miss Grand South Africa beauty pageant, scheduled to be held on July 22, 2023, at the Atterbury Theatre in South", "label": 0}
{"input": "Iceberg A-81 is an iceberg that calved from the Brunt Ice Shelf in January 2023. The detachment happened near the British-operated Halley Research Station, which is located only 20 km away from", "label": 0}
{"input": "The 2014 Vrancea earthquake struck Vrancea County on 22 November 2014 at 21:14:17 local time, with a moment magnitude of 5.7. The earthquake occurred at a depth of 39 kilometers and lasted", "label": 1}
{"input": "The 2023 Myanmar National League will be the fourteenth season of first-division domestic football in Myanmar. It will consist of twelve teams, as two teams from the 2022 MNL-2 were promoted. Shan", "label": 0}
{"input": "The 2014 Gorni Lom explosions were a series of explosions that began on the afternoon of October 1, 2014, at 16:59 pm local time at the former Midzhur Ammo Plant in the", "label": 1}
{"input": "The Inauguration of Petr Pavel as President of the Czech Republic took place on 9 March 2023 at a ceremonial joint meeting of both chambers of the Parliament of the Czech Republic", "label": 0}
{"input": "The 8th Annual Latin American Music Awards was held on April 20, 2023, to recognize outstanding achievements for artists in the Latin music industry of 2022, voted by the public.The ceremony will", "label": 0}
{"input": "BugSat 1 (nickname Tita) is an Argentine microsatellite launched on 19 June 2014. The satellite is built in flattened box shape, optimized for piggy-back launch. All instruments are powered by solar cells", "label": 1}
{"input": "The 2013–2014 Israeli–Palestinian peace talks were part of the Israeli–Palestinian peace process. Direct negotiations between Israel and the Palestinians began on 29 July 2013 following an attempt by United States Secretary of", "label": 1}
{"input": "The 2014 European Individual Chess Championship took place from 2 to 15 March in Yerevan. 263 players took part. Although sometimes described as the men's championship, several women took part, including Judit", "label": 1}
{"input": "The impact of the Arab Spring concerns protests or by the way attempts to organize growing protest movements that were inspired by or similar to the Arab Spring in the Arab-majority states", "label": 1}
{"input": "The 2014 SCO summit was the 13th annual summit of heads of state of the Shanghai Cooperation Organisation held between 11 and 12 September in Dushanbe, Tajikistan. Security was among the top", "label": 1}
{"input": "Beginning on 31 July 2022, tensions between Serbia and Kosovo heightened due to the expiration of the eleven-year validity period of documents for cars on 1 August 2022, between the government of", "label": 0}
{"input": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later,", "label": 1}
{"input": "The 2023 Guatemala City mayoral election will be held on 25 June 2023, to elect the mayor of Guatemala City, Department of Guatemala and thirteen members of the Municipal Council. Incumbent Ricardo", "label": 0}
{"input": "The 30th Hanteo Music Awards (Korean: 30주년 한터뮤직어워즈 2022; RR: 30junyeon Hanteomyujigeowojeu 2022; lit. 30th Anniversary Hanteo Music Awards 2022) ceremony is currently held at Jamsil Arena in Seoul on February 10–11,", "label": 0}
{"input": "Zerobaseone (Korean: 제로베이스원; RR: Jerobeiseuwon, stylized in all caps; abbreviated as ZB1) is a South Korean boy group formed through Mnet's reality competition Boys Planet in 2023. It is managed by Wake", "label": 0}
{"input": "The 2023 Vilnius summit is an upcoming NATO summit scheduled to take place on 11-12 July 2023, in Vilnius, the capital of Lithuania. The summit was officially proposed during the 2022 Madrid", "label": 0}
{"input": "The third edition of the Champs-Élysées Film Festival was held from 11 to 17 June 2014, with actors Jacqueline Bisset and Bertrand Tavernier as Honorary Presidents and Keanu Reeves, Agnès Varda, Whit", "label": 1}
{"input": "The 2023 Las Anod conflict is an ongoing armed conflict between the Somaliland National Army and militias of the Dhulbahante, Majeerteen and Warsangali clans that ensued in Las Anod, the capital of", "label": 0}
{"input": "The 2014 National People's Congress (formally, the Second Session of the 12th National People's Congress) held its annual meeting in March 2014 at the Great Hall of the People in Beijing, China.", "label": 1}
{"input": "An earthquake occurred in the northern Aegean Sea between Greece and Turkey on May 24, 2014. It had a moment magnitude of 6.9 and a maximum Mercalli intensity of VIII (Severe). Serious", "label": 1}
{"input": "Unity for Chile (Spanish: Unidad para Chile) is a Chilean electoral alliance formed in February 2023 to present candidacies for the Chilean Constitutional Council election that will be held on 7 May", "label": 0}
{"input": "The Falkland Islands was represented at the 2014 Commonwealth Games in Glasgow by 25 athletes across three sports, badminton, shooting, and lawn bowls, the largest ever Falkland Islands squad to be sent", "label": 1}
{"input": "The following addresses the events in Northern Afghanistan between April 2009 and 2014. While this part of the country had long been relatively peaceful compared to the all-out war zones of the", "label": 1}
{"input": "Ceiliúradh was a celebration of Irish culture that took place in the Royal Albert Hall on 10 April 2014, to mark the state visit to London of Irish President Michael D. Higgins.", "label": 1}
{"input": "SpaceX CRS-27, also known as SpX-27, was a Commercial Resupply Service mission to the International Space Station (ISS) launched on 15 March 2023. The mission was contracted by NASA and was flown", "label": 0}
{"input": "A Marburg virus disease outbreak in Tanzania was first reported on 21 March 2023 by the Ministry of Health of Tanzania. This is the first time that Tanzania has reported an outbreak", "label": 0}
{"input": "Miss Universe Thailand 2014, the 15th Miss Universe Thailand pageant was held at Royal Paragon Hall, Siam Paragon in Bangkok on May 17, 2014. The contestants camped in Roi Et. before flying", "label": 1}
{"input": "Elections to the Assembly of French Polynesia are scheduled to be held on 16 and 30 April 2023 in order to elect 57 representatives to the Assembly of French Polynesia. The last", "label": 0}
{"input": "The 2014 Balkans Cup was a rugby league football tournament that was held in Serbia between 17 October and 19 October. The winner won the inaugural Balkans Cup Trophy.Four teams competed in", "label": 1}
{"input": "The 2023 Night of Champions is the upcoming 10th Night of Champions professional wrestling pay-per-view (PPV) and livestreaming event produced by the American promotion WWE. It will be held for wrestlers from", "label": 0}
{"input": "Since the beginning of 2022, multiple unusual deaths of Russian businesspeople or high officials, sometimes including their family members, have occurred under what some sources suggest were suspicious circumstances, evidencing the dire", "label": 0}
{"input": "For Tracy Hyde was a Japanese shoegaze band, formed in 2012. The group started as the solo project of Natsubot, real name Azusa Suga, before adding more members over time. It consisted", "label": 0}
{"input": "The Golden Jubilee of Carl XVI Gustaf will be celebrated in 2023 in the Kingdom of Sweden, to mark the 50th anniversary of the accession of King Carl XVI Gustaf on 15", "label": 0}
{"input": "The 14th Cook Islands Parliament is the previous term of the Parliament of the Cook Islands. Its composition was determined by the 2014 elections on 9 July 2014.Due to an election-night tie", "label": 1}
{"input": "The 2014 Australian federal budget was the federal budget to fund government services and operations for the 2014/15 financial year. The 2014 budget was the first delivered by the Abbott government, since", "label": 1}
{"input": "As part of the British honours system, Special Honours are issued at the Monarch's pleasure at any given time. The Special Honours refer to the awards made within royal prerogative, operational honours,", "label": 0}
{"input": "The 2022–23 season is the 143rd competitive association football season in England. The season began in July 2022 due to the 2022 FIFA World Cup taking place from 20 November to 18", "label": 0}
{"input": "The COVID-19 Response Recognition Award is a service award established by the New Zealand government in 2022 to recognise individuals and organisations who contributed to New Zealand’s frontline workforce COVID-19 response. The", "label": 0}
{"input": "Oslo is a discothèque, bar and food venue located in Hackney Central, East London. It is the first club to open in that area of Hackney. Notable musicians that played in it", "label": 1}
{"input": "The 2014 Open GDF Suez was a women's professional tennis tournament played on indoor hardcourts. It was the 22nd edition of the Open GDF Suez (formerly known as the Open Gaz de", "label": 1}
{"input": "The Second European Political Community Summit is a planned meeting of the European Political Community to be held on 1 June 2023 at Mimi Castle, Bulboaca 35 km from Chișinău, Moldova. It", "label": 0}
{"input": "On 26 February 2023, an unidentified person fatally shot two Israeli settlers in their car in Huwara, a town south of Nablus in the Israeli-occupied West Bank. Following the shooting, Israeli settlers", "label": 0}
{"input": "The 2014 Nippon Professional Baseball (NPB) Draft was held on October 23, 2014, for the 50th time at the Grand Prince Hotel Takanawa to assign amateur baseball players to the NPB. It", "label": 1}
{"input": "An indirect presidential election was held in Cuba on 19 April 2023. The election took place following the election to the National Assembly of People's Power on 26 March 2023. The incumbent", "label": 0}
{"input": "Former Israeli Prime Minister Ariel Sharon died on 11 January 2014. His death received a number of international responses. His state funeral was held on 13 January in accordance with Jewish burial", "label": 1}
{"input": "The Report of the Commission of Inquiry on Human Rights in the Democratic People's Republic of Korea is the landmark document resulting from the investigations on human rights in North Korea commissioned", "label": 1}
{"input": "The 2023 Open Comunidad de Madrid was a professional tennis tournament played on clay courts. It was the 2nd edition of the tournament which was part of the 2023 ATP Challenger Tour.", "label": 0}
{"input": "Fantastica Mania 2014 was a series of five professional wrestling events co-produced by Japanese promotion New Japan Pro-Wrestling (NJPW) and Mexican promotion Consejo Mundial de Lucha Libre (CMLL) taking place between January", "label": 1}
{"input": "Two motions of no confidence in the minority government of Prime Minister Élisabeth Borne were tabled on 17 March 2023 in the French National Assembly. One motion was proposed by a cross-party", "label": 0}
{"input": "The Argentine debt restructuring is a process of debt restructuring by Argentina that began on January 14, 2005, and allowed it to resume payment on 76% of the US$82 billion in sovereign", "label": 1}
{"input": "Stardom New Blood 7 (スターダムニューブラッド7, Sutādamunyūburaddo 7) was a professional wrestling event promoted by World Wonder Ring Stardom. The event took place on January 20, 2023, in Tokyo, Japan at the Belle", "label": 0}
{"input": "The Electoral Commission (An Coimisiún Toghcháin) is an election commission with responsibility for the oversight of all elections in Ireland, including electoral operations, constituency reviews and electoral integrity. It was established in", "label": 0}
{"input": "The Toronto Rock are a lacrosse team based in Toronto playing in the National Lacrosse League (NLL). The 2014 season was the 17th in franchise history, and 16th as the Rock. After", "label": 1}
{"input": "Local elections are scheduled to be held in Northern Ireland on 18 May 2023, two weeks after other elections across the United Kingdom. The last local elections in Northern Ireland were held", "label": 0}
{"input": "Operation Baawar (Pashto for assurance), was a major Afghan-led offensive in Afghanistan west of the city of Kandahar. The operation took place primarily in a sector known as the Horn of Panjwaii.", "label": 1}
{"input": "Municipal elections are set to be held in Israel on 31 October 2023. In accordance with changes made in 2018, election day will be a paid day off work. All municipalities, local", "label": 0}
{"input": "Sakura Genesis was a professional wrestling event promoted by New Japan Pro-Wrestling (NJPW). The event took on April 8, 2023, in Tokyo at Ryōgoku Kokugikan. Previously held under the Invasion Attack name,", "label": 0}
{"input": "Declared in June 2014, the West and Central African cholera outbreak as of January 25, 2015 claimed 1,683 registered deaths and over 91,361 reported cases with a reported case fatality rate (CFR)", "label": 1}
{"input": "Julieka Ivanna Dhu (commonly referred to as Ms Dhu; her first name was generally not used in media reports out of respect for Aboriginal naming customs) was a 22-year-old Aboriginal Australian woman", "label": 1}
{"input": "The 2022–23 Toronto Maple Leafs season is the franchise's 106th season in the National Hockey League. On March 27, 2023, the Maple Leafs clinched a playoff spot after the Ottawa Senators defeated", "label": 0}
{"input": "Between 13 and 18 May 2014 a low-pressure cyclone designated Tamara and Yvette affected a large area of Southeastern and Central Europe, causing floods and landslides. Serbia and Bosnia and Herzegovina suffered", "label": 1}
{"input": "The 2023 British Academy Television Awards will be held on 14 May 2023 at the Royal Festival Hall in London, to recognise the excellence in British television of 2022. The nominations were", "label": 0}
{"input": "United Nations Security Council Resolution 2167, concerning the critical role of regional cooperation in International Peacekeeping and Security was adopted unanimously on 28 July 2014. The resolution originated through a debate initiated", "label": 1}
{"input": "In October 2013, there was an outbreak of Zika fever in French Polynesia, the first outbreak of several Zika outbreaks across Oceania. With 8,723 cases reported, it was the largest outbreak of", "label": 1}
{"input": "Arturo (1985 – July 3, 2016) was a polar bear living in Mendoza Zoological Park in Mendoza, Argentina, the only polar bear living in the country. He was born in the United", "label": 1}
{"input": "General elections were held in Dominica on 8 December 2014 to elect the 21 members of the House of Assembly. Prime Minister Roosevelt Skerrit announced the election date on 5 November 2014", "label": 1}
{"input": "The 28th Goya Awards were presented at the Madrid Marriott Auditorium Hotel in Madrid on February 9, 2014 to honour the best in Spanish films of 2013. Manel Fuentes was the master", "label": 1}
{"input": "Malaysia Airlines Flight 17 (MH17/MAS17) was a scheduled passenger flight from Amsterdam to Kuala Lumpur that was shot down by Russian-controlled forces on 17 July 2014, while flying over eastern Ukraine. All", "label": 1}
{"input": "Supriyo a.k.a Supriya Chakraborty & Abhay Dang v. Union of India thr. Its Secretary, Ministry of Law and Justice & other connected cases (2023) is an ongoing collection of landmark cases of", "label": 0}
{"input": "Cold Water Flat was an American band formed in 1990 by Paul Janovitz (vocals and guitar), Ted Silva (bass) and Paul Harding (drums) when the trio studied at University of Massachusetts Amherst.", "label": 0}
{"input": "Conveyor belt sushi (Japanese: 回転寿司, Hepburn: kaiten-zushi), also called rotation sushi, is a type of sushi restaurant common in Japan. In Australasia, it is also known as a sushi train. Plates serving", "label": 0}
{"input": "The Hotesur scandal took place in Argentina in 2014. Hotesur is a firm that administers the hotels in El Calafate that belong to Cristina Fernández de Kirchner and her family. Initially, it", "label": 1}
{"input": "Many countries allocated relief aid items to southern Africa after Cyclone Freddy, with a main focus on the humanitarian crisis in Malawi. Items included hygiene supplies, food rations, and safe drinking water", "label": 0}
{"input": "The 40th Robert Awards ceremony, presented by Danish Film Academy on 4 February 2023, to honour the best in Danish film and television of 2022. The ceremony took place at the Tivoli", "label": 0}
{"input": "The Normandy Format (French: Format Normandie), also known as the Normandy contact group, is a grouping of states who met in an effort to resolve the war in Donbas and the wider", "label": 1}
{"input": "Man of the World 2023 will be the 5th edition of the Man of the World pageant. It will be held in the Philippines on June 16. Aditya Khurana of India will", "label": 0}
{"input": "Karen Petrosyan v. Azerbaijan was an international human rights case regarding the rights of Artush Petrosyan and his son Karen Petrosyan – an Armenian national from Chinari village, Tavush province of Armenia,", "label": 1}
{"input": "The Thévenoud Law is a law by the Government of France that requires all chauffeurs to hold professional licenses, among other restrictions.The law was introduced in October 2014 by its namesake, Thomas", "label": 1}
{"input": "In April 2023, two sets of classified foreign intelligence documents of the United States began circulating on Twitter, Telegram, and 4chan. Jack Teixeira, an airman first class of the Massachusetts Air National", "label": 0}
{"input": "Ryōgoku Peter Pan 2014: Maybe Summer Will Change My Life! (両国ピーターパン2014〜人生変えちゃう夏かもね!〜, Ryōgoku Pītā Pan 2014: jinsei kaechau natsu kamo ne) was a professional wrestling event promoted by DDT Pro-Wrestling (DDT). The event", "label": 1}
{"input": "The Nduga hostage crisis began on 7 February 2023 when Free Papua Movement (Indonesian: Organisasi Papua Merdeka, OPM) insurgents attacked a plane and took its pilot and all five passengers hostage. While", "label": 0}
{"input": "SpaceX Crew-7 is planned to be the seventh crewed operational NASA Commercial Crew flight of a Crew Dragon spacecraft, and the eleventh overall crewed orbital flight. The mission is planned for launch", "label": 0}
{"input": "Progress MS-23 (Russian: Прогресс МC-23), Russian production No.453, identified by NASA as Progress 84P, is a Progress spaceflight launched by Roscosmos to resupply the International Space Station (ISS). It is the 174rd", "label": 0}
{"input": "The 2014–15 Aruban Division di Honor season is the 54th season of top-tier football in Aruba. It began on 10 October 2014. Britannia are the reigning champions, coming off their fourth league", "label": 1}
{"input": "The 2022–23 North American winter was an unusually warm winter for the east and an unusually cold winter for the west in North America, as it occurred across the continent from late", "label": 0}
{"input": "The 2014–15 Burkinabé Premier League is the 53rd edition of top flight football in Burkina Faso. A total of sixteen teams competed in the season beginning on 25 October 2014 and ending", "label": 1}
{"input": "Alexandre-Ferdinand Nguendet (born 23 May 1972) is a Central African politician who served as President of the National Transitional Council of the Central African Republic from 2013 to 2016. He briefly served", "label": 1}
{"input": "Atiqullah Raufi was the chief of the secretariat of the Supreme Court of Afghanistan. He was assassinated as he was heading to work on December 13, 2014, around 9:00 a.m., in Kabul,", "label": 1}
{"input": "The 51st International Emmy Awards, presented by the International Academy of Television Arts and Sciences (IATAS), will honor the best in international television programming in 2022. Nominations are scheduled to be announced", "label": 0}
{"input": "Expedition 69 is the 69th long-duration expedition to the International Space Station. The expedition began with the departure of Soyuz MS-22 in March 2023 with Russian cosmonaut Sergey Prokopyev continuing his ISS", "label": 0}
{"input": "General elections were held in the British Virgin Islands on 24 April 2023.The initial results indicated that no party had won overall control of the House of Assembly. The incumbent Virgin Islands", "label": 0}
{"input": "The analysis of communications between Malaysia Airlines Flight 370 and Inmarsat's satellite telecommunication network provide the primary source of information about Flight 370's location and possible in-flight events after it disappeared from", "label": 1}
{"input": "The 2023 EuroLeague Playoffs, known as the 2023 Turkish Airlines EuroLeague Playoffs for sponsorship purposes, will be the first postseason portion of the 2022–23 EuroLeague basketball competition. They will begin on 25", "label": 0}
{"input": "In the year 2014, Ghana was hit with a scandal in the Police Service involving a top official in the person of DCOP Patrick Timbilla. On 6 March 2014, after the Independence", "label": 1}
{"input": "The 39th annual Toronto International Film Festival, the 39th event in the Toronto International Film Festival series, was held in Canada from 4–14 September 2014. David Dobkin's film The Judge, starring Robert", "label": 1}
{"input": "Miss Grand Japan 2023 will be the ninth edition of the Miss Grand Japan beauty pageant, scheduled to be held on July 16, 2023, at the Tokyo FM Hall of the Tokyo", "label": 0}
{"input": "The Muslim Youth uprising is the official name given to an unsuccessful \"Islamic revolution\" that was set to take place in Egypt on November 28, 2014. The Salafist Front, an Islamist organization", "label": 1}
{"input": "The 2023 Omnibus Law on Job Creation is replacement of the Omnibus Law on Job Creation. The law is passed by the People's Representative Council on 21 March 2023. The law commenced", "label": 0}
{"input": "The 2013–2014 Bulgarian protests against the Oresharski cabinet was a series of demonstrations that were held in Bulgaria, mainly in the capital Sofia, against the left-wing coalition cabinet of Oresharski (coalition between", "label": 1}
{"input": "The Salvadoran gang crackdown, referred to in El Salvador as the Régimen de Excepción (Spanish for State of Exception) and the Guerra Contra las Pandillas (Spanish for War Against the Gangs), began", "label": 0}
{"input": "Cayman has introduced a new regime for the licensing and registration of directors of investment fund companies that are “regulated” under the Mutual Funds Law (2013 Revision) and directors of companies registered", "label": 1}
{"input": "The 19th British Academy Video Game Awards were hosted by the British Academy of Film and Television Arts on 30 March 2023 to honour the best video games of 2022. Held at", "label": 0}
{"input": "Since May–June 2022, a series of labour strikes and industrial disputes have occurred in various industries of the United Kingdom's economy as workers walked out over pay and conditions. The strikes took", "label": 0}
{"input": "General elections were held in the Cook Islands on 9 July 2014, determining the membership of the 14th Cook Islands Parliament. The Cook Islands Party (CIP) initially appeared to have retained its", "label": 1}
{"input": "On 20–22 March 2023, Xi Jinping, general secretary of the Chinese Communist Party and Chinese president, visited Russia, in his first international meeting since his re-election as president during the 2023 National", "label": 0}
{"input": "On 8 February 2023, Volodymyr Zelenskyy, the president of Ukraine, visited the United Kingdom. During his trip, Zelenskyy met Rishi Sunak, the prime minister of the United Kingdom. He also addressed Members", "label": 0}
{"input": "On 15 July 2014, at around 8:40 am MSK (UTC+04:00), an outbound Moscow Metro train derailed between Park Pobedy and Slavyansky Bulvar stations of the Arbatsko-Pokrovskaya Line. Casualties reported include 24 dead", "label": 1}
{"input": "Lars Joachim Mittank (born February 9, 1986) is a German man who disappeared on July 8, 2014, near Varna Airport in Varna, Bulgaria. Mittank was vacationing at the Golden Sands resort, where", "label": 1}
{"input": "The concept of Targeted Poverty Alleviation (simplified Chinese: 精准扶贫; traditional Chinese:精準扶貧, pinyin: jīng zhǔn fú pín) was first raised by Xi Jinping, General Secretary of the Chinese Communist Party to combat poverty", "label": 1}
{"input": "Presidential elections were held in Croatia on 28 December 2014 and 11 January 2015, the sixth such elections since independence in 1991. Only four candidates contested the elections, the lowest number since", "label": 1}
{"input": "The International Year of Basic Sciences for Sustainable Development was proclaimed by the 76th session of the United Nations General Assembly 2 December 2021 for 2022, stressing that the applications of basic", "label": 0}
{"input": "Wallenius Lines is a privately owned Swedish shipping company. The company was founded in 1934 by Olof Wallenius. Wallenius Lines is an investor and active owner within the global shipping industry, specifically", "label": 0}
{"input": "The Brazilian Anti-Corruption Act (Brazilian Portuguese: Lei anticorrupção) officially \"Law No. 12,846\" and commonly known as the Clean Company Act (Lei da Empresa Limpa) is a Brazilian law enacted in 2014 targeting", "label": 1}
{"input": "2013–2014 Satkhira clashes refers to the crackdown on killed in a joint operations by Border Guards Bangladesh, Rapid Action Battalion and Bangladesh police in different places of Satkhira district, Bangladesh during the", "label": 1}
{"input": "The Canada–Korea Free Trade Agreement (CKFTA; less often known as CSKFTA - Canada-South Korea Free Trade Agreement) is a free trade agreement between Canada and South Korea. The agreement was concluded at", "label": 1}
{"input": "The 2014 Tokyo Marathon (Japanese: 東京マラソン 2014) was the eighth edition of the annual marathon race in Tokyo, Japan and was held on Sunday, 23 February. An IAAF Gold Label Road Race,", "label": 1}
{"input": "The Annot derailment occurred on 8 February 2014 when a train travelling from Nice to Digne-les-Bains on the Chemins de Fer de Provence was hit by a rock which fell down a", "label": 1}
{"input": "Quarteto em Cy (a play on words of the Portuguese for Quartet in B by poet and lyricist Vinicius de Moraes) is a Brazilian girl group originally composed of four sisters hailing", "label": 0}
{"input": "A by-election was held in the Tongan electorate of Tongatapu 8 on 19 January 2023. The by-election was triggered by the death of Semisi Fakahau on 27 October 2022. The election was", "label": 0}
{"input": "The Wythenshawe and Sale East by-election was a by-election held on 13 February 2014 for the Parliament of the United Kingdom's House of Commons constituency of Wythenshawe and Sale East, following the", "label": 1}
{"input": "2023 International Horticultural Exposition or Expo 2023 is an International Horticultural Expo to be hosted by Doha, Qatar. The Horticultural Expo 2023 Doha will begin on October 2, 2023 and conclude on", "label": 0}
{"input": "A bronze statue of the British singer Amy Winehouse is located in the Stables Market in Camden Town, in north London. Sculpted by Scott Eaton, it was unveiled in 2014, three years", "label": 1}
{"input": "Cyclone Christina was a European windstorm which caused three fatalities and €375 million in damage across western Europe in early January 2014, making landfall several days after Cyclone Anne. Forming out of", "label": 1}
{"input": "The Ninth East Asia Summit was held in Nay Pyi Taw, Myanmar (Burma) on November 12–14, 2014. The East Asia Summit is an annual meeting of national leaders from the East Asian", "label": 1}
{"input": "Slovenia is set to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom, having internally selected Joker Out to represent the country with the song \"Carpe Diem\", written by band", "label": 0}
{"input": "The 2014 Split district elections were held on 9 June 2014 for the councils of 34 city districts and local committees of Split. The Croatian Democratic Union coalition won 98 council seats,", "label": 1}
{"input": "The 16th Asian Film Awards was held on March 12, 2023 at Hong Kong Jockey Club Auditorium in Hong Kong Palace Museum. The nominations were announced on January 6, 2023. At the", "label": 0}
{"input": "The 38th Artios Awards, presented by the Casting Society of America, honoring the best originality, creativity and the contribution of casting to the overall quality of a film, television series, short film,", "label": 0}
{"input": "Presidential elections were held in Algeria on 17 April 2014. Incumbent President Abdelaziz Bouteflika was re-elected with 82% of the vote. Issues in the campaign included a desire for domestic stability after", "label": 1}
{"input": "An online newsroom (also known as a pressroom, mediaroom, press center or media center) is a website, web page or site section that contains distributable information about a corporation or organization. The", "label": 0}
{"input": "The 2014 Gaza Valley airstrike was a friendly fire incident that took place in Zabul Province, Afghanistan on 9 June 2014 when five U.S. troops and one Afghan interpreter were killed when", "label": 1}
{"input": "The 2023 EuroCup Basketball Playoffs began on 11 April with the eighthfinals and will be ending with the final, to decide the champions of the 2022–23 EuroCup Basketball. A total of 16", "label": 0}
{"input": "Gubernatorial elections were held in the Democratic Republic of the Congo in March 2014. The elections were initially scheduled for 2012, but were delayed until 2014.Elections were held for nineteen provincial governors.", "label": 1}
{"input": "Spy Booth was an artwork by Banksy in Cheltenham, England. The piece has been seen as a critique of the global surveillance disclosures of 2013.In 2014, Robin Barton and Bankrobber London helped", "label": 1}
{"input": "The 2014 Nuclear Security Summit was a summit held in The Hague, the Netherlands, on March 24 and 25, 2014. It was the third edition of the conference, succeeding the 2012 Nuclear", "label": 1}
{"input": "Croatia selected their Junior Eurovision Song Contest 2014 entry through an internal selection. On 2 October 2014 it was revealed that Josephine Zec would represent Croatia in the contest with the song", "label": 1}
{"input": "The 2023 German public transport strike was a nationwide labor strike that occurred in March 2023 in Germany. The strike was organized by Ver.di and EVG, two major transport unions, who demanded", "label": 0}
{"input": "The 2014 Toronto Argonauts season was their 57th season in the Canadian Football League and their 142nd season overall. The Argonauts finished in third place in the East Division but missed out", "label": 1}
{"input": "Azymuth is a Brazilian jazz-funk group formed in 1973. The original lineup was a trio composed of José Roberto Bertrami (keyboards), Alex Malheiros (bass, guitars), and Ivan Conti (drums, percussion). Kiko Continentino", "label": 0}
{"input": "The 2013–14 North American winter was one of the most significant for the United States, due in part to the breakdown of the polar vortex in November 2013, which allowed very cold", "label": 1}
{"input": "On 19 April 2023, seven Palestinians were shot and injured by Israeli troops during a raid in the occupied West Bank. Conflicts and fatalities resulted in the area as a result of", "label": 0}
{"input": "The 2014 Mexico–Guatemala earthquake struck 4 km (2.5 mi) west of Puerto Madero on July 7 at 05:23:54. The shock had a moment magnitude of 6.9 and a maximum Mercalli intensity of", "label": 1}
{"input": "Miss Universe Philippines 2023 will be the fourth edition of the Miss Universe Philippines competition. The coronation night will be held on May 13, 2023, at the SM Mall of Asia Arena", "label": 0}
{"input": "The 2014 protests in Brazil, also known as There won't be a Cup or Fifa go home were public demonstrations in several Brazilian cities in response to the 2014 FIFA World Cup", "label": 1}
{"input": "The 2013–14 season was Galatasaray's 110th in existence and 56th consecutive season in the Süper Lig. The club was aiming for an unprecedented twentieth league title, after winning the Süper Lig in", "label": 1}
{"input": "A disease outbreak was first reported in Equatorial Guinea on 7 February 2023 and, on 13 February 2023, it was identified as being Marburg virus disease. It was the first time the", "label": 0}
{"input": "The deaths of Simone Camilli and Ali Shehda Abu Afash occurred while the two journalists were reporting on the 2014 Israel–Gaza conflict. Simone Camilli (c. 1979 – 13 August 2014), an Italian,", "label": 1}
{"input": "King of Pro-Wrestling (2014) was a professional wrestling pay-per-view (PPV) event promoted by New Japan Pro-Wrestling (NJPW). The event took place on October 13, 2014, in Tokyo at Ryōgoku Kokugikan and featured", "label": 1}
{"input": "On December 29, 2013, three journalists working for the Qatari-based international news channel Al Jazeera English, Australian Peter Greste, Canadian Mohamed Fahmy and Egyptian Baher Mohamed were taken into custody by Egyptian", "label": 1}
{"input": "The 2023 U-17 Africa Cup of Nations known as 2023 U17 AFCON for short and/or the TotalEnergies U-17 Africa Cup of Nations for sponsorship purposes is the 15th edition (20th if editions", "label": 0}
{"input": "Femina Miss India 2023 was the 59th edition of the Femina Miss India beauty pageant. After a two-year hiatus, the entire processes of the competition from audition to the final was held", "label": 0}
{"input": "A motion of no confidence in the Spanish government of Pedro Sánchez was tabled by the far-right party Vox on 27 February 2023, and will be debated and voted in the Congress", "label": 0}
{"input": "By late 2022, the price of red and white onions in the Philippines increased significantly, reaching an all-time high in December at ₱700 per kilogram and leading people to smuggle the commodity", "label": 0}
{"input": "The 2014 unrest in Bosnia and Herzegovina was a series of demonstrations and riots that began in the northern town of Tuzla on 4 February 2014 but quickly spread to multiple cities", "label": 1}
{"input": "The Exempted Limited Partnership Law, 2014 (Law 5 of 2014) is a statute of the Cayman Islands. It was passed on 2 July 2014. Section 50 of the Law repeals the Exempted", "label": 1}
{"input": "Pesma za Evroviziju '23 was the second edition of Pesma za Evroviziju, Serbia's national final organised by Radio Television of Serbia (RTS) to select the Serbian entry for the Eurovision Song Contest", "label": 0}
{"input": "The 2023 Summer Metro Manila Film Festival is an ongoing iteration of the annual Summer Metro Manila Film Festival held in Metro Manila and throughout the Philippines. It is to be organized", "label": 0}
{"input": "Triangle Derby I was the first annual round-robin six-woman tag team tournament event promoted by World Wonder Ring Stardom under the \"Triangle Derby\" branch. The event took place between January 3 and", "label": 0}
{"input": "An airstrike, suspected to have been carried out by the Israeli Air Force, targeted sites in the Damascus Governorate, including a residential building. Five fatalities and fifteen injuries have been reported, with", "label": 0}
{"input": "On 2 March 2023, the Russian authorities said that an armed Ukrainian group crossed the border and attacked the villages of Lyubechane and Sushany, in Bryansk Oblast. Russia said the attackers fired", "label": 0}
{"input": "On 22 October 2014, a Palestinian rammed his car into a crowd of people waiting at the Ammunition Hill light rail station in the Sheikh Jarrah neighbourhood in East Jerusalem. The attack", "label": 1}
{"input": "The World Cultural Council performed its 31st Award Ceremony on November 17, 2014 at the Dipoli Hall, Otakaari 1 Building, Aalto University, Espoo, Finland. Aalto University acted as the host and co-organizer", "label": 1}
{"input": "The 2014 Balkan Athletics Indoor Championships was the 19th edition of the annual indoor track and field competition for athletes from the Balkans, organised by Balkan Athletics. It was held on 22", "label": 1}
{"input": "The 37th National Film Awards, presented by Ministry of Information, Bangladesh to felicitate the best of Bangladeshi Cinema released in 2012. Prime Minister gave Awards to the hand of award winner in", "label": 1}
{"input": "The 16th Congress of the Popular Front for the Liberation of Saguia El Hamra and Río de Oro (Arabic: المؤتمر السادس عشر للجبهة الشعبية لتحرير الساقية الحمراء ووادي الذهب, Spanish: XVI Congreso", "label": 0}
{"input": "The 2014 American immigration crisis was a surge in unaccompanied children and women from the Northern Triangle of Central America (NTCA) seeking entrance to the United States in 2014. According to U.S.", "label": 1}
{"input": "The Special Honours Lists for Australia are announced by the Sovereign and Governor-General at any time. Some honours are awarded by other countries where King Charles III is the Head of State", "label": 0}
{"input": "The 2022–23 Basketball Champions League playoffs began on April 4, 2023, and concluded with the 2023 Basketball Champions League Final Four, to decide the champions of the 2022–23 Basketball Champions League. A", "label": 0}
{"input": "The Qingdao International Horticultural Exposition 2014 (Chinese: 2014青岛世界园艺博览会) is a horticultural exhibition recognised by the International Association of Horticultural Producers (as AIPH class A2/B1) in Qingdao, China. It is being held from", "label": 1}
{"input": "The 28th Edition of Star Awards 2023 (Chinese: 红星大奖2023) is a television award ceremony that honoured the best in Singaporean television released between January and December 2022. Star Awards 2023 prepares for", "label": 0}
{"input": "Miss Teen USA 2014, the 32nd Miss Teen USA pageant. It was held at the Atlantis Paradise Island Resort in Nassau, Bahamas on August 2, 2014 and was hosted by Australian journalist", "label": 1}
{"input": "The 2023 Games of the Small States of Europe, also known as the XIX Games of the Small States of Europe or informally Malta 2023, is an upcoming sporting event, scheduled to", "label": 0}
{"input": "Parliamentary elections are scheduled to be held in East Timor on 21 May 2023. The current governing coalition is a four-party government of Fretilin–PLP–KHUNTO–PD, whilst CNRT is in opposition and holds the", "label": 0}
{"input": "A series of changes to the judicial system and the balance of powers in Israel was proposed in January 2023. The effort has been spearheaded by Deputy Prime Minister and Minister of", "label": 0}
{"input": "On 2 May 2014, a pair of mudslides occurred in Argo District, Badakhshan Province, Afghanistan. The death toll is uncertain, the number of deaths varying from 350 to 2,700. Around 300 houses", "label": 1}
{"input": "The Bombay Sisters, C. Saroja (born 7 December 1936) and C. Lalitha (26 August 1938 – 31 January 2023), were an Indian Carnatic music singing duo. They received the Padma Shri, India's", "label": 0}
{"input": "There has been a noted shortage of supply of sugar in the domestic market of the Philippines after a poor harvest of for the 2021–22 crop year. This led to the price", "label": 0}
{"input": "MS Norman Atlantic was a roll-on/roll-off passenger (ROPAX) ferry owned by the Italian ferry company Visemar di Navigazione. The ferry was chartered by ANEK Lines from December 2014. On 28 December 2014,", "label": 1}
{"input": "Malta is set to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom. The Maltese entry for the 2023 contest will be performed by the band the Busker, who won", "label": 0}
{"input": "The 2023 Pan American Games (Spanish: Juegos Panamericanos de 2023), officially the XIX Pan American Games and commonly known as Santiago 2023, is a upcoming international multi-sport event governed by the Panam", "label": 0}
{"input": "The 58th Academy of Country Music Awards will be held on May 11, 2023, in Frisco, Texas at the Ford Center at The Star. The ceremony will be hosted by country legends", "label": 0}
{"input": "On 18 September 2022, protests in Moldova began in the capital city of Chișinău, demanding the resignation of the country's pro-Western government, amid an energy crisis causing rising natural gas prices and", "label": 0}
{"input": "Elections for the Legislature of Guam took place on November 4, 2014, coinciding with the 2014 United States elections and the Guam gubernatorial election. All 15 seats in the Legislature of Guam", "label": 1}
{"input": "The 19th National Television Awards was held at The O2 Arena on 22 January 2014. The event was presented by Dermot O'Leary, who himself was nominated for an award. The ceremony was", "label": 1}
{"input": "The 2022–2023 mpox outbreak in South America is a part of the outbreak of human mpox caused by the West African clade of the monkeypox virus. The outbreak reached South America on", "label": 0}
{"input": "The Hana Kimura Memorial Show 3 (木村花メモリアルマッチ『またね』, Kimura Hana Memoriaru Matchi \"Matane\" 3) is the upcoming third Japanese professional wrestling memorial show and pay-per-view event promoted by Kyoko Kimura to commemorate the", "label": 0}
{"input": "The Aswan tribal clashes were a series of clashes east of Egypt's southern city of Aswan between two local ethnic tribes: the Arab Al-Halayel (Beni Helal) clan and the Nubian Al-Dabodeya family.", "label": 1}
{"input": "Virunga is a 2014 British documentary film directed by Orlando von Einsiedel. It focuses on the conservation work of park rangers within the Congo's Virunga National Park during the rise of the", "label": 1}
{"input": "The 2013–2014 Thai political crisis was a period of political instability in Thailand. Anti-government protests took place between November 2013 and May 2014, organised by the People's Democratic Reform Committee (PDRC), a", "label": 1}
{"input": "The 2023 Saudi Arabian Grand Prix (officially known as the Formula 1 STC Saudi Arabian Grand Prix 2023) was a Formula One motor race that was held on 19 March 2023 at", "label": 0}
{"input": "The World Scrabble Championship 2014, renamed by Mattel to Scrabble Champions Tournament in 2013, was held at the ExCeL London Exhibition and Convention Centre, London in November 2014. It was the first", "label": 1}
{"input": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to", "label": 1}
{"input": "The 2014 UEC European Track Championships was the fifth edition of the elite UEC European Track Championships in track cycling and took place at the Vélodrome Amédée Détraux in Baie-Mahault, Guadeloupe, France,", "label": 1}
{"input": "The 2023 World Baseball Classic Pool B was the second of four pools of the 2023 World Baseball Classic that took place from March 9–13 at the Tokyo Dome in Tokyo, Japan.", "label": 0}
{"input": "On 4 September 2014, 82-year-old Palmira Silva was beheaded in her back garden in Edmonton, London, by 25-year-old Nicholas Salvador, who was on a rampage. Friends of Salvador had recently noticed odd", "label": 1}
{"input": "The 2014 National Coalition Party leadership election was held in Lahti, Finland on 14 June 2014 to elect the new chair of the National Coalition Party. Incumbent party chair and Prime Minister", "label": 1}
{"input": "The 43rd Golden Raspberry Awards, or Razzies, honored the worst the film industry had to offer in 2022 on March 10, 2023. The awards were based on votes from members of the", "label": 0}
{"input": "In July 2014, an internationally publicised incident occurred in which a Thai woman, Pattaramon Janbua, who had been hired as a surrogate mother for an Australian couple, sought to raise money for", "label": 1}
{"input": "The Heywood and Middleton by-election was on 9 October 2014 in the Heywood and Middleton constituency following the death of its MP Jim Dobbin on 6 September 2014. It was held on", "label": 1}
{"input": "The 2014 Sundarbans oil spill was an oil spill that occurred on 9 December 2014 at the Shela River in Sundarbans, Bangladesh, a UNESCO World Heritage Site. The spill occurred when an", "label": 1}
{"input": "The Miss Brazil 2014 was the 60th edition of the Miss Brazil pageant, held in Centro de Eventos do Ceará, Fortaleza, Ceará, Jakelyne Oliveira of Mato Grosso, crowned her successor Melissa Gurgel", "label": 1}
{"input": "Blood Swept Lands and Seas of Red was a public art installation created in the moat of the Tower of London, England, between July and November 2014. It commemorated the centenary of", "label": 1}
{"input": "2023 Gagauz gubernatorial election will be held on 30 April 2023 on the territory of the Autonomous Territorial Unit of Gagauzia, part of the Republic of Moldova. The position of Governor (Başkan)", "label": 0}
{"input": "On 5 May 2014, a yacht and a dinghy, both overcrowded and carrying migrants destined for Greece, capsized about four nautical miles off the coast of the Greek island of Samos, in", "label": 1}
{"input": "Intel Blockscale was a brand of crypto-mining accelerator ASIC sold by the U.S. chip manufacturer Intel. The Blockscale product debuted in June 2022, and was cancelled by Intel in April 2023. Intel", "label": 0}
{"input": "The Suez Canal Corridor Area Project (Arabic: مشروع تطوير محور قناة السويس) is a megaproject in Egypt that was launched on 5 August 2014 by President Abdel Fattah el-Sisi and completed in", "label": 1}
{"input": "ARSAT-1 is a geostationary communications satellite operated by AR-SAT and built by the Argentine company INVAP. ARSAT-1 was launched into orbit on October 16, 2014, from French Guiana alongside Intelsat-30 satellite using", "label": 1}
{"input": "The 44th Sports Emmy Awards will be presented by the National Academy of Television Arts and Sciences (NATAS), honoring the best in American sports television coverage in 2022. The ceremony will take", "label": 0}
{"input": "Tailte Éireann (lit. 'Irish Lands') is a state agency in Ireland responsible for property registrations, property valuation and national mapping services. It was established on 1 March 2023 from a merger of", "label": 0}
{"input": "The 40th G7 summit was held 4–5 June, 2014 in Brussels, Belgium. It was originally scheduled to be held as the “40th G8 summit” and be hosted by Russia in the Black", "label": 1}
{"input": "Gutter oil, trench oil, sewer oil and tainted oil (Chinese: 地沟油 / 地溝油; pinyin: dìgōu yóu, or 餿水油; sōushuǐ yóu) are Chinese slang terms primarily used in China and Taiwan to refer", "label": 1}
{"input": "Operation Okra is the Australian Defence Force (ADF) contribution to the military intervention against the Islamic State. The force is part of Joint Task Force 633 in the Middle East. The operation", "label": 1}
{"input": "The International Year of Crystallography (abbreviation: IYCr2014) is an event promoted in the year 2014 by the United Nations to celebrate the centenary of the discovery of X-ray crystallography and to emphasise", "label": 1}
{"input": "On 4 January 2023, newly-appointed Israeli Justice Minister Yariv Levin announced his intention to make a number of major changes to the judicial system and the balance of powers in Israel. On", "label": 0}
{"input": "The 34th GLAAD Media Awards is the 2023 annual presentation of the GLAAD Media Awards, presented by GLAAD honoring the 2022 media season. They will be held on March 30, 2023 in", "label": 0}
{"input": "The 2023 Africa Magic Viewers' Choice Awards is scheduled to hold between 18 and 20 May 2023. The event will include a series of pre-show activities with the actual award show set", "label": 0}
{"input": "On 17 March 2023, as part of its investigation, the International Criminal Court (ICC) issued arrest warrants for Vladimir Putin, the President of Russia, and Maria Lvova-Belova, Russian Commissioner for Children's Rights,", "label": 0}
{"input": "The 2014 West Midlands Police and Crime Commissioner by-election was a by-election for the position of Police and Crime Commissioner in the West Midlands Police region of the United Kingdom, held on", "label": 1}
{"input": "General elections were held in Antigua and Barbuda on 12 June 2014. The result was a victory for the opposition Antigua and Barbuda Labour Party led by Gaston Browne, which won 14", "label": 1}
{"input": "The 2023 South American summit will be a summit organized and hosted by the government of Brazil \"to deal with the importance of seeking collective solutions in the name of a common", "label": 0}
{"input": "Marin Draganja and Nikola Mektić were the defending champions but only Nikola Mektić returned, partnering Goran Tošić, but lost in the first round to Dino Marcan and Antonio Šančić. Dino Marcan and", "label": 1}
{"input": "The response of the United States to the ongoing Russian invasion of Ukraine that began in 2022 has been in favor of Ukraine. President Biden condemned the invasion, providing humanitarian and military", "label": 0}
{"input": "The 2023 Stanley Cup playoffs is the ongoing playoff tournament of the National Hockey League (NHL) for the 2022–23 season. The playoffs began on April 17, 2023, three days after the end", "label": 0}
{"input": "The Lucha Libre World Cup was a professional wrestling event and tournament organized by Mexican professional wrestling promotion Lucha Libre AAA Worldwide (AAA). The tournament took place on March 19, 2023 at", "label": 0}
{"input": "Many journalists compared the events of the 2023 Brazilian Congress attack to the January 6 United States Capitol attack. Several newspapers, including O Globo, Veja, and Folha de S.Paulo, characterised what happened", "label": 0}
{"input": "Shenzhou 16 (Chinese: 神舟十六号; pinyin: Shénzhōu Shí'liù-hào; lit. 'Divine Boat Number 16') is a planned Chinese spaceflight to the Tiangong space station, expected to launch in May 2023 on board a Shenzhou", "label": 0}
{"input": "The Arab Sharkas case is the name given to the military trial of nine men in Egypt in August 2014. Six defendants were sentenced to death in October, and executed in May", "label": 1}
{"input": "On 23 March 2023, a boat sunk off the Tunisian coast, resulting in at least five dead and 34 missing migrants. The vessel was attempting to reach Italy, and it was the", "label": 0}
{"input": "The 2014 Burkina Faso uprising was a series of demonstrations and riots in Burkina Faso in October 2014 that quickly spread to multiple cities. They began in response to attempts at changing", "label": 1}
{"input": "Entertainment journalism is any form of journalism that focuses on popular culture and the entertainment business and its products. Like fashion journalism, entertainment journalism covers industry-specific news while targeting general audiences beyond", "label": 0}
{"input": "A joint declaration was made on 11 February 2014 at the start of renewed negotiations to settle the Cyprus dispute. The following talks between Nicos Anastasiades, President of Cyprus, and Derviş Eroğlu,", "label": 1}
{"input": "The 2014 Coupe de France Final decided the winner of the 2013–14 Coupe de France, the 97th season of France's premier football cup. It was played on 3 May at the Stade", "label": 1}
{"input": "On April 10, 2023, a mass shooting occurred at the Old National Bank in Louisville, Kentucky, United States. Five people were killed, and eight others were injured, including two responding police officers.", "label": 0}
{"input": "The 2023 Madrid City Council election, also the 2023 Madrid municipal election, will be held on Sunday, 28 May 2023, to elect the 12th City Council of the municipality of Madrid. All", "label": 0}
{"input": "Protests at several locations in Ireland started in early November 2022 after the development of sites in various parts of the country as temporary refugee shelters by the Department of Children, Equality,", "label": 0}
{"input": "From March 2012 to May 2014, the Salvadoran government, the Catholic Church, and the country's two largest criminal gangs, Mara Salvatrucha (MS-13) and the 18th Street gang (Barrio 18), came to a", "label": 1}
{"input": "The 24th Annual British Academy Television Craft Awards took place on 23 April 2023 at The Brewery in London, presented by the British Academy of Film and Television Arts (BAFTA) to recognize", "label": 0}
{"input": "Miss France 2015, the 85th edition of the Miss France pageant, was held on December 6, 2014 at Zénith d'Orléans in Orléans. Miss France 2014, Flora Coquerel of Orléanais (Centre-Val de Loire)", "label": 1}
{"input": "The Northern Rocky Mountains ecosystem in the United States is known by ecologists, biologists, and naturalists as one of the last areas of the contiguous United States that is relatively undeveloped enough", "label": 0}
{"input": "Wrestle Kingdom 8 in Tokyo Dome was a professional wrestling pay-per-view (PPV) event produced by the New Japan Pro-Wrestling (NJPW) promotion, which took place at the Tokyo Dome in Tokyo, Japan on", "label": 1}
{"input": "From mid-2014 onward, Brazil experienced a severe economic crisis. The country's Gross Domestic Product (GDP) fell by 3.5% in 2015 and 3.3% in 2016, after which a small economic recovery began. That", "label": 1}
{"input": "The Kasta Tomb (Greek: Τύμβος Καστά), also known as the Amphipolis Tomb (Greek: Τάφος της Αμφίπολης), is the largest ancient tumulus (burial mound) ever discovered in Greece, and by comparison dwarfs that", "label": 1}
{"input": "Miss Teen USA 2023 will be the 41st Miss Teen USA pageant that will be held in 2023 at the Grand Sierra Resort in Reno, Nevada. Faron Medhi of Nebraska will crown", "label": 0}
{"input": "The Reddings was an American funk, soul and disco band, founded by Otis Redding's sons Dexter (bass and vocals) and Otis Redding III (December 17, 1963 – April 18, 2023 age 59;", "label": 0}
{"input": "Indian Data Relay Satellite System or IDRSS is a planned Indian constellation of Inter-satellite communications satellites. It is planned to initially comprise two satellites, CMS-04 (formerly IDRSS-1) & IDRSS-2 in geostationary orbit.", "label": 0}
{"input": "The 15th Terengganu state election will be held in 2023 to elect the State Assembly members of the 15th Terengganu State Legislative Assembly, the legislature of the Malaysian state of Terengganu. Terengganu", "label": 0}
{"input": "Action Plan against Disinformation (Czech: Akční plán pro čelení dezinformacím) was a material that was prepared by the government commissioner for media and disinformation Michal Klíma and his team of experts at", "label": 0}
{"input": "A long series of criminal investigations have occurred in Brazil associated with Operation Car Wash. The first investigation was launched in March 2014, and is now known as phase 1 of the", "label": 1}
{"input": "An Honours List on The Demise of Her Majesty Queen Elizabeth II, known as the Demise Honours, was released on 25 March 2023, following the death of Elizabeth II in 2022. It", "label": 0}
{"input": "The Flanders Fields Memorial Garden is a monument dedicated to the participants of World War I situated alongside the Guards Chapel at Wellington Barracks in Central London, England. The garden was opened", "label": 1}
{"input": "An indirect presidential election was held in Vietnam on 2 March 2023. The election took place early following the resignation of President Nguyễn Xuân Phúc as part of a broad anti-corruption purge", "label": 0}
{"input": "From January 28 to February 4, 2023, a Chinese-operated high-altitude balloon was spotted in North American airspace, including Alaska, western Canada, and the contiguous United States. On February 4, the U.S. Air", "label": 0}
{"input": "Ethiopian Airlines Flight 702 was a scheduled flight from Addis Ababa to Milan via Rome on 17 February 2014. The aircraft, an Ethiopian Airlines Boeing 767-300ER, was hijacked by the unarmed co-pilot,", "label": 1}
{"input": "The GSK China scandal was an imbroglio where the China branch of the global drugmaker GlaxoSmithKline (GSK) pleaded guilty to paying bribes to doctors and hospitals to promote the company's products in", "label": 1}
{"input": "The 15th Penang state election will be held in 2023 to elect the State Assembly members of the 15th Penang State Legislative Assembly, the legislature of the Malaysian state of Penang. Penang", "label": 0}
{"input": "The 15th Annual British Academy Television Craft Awards were presented by the British Academy of Film and Television Arts (BAFTA) on 24 April 2014, with Stephen Mangan presiding over the event. The", "label": 1}
{"input": "Puteri Indonesia 2023, (Lampungnese: , Javanese: ꦦꦸꦠꦺꦫꦶ​ꦆꦤ꧀ꦢꦺꦴꦤꦺꦱ​꧇꧒꧐꧒꧓꧇) the 26th Puteri Indonesia pageant, will be held on 19 May 2023 in Jakarta, Indonesia. Puteri Indonesia 2022, Laksmi Shari De-Neefe Suardana of Bali will", "label": 0}
{"input": "Miss Universe 2023 will be the 72nd Miss Universe pageant, to be held in 2023 in El Salvador. R'Bonney Gabriel of the United States will crown her successor at the end of", "label": 0}
{"input": "The Dublin Airport drone incidents are a number of incursions of drones into airspace around Dublin Airport, including a series in early 2023, which caused disruption of airport operations. It is illegal", "label": 0}
{"input": "In 2014, a series of groundbreaking diplomatic meetings was held between Wang Yu-chi, in his official capacity as the Minister of the Mainland Affairs Council (MAC) of the Republic of China (ROC),", "label": 1}
{"input": "The 2023 AIR Awards is the upcoming seventeenth annual Australian Independent Record Labels Association Music Awards ceremony (generally known as the AIR Awards), scheduled to take place on 3 August 2023 in", "label": 0}
{"input": "The 15th Selangor state election will be held in 2023 to elect the State Assembly members of the 15th Selangor State Legislative Assembly, the legislature of the Malaysian state of Selangor. Selangor", "label": 0}
{"input": "Belarus participated in the Junior Eurovision Song Contest 2014 in Marsa, Malta. The Belarusian entry was selected through a national final, organised by Belarusian broadcaster National State Television and Radio Company of", "label": 1}
{"input": "Chinese Taipei or Taiwan is scheduled to compete at the 2022 Asian Games in Hangzhou, Zhejiang, China, from 23 September 2023 to 8 October 2023. However, due to the COVID-19 pandemic cases", "label": 0}
{"input": "The 2014 European Aquatics Championships took place from 13 to 24 August 2014 in Berlin, Germany. It was the 31st edition of the championships, and was held in a temporary facility placed", "label": 1}
{"input": "The 2014 Belgian Cup Final, named Cofidis Cup after the sponsor, was the 59th Belgian Cup final and took place on 22 March 2014 between Lokeren and Zulte Waregem. It was won", "label": 1}
{"input": "Operation Kaveri (Hindi: कावेरी, romanized: Kaveri, lit. Kaveri River) is an ongoing operation conducted by the Indian Armed Forces to evacuate Indian citizens and foreign nationals from Sudan during the 2023 Sudan", "label": 0}
{"input": "General elections are expected to be held in the Democratic Republic of the Congo on 20 December 2023 according to the electoral calendar released 26 November 2022 by the Independent National Electoral", "label": 0}
{"input": "Belarus participated in the Eurovision Song Contest 2014 with the song \"Cheesecake\" written by Yuriy Vashchuk and Dmitry Novik. The song was performed by Teo, which is the artistic name of singer", "label": 1}
{"input": "The II CELAC summit or 2014 CELAC summit was the second ordinary heads of state summit of the Community of Latin American and Caribbean States. It was held on 28 and 29", "label": 1}
{"input": "The 2022–23 Bangladesh Championship League is the 11th season of the Bangladesh Championship League since its establishment in 2012. A total of 11 football clubs will be competing in the league.Fortis FC", "label": 0}
{"input": "In April 2022, during the Russian invasion of Ukraine, an anti-war drawing of Maria Moskaylova, a sixth-grader in the Russian town of Yefremov, led to the political persecution of the girl and", "label": 0}
{"input": "The Willis Resilience Expedition was a scientific and exploratory program that took place in Antarctica from November 2013 to January 2014, with the goal of a better understanding of changes in the", "label": 1}
{"input": "The 2014 Laurence Olivier Awards was held on Sunday 13 April 2014 at the Royal Opera House, London. The awards were presented by Gemma Arterton and Stephen Mangan. The highlights programme was", "label": 1}
{"input": "An internal conflict in the Central African Republic (CAR) started essentially on 13 April 2013, when the government of President Michel Djotodia officially took over. The fighting was between the government of", "label": 1}
{"input": "The Hampden Bridge was a heritage-listed wooden Allan Truss bridge over the Murrumbidgee River in Wagga Wagga, in New South Wales, Australia. It was officially opened to traffic on 11 November 1895", "label": 1}
{"input": "Operation Wuambushu (\"recovery\" in Shimaore) is an ongoing French military-police operation in Mayotte, aimed at expelling illegal aliens, destroying slums, and fighting crime on the island.The operation was revealed on February 22,", "label": 0}
{"input": "Georgia joined the war in Afghanistan in 2004 and the country had become the largest non-NATO and the largest per capita troop contributor to the International Security Assistance Force in Afghanistan by", "label": 1}
{"input": "NCT DoJaeJung (Korean: 엔시티 도재정; RR: Ensiti Dojaejeong; stylized as all caps) is the fifth sub-unit of the South Korean boy band NCT, formed and managed by SM Entertainment. The group consists", "label": 0}
{"input": "The 7th Crunchyroll Anime Awards was held on March 4, 2023, at the Main Banquet Hall of the Grand Prince Hotel New Takanawa in Tokyo, Japan. It was the first ceremony to", "label": 0}
{"input": "The Ettehadiya case is a controversial legal case in Egypt where thousands of protesters went down to the Ittihadiya Palace, the Presidential offices in Cairo, asking for the repeal of the newly", "label": 1}
{"input": "In the parliamentary elections in Andorra on 2 April 2023, the incumbent liberal-conservative coalition between Democrats for Andorra (DA) and Committed Citizens (CC) won an absolute majority led by Prime Minister Xavier", "label": 0}
{"input": "Presidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The", "label": 1}
{"input": "Global Wars was a professional wrestling supershow co-produced by the American Ring of Honor (ROH) and Japanese New Japan Pro-Wrestling (NJPW) promotions. The event took place on May 10, 2014, at the", "label": 1}
{"input": "In March 2023, a major fire broke out at the 110-acre Bhrahmapuram landfill site at Bhrahmapuram in Vadavukot-Puthankurish Panchayat, 17 km away from Kochi city. The fire began on 2 March 2023", "label": 0}
{"input": "The following are the appointments to various Canadian Honours of 2023. Usually, they are announced as part of the New Year and Canada Day celebrations and are published within the Canada Gazette", "label": 0}
{"input": "Dzhumaya Mosque (Bulgarian: Джумая джамия) is located in Plovdiv, Plovdiv Province, Bulgaria. Its Turkish name is Hüdavendigâr Camii or Cuma Camii. The mosque is located in the centre of Plovdiv and was", "label": 1}
{"input": "An ongoing refugee crisis began in Europe in late February 2022 after Russia's invasion of Ukraine. Over 8.1 million refugees fleeing Ukraine have been recorded across Europe, while an estimated 8 million", "label": 0}
{"input": "In 2014, an outbreak of Ebola virus disease in the Democratic Republic of the Congo (DRC) occurred. Genome sequencing has shown that this outbreak was not related to the 2014–15 West Africa", "label": 1}
{"input": "Double salary saga is the name given by media outlets to a political scandal in Ghana. Between 2012 and 2016, some members of the John Dramani Mahama administration who were ministers or", "label": 1}
{"input": "The 2023 FIBA Under-19 Women's Basketball World Cup is a tournament organised by FIBA for women's youth national teams aged 19 years old and below. The tournament will be hosted in Madrid,", "label": 0}
{"input": "Cream Soda is a Russian electronic music group founded in 2012. The members of the group write the music and the lyrics to the songs, sing and play live in concerts. On", "label": 0}
{"input": "The 2014 Toronto Blue Jays season was the 38th season for the franchise, and the 25th full season of play (26th overall) at Rogers Centre. Pitcher Roy Halladay signed a one-day contract", "label": 1}
{"input": "UN Member States are currently negotiating a legally-binding, international agreement on plastics that will address the entire life cycle of plastics, from design to production and disposal. On March 2, 2022 UN", "label": 0}
{"input": "Tropical Cyclone Cheneso was a strong tropical cyclone that affected Madagascar in January 2023. The fourth tropical storm and fifth tropical cyclone of the 2022–23 South-West Indian Ocean cyclone season, Cheneso developed", "label": 0}
{"input": "Triplemanía XXXI is an ongoing three-day professional wrestling pay-per-view (PPV) event promoted and produced by the Mexican professional wrestling promotion Lucha Libre AAA Worldwide (AAA or Triple A). The event is being", "label": 0}
{"input": "The Dazz Band is an American R&B/funk band most popular in the early 1980s. Emerging from Cleveland, Ohio, the group's biggest hit songs include \"Let It Whip\" (1982), \"Joystick\" (1983), and \"Let", "label": 0}
{"input": "The 2015 World Junior Ice Hockey Championships was the 39th edition of Ice Hockey World Junior Championship, played from December 26, 2014 to January 5, 2015. It was co-hosted by Toronto, Ontario,", "label": 1}
{"input": "Air Algérie Flight 5017 was a scheduled international passenger flight from Ouagadougou, Burkina Faso, to Algiers, Algeria, which crashed near Gossi, Mali, on 24 July 2014. The McDonnell Douglas MD-83 twinjet with", "label": 1}
{"input": "The 2014 Kremlin Cup was a tennis tournament played on indoor hard courts. It was the 25th edition of the Kremlin Cup for the men (19th edition for the women) and part", "label": 1}
{"input": "The 2023 State of the Union Address was given by the 46th president of the United States, Joe Biden, on Tuesday, February 7, 2023, at 9:00 p.m. EST, in the chamber of", "label": 0}
{"input": "The 2023 Nigerian currency crisis was precipitated by a shortage of cash currency (the naira) and an attempt by the Nigerian government to force citizens to use a newly created government-sponsored central", "label": 0}
{"input": "Devu G. versus State Of Kerala & Ors. (2023) is the case where Supreme Court granted special leave to appeal for a queer petitioner who received an unfavourable ruling in a High", "label": 0}
{"input": "The 2023 New Zealand census, which took place on 7 March 2023, was the thirty-fifth national census in New Zealand. It implemented measures that aimed to increase the Census' effectiveness in response", "label": 0}
{"input": "Miss Grand Vietnam 2023 will be the second edition of the Miss Grand Vietnam beauty pageant, scheduled to be held in Ho Chi Minh City on August 26, 2023. National finalists qualified", "label": 0}
{"input": "The 2014 DFB-Pokal Final decided the winner of the 2013–14 DFB-Pokal, the 71st season of Germany's premier football cup. It was played on 17 May at the Olympiastadion in Berlin. In the", "label": 1}
{"input": "On 3 April 2023, the Israeli army conducted a military operation in Nablus, resulting in the death of two Palestinians and injuries to several others. The operation was in response to allegations", "label": 0}
{"input": "Stichting Shell Pensioenfonds v Krys [2014] UKPC 41 (24 November 2014) was a decision of the Privy Council on appeal from the British Virgin Islands relating to an anti-suit injunction in connection", "label": 1}
{"input": "Viscount Knollys (), of Caversham in the County of Oxford, is a title in the Peerage of the United Kingdom. It was created in 1911 for the court official Francis Knollys, 1st", "label": 0}
{"input": "The murder of Jacqueline Montgomery, a 15-year-old girl from Islington, North London, United Kingdom, occurred on 1 June 1975. She was murdered by Dennis McGrory, her aunt's 28-year-old estranged partner, who was", "label": 0}
{"input": "On 19 April 2023, a crowd crush occurred in the Old City of Sanaa, the capital of Yemen, after people gathered in front of a school to receive the traditional alms of", "label": 0}
{"input": "The Oulu child murders is a Finnish murder case, referring to the discovery of the bodies of five infants in the basement of an apartment building in Oulu, on June 3, 2014.", "label": 1}
{"input": "The 2014 FIBA World Championship for Women, the 17th edition of FIBA's premier international tournament for women's national basketball teams, was held in Ankara and Istanbul, Turkey from 27 September to 5", "label": 1}
{"input": "General elections were held in Bolivia on 12 October 2014, the second to take place under the country's 2009 constitution, and the first supervised by the Plurinational Electoral Organ, a newly created", "label": 1}
{"input": "The 20th Korean Music Awards was held in Seoul, South Korea on March 5, 2023. Hosted by the Korean Music Awards Selection Committee and sponsored by the Ministry of Culture, Sports and", "label": 0}
{"input": "Starting in May 2022, postal workers in the United Kingdom undertook a series of strikes and industrial disputes. They principally involved members of Unite and the Communication Workers Union (CWU) at both", "label": 0}
{"input": "The 2014–2015 eruption of Fogo began on 23 November 2014, continuing until 8 February 2015. It was the first eruption of Pico do Fogo in 19 years, and the longest since its", "label": 1}
{"input": "General elections were held in the Republika Srpska entity of Bosnia and Herzegovina on 12 October 2014 as part of the Bosnian general elections. Incumbent President Milorad Dodik was re-elected, running on", "label": 1}
{"input": "On March 30, 2023, 63-year-old pensioner Mikhail Simonov was convicted due to two comments under other people's posts in the Russian social network VKontakte. Mikhail Simonov Alexei was accused of discrediting the", "label": 0}
{"input": "Alice Gross (14 February 2000 – 28 August 2014) was an English girl who was murdered in West London. Her body was found hidden on the bed of the River Brent on", "label": 1}
{"input": "The Death of Jullebee Ranara, an Overseas Filipino Worker in Kuwait, was established to have occurred after her body was found buried in the desert on January 21, 2023. She was reportedly", "label": 0}
{"input": "The 2013–2014 chikungunya outbreak represented the first recorded outbreak of the disease outside of tropical Africa and Asia. In December 2013, the first locally transmitted case of chikungunya in the Americas was", "label": 1}
{"input": "The 36th Moscow International Film Festival took place from 19 to 28 June 2014. Russian film director Gleb Panfilov was the head of the main jury. Gabe Polsky's Red Army was selected", "label": 1}
{"input": "The 2014 United Nations Security Council election was held on 16 October 2014 during the 69th session of the United Nations General Assembly, held at United Nations Headquarters in New York City.", "label": 1}
{"input": "The state visit of Michael D. Higgins to the United Kingdom occurred on 7 April 2014. It was the first state visit of a President of Ireland to the United Kingdom. The", "label": 1}
{"input": "The 2014 Brisbane hailstorm struck Brisbane, the capital city of Queensland, Australia on 27 November 2014. The storm caused severe damage to many buildings and cars in the city. Around 40 people", "label": 1}
{"input": "Separate men's and women's Wheelchair Basketball World Championship tournaments were held in 2014. The women's tournament was held at the Mattamy Athletic Centre in Toronto, Canada between 20 and 28 June 2014.", "label": 1}
{"input": "A news bureau is an office for gathering or distributing news. Similar terms are used for specialized bureaus, often to indicate a geographic location or scope of coverage: a ‘Tokyo bureau’ refers", "label": 0}
{"input": "The United Nations High Seas Treaty is an instrument of the United Nations Convention on the Law of the Sea (UNCLOS), agreed by an intergovernmental conference at the UN on 4 March", "label": 0}
{"input": "The centenary of the outbreak of World War I was commemorated in Europe in late July and early August 2014. A century earlier, the July Crisis, which occurred after the assassination of", "label": 1}
{"input": "On the afternoon of 24 May 2014, a gunman opened fire at the Jewish Museum of Belgium in Brussels, killing four people. Three of them, an Israeli couple on holiday and a", "label": 1}
{"input": "Parliamentary elections were held in Estonia on 5 March 2023 to elect all 101 members of the Riigikogu. The officially published election data indicate the victory of the Reform Party, which won", "label": 0}
{"input": "The 1st Ikon Awards ceremony, presented by the Sauti Plus Hub, honored Ugandan films released from 2021 and 2022, and took place at the Kampala Serena Hotel in Kampala, Uganda, on March", "label": 0}
{"input": "Below are the foreign reactions to the Euromaidan. Euromaidan was a wave of demonstrations and civil unrest in Ukraine that began on the night of 21 November 2013 after the Ukrainian government", "label": 1}
{"input": "R v Incedal and Rarmoul-Bouhadjar (2014), formerly known as R v AB and CD, is a criminal case brought in the United Kingdom against two people suspected of terrorism offences. It was", "label": 1}
{"input": "The 2023 Princess Auto Players' Championship was held from April 11 to 16 at the Mattamy Athletic Centre in Toronto, Ontario. It was the fifth Grand Slam event and final major of", "label": 0}
{"input": "A referendum on joining the Unified Patent Court was held in Denmark on 25 May 2014 alongside European Parliament elections. The referendum was approved with 62.5% of the vote, enabling the government", "label": 1}
{"input": "Fit for 55 is a package by the European Union designed to reduce the European Union's greenhouse gas emissions by 55% by 2030. The package was proposed in July 2021 by the", "label": 0}
{"input": "The 2023 iHeartRadio Music Awards were held at the Dolby Theatre in Los Angeles on March 27, 2023, and broadcast live on Fox. It was hosted by singer-songwriter and actor Lenny Kravitz.", "label": 0}
{"input": "Soyuz MS-23 is an uncrewed Russian Soyuz spaceflight that launched from Baikonur on 24 February 2023 to the International Space Station, in order to replace the Soyuz MS spacecraft for landing that", "label": 0}
{"input": "On 26 January 2023, the Israel Border Police and the Israeli army conducted an armed raid on the Jenin refugee camp, which is in Area A of the Israeli-occupied West Bank and", "label": 0}
{"input": "On February 6, 2023, the China Coast Guard and Philippine Coast Guard had an encounter near the Second Thomas Shoal, one of the features of the Spratly Islands which is subject to", "label": 0}
{"input": "Georgia participated in the Junior Eurovision Song Contest 2014 which took place on 15 November 2014, in Marsa, Malta. Georgian Public Broadcaster (GPB) was responsible for organising their entry for the contest.", "label": 1}
{"input": "Bulgaria selected their Junior Eurovision Song Contest 2014 entry through an internal selection. On 26 July 2014 the Bulgarian broadcaster BNT stated that they will return to the contest with Krisia Todorova.", "label": 1}
{"input": "The 2023 Libera Awards will be held on June 15, 2023, to recognize the best in independent music of 2022 presented by the American Association of Independent Music. The ceremony will take", "label": 0}
{"input": "The 2023 San Miguel Corporation (SMC) - Philippine Sportswriters Association (PSA) Annual Awards was an annual awarding ceremony honoring the individuals (athletes, teams, officials and organizations) and organizations that made a significant", "label": 0}
{"input": "The second inauguration of Juan Manuel Santos as the 32rd President of Colombia marked the beginning of his second term in the house of Nariño as head of state for Juan Manuel", "label": 1}
{"input": "The Estación Polar Científica Conjunta Glaciar Unión (or Union Glacier Joint Scientific Polar Station) or Union Glacier Station is a summer Antarctic base of Chile, situated on Union Glacier in the Ellsworth", "label": 1}
{"input": "On the morning of 14 March 2023, a Russian Su-27 fighter jet intercepted and damaged an American MQ-9 Reaper drone, causing it to crash into the Black Sea. This became the first", "label": 0}
{"input": "A constitutional referendum was held in Egypt on 14 and 15 January 2014 and with Egyptians abroad voting between 8 and 12 January. The new constitution was approved by 98.1% of voters.", "label": 1}
{"input": "The 4th Magritte Awards ceremony, presented by the Académie André Delvaux, honored the best films of 2013 in Belgium and took place on 1 February 2014, at the Square in the historic", "label": 1}
{"input": "Wrestle Kingdom 17 was a two-day professional wrestling pay-per-view (PPV) event co-produced by the New Japan Pro-Wrestling (NJPW) and Pro Wrestling Noah (Noah) promotions. The first day of the event took place", "label": 0}
{"input": "All Star Extravaganza VI is a professional wrestling pay-per-view event produced by Ring of Honor (ROH). It took place on September 6, 2014, at the Mattamy Athletic Center in Toronto, Ontario, Canada.", "label": 1}
{"input": "The Vienna Summer of Logic was a scientific event in the summer of 2014, combining 12 major conferences and several workshops from the fields of mathematical logic, logic in computer science, and", "label": 1}
{"input": "The APRA Music Awards of 2023 are the upcoming 41st annual series, known as the APRA Awards. The awards are given in a series of categories in three divisions and in separate", "label": 0}
{"input": "The Stone Coyotes are an American band that debuted with their first album in 1998. They hail from Massachusetts but tour primarily in Texas as that is where they receive their most", "label": 0}
{"input": "Eurovision Choir 2023 will be the third Eurovision Choir competition for choral singers, organised by the European Broadcasting Union (EBU) and Interkultur. Latvia will host the event for the second time. The", "label": 0}
{"input": "Prabowo Subianto's presidential campaign in 2024 is his third bid for the presidency of Indonesia. For his third bid, his party, Gerindra Party, formed a coalition with the National Awakening Party on", "label": 0}
{"input": "The Minsk agreements were a series of international agreements which sought to end the Donbas war fought between armed Russian separatist groups and Armed Forces of Ukraine, with Russian regular forces playing", "label": 1}
{"input": "The 2014 World Team Table Tennis Championships were held in Tokyo from 28 April to 5 May 2014. The Championships was staged in Japan for the seventh time and was the 52nd", "label": 1}
{"input": "A hybrid solar eclipse occurred on Thursday, April 20, 2023. A solar eclipse occurs when the Moon passes between Earth and the Sun thereby totally or partly obscuring the Sun for a", "label": 0}
{"input": "Lights Out was an event on 4 August 2014 in the United Kingdom to commemorate the centenary of the start of World War I. It was inspired by the words of Sir", "label": 1}
{"input": "The Delhi-Kathmandu bus is a trans-boundary bus service connecting India and Nepal's capitals at Delhi and Kathmandu respectively. The service is operated by the Delhi Transport Corporation (DTC) and was launched in", "label": 1}
{"input": "On January 17, 2014, a suicide bomber detonated explosives at the gate of the Taverna du Liban, a heavily fortified restaurant in Kabul popular with foreign nationals, including diplomats, aid workers and", "label": 1}
{"input": "The 50th Daytime Emmy Awards, presented by the National Academy of Television Arts and Sciences (NATAS), will honor the best in U.S. daytime television programming in 2022. The award ceremony is planned", "label": 0}
{"input": "The Practice of the 'One Country, Two Systems' Policy in the Hong Kong Special Administrative Region (Chinese: 「一國兩制」在香港特別行政區的實踐) is a white paper issued by the Information Office of the State Council of", "label": 1}
{"input": "The Wold Newton Hoard is a coin hoard dating from the early 4th century AD. It contains 1,857 coins held within a pottery container. It was acquired by the Yorkshire Museum in", "label": 1}
{"input": "Eleanor Poppy Miranda de Freitas (26 June 1990 – 4 April 2014) was an English woman who committed suicide three days before the commencement of her trial for perverting the course of", "label": 1}
{"input": "On 28 April 2014, 61-year-old teacher Ann Maguire (5 April 1953 – 28 April 2014) was stabbed to death while teaching a Spanish lesson at Corpus Christi Catholic College in Halton Moor,", "label": 1}
{"input": "Strike! is a 2005 historical stage musical depicting the Winnipeg General Strike. It has been adapted into a Canadian Broadcasting Corporation radio production, a 17-minute short film, and the full-length feature film", "label": 0}
{"input": "The Mini-Hollands scheme was introduced in March 2014 by Boris Johnson, then Mayor of London. It took the form of a competition among outer London boroughs for a £100-million fund. Three boroughs", "label": 1}
{"input": "Tbilisi, I Love You (Georgian: თბილისი, მიყვარხარ Tbilisi, miq’varkhar) is a 2014 anthology film starring an ensemble cast of actors of various nationalities and part of Emmanuel Benbihy’s Cities Of Love franchise", "label": 1}
{"input": "The 2023 Money in the Bank is the upcoming 14th annual Money in the Bank professional wrestling pay-per-view (PPV) and livestreaming event produced by the American promotion WWE. It will be held", "label": 0}
{"input": "The 16th Meril Prothom Alo Awards ceremony, presented by Prothom Alo took place on 25 April 2014, at the Bangabandhu International Conference Center in Dhaka, Bangladesh as a part of 2013–14 film", "label": 1}
{"input": "Dear Liar, full title Dear Liar: A Comedy of Letters is a play by American actor, director, and playwright Jerome Kilty. It was first staged in 1957 and published in 1960. A", "label": 0}
{"input": "General elections were held in Antigua and Barbuda on 18 January 2023 to elect members of the House of Representatives. The Labour Party (ABLP) has held an absolute majority of 15 seats", "label": 0}
{"input": "The 67th Bodil Awards were held on 1 February 2014 in the Bremen Theater in Copenhagen, Denmark, honouring the best national and foreign films of 2013. The Hunt won the award for", "label": 1}
{"input": "On 13 March 2014, an AgustaWestland AW139 helicopter of Haughey Air crashed shortly after taking off at night in fog from Gillingham, Norfolk, United Kingdom, killing all four people on board. Among", "label": 1}
{"input": "The 2014 Yingjiang earthquake occurred on 24 May at 4:49 a.m. local time in Yingjiang County, Yunnan Province, China, with a moment magnitude of 5.6 and a maximum perceived intensity of VII", "label": 1}
{"input": "The 2022 Uganda Ebola outbreak was an outbreak of the Sudan ebolavirus, which causes Ebola, from 20 September 2022 until 10 January 2023 in the Western and Central Regions of Uganda. Over", "label": 0}
{"input": "The 2014 Moscow Victory Day Parade took place in Red Square on 9 May 2014 to commemorate the 69th anniversary of the capitulation of Nazi Germany in 1945, which formally ended hostilities", "label": 1}
{"input": "United Nations Multidimensional Integrated Stabilization Mission in the Central African Republic (also called MINUSCA, which is an initialism of its French name Mission multidimensionnelle intégrée des Nations unies pour la stabilisation en", "label": 1}
{"input": "The 34th Producers Guild of America Awards (also known as 2023 Producers Guild Awards or 2023 PGA Awards), honoring the best film and television producers of 2022, were held at the Beverly", "label": 0}
{"input": "Opération Chammal is a French military operation in Iraq and Syria launched to help curtail the expansion of the Islamic State of Iraq and the Levant and to support the Iraqi Army.", "label": 1}
{"input": "G 1/11 is a decision issued on 19 March 2014 by the Enlarged Board of Appeal of the European Patent Office (EPO), holding that a Technical Board of Appeal rather than the", "label": 1}
{"input": "Miss International 2014, the 54th Miss International pageant, organized by the International Cultural Association held on November 11, 2014 at the Grand Prince Hotel Takanawa in Tokyo, Japan. Bea Santiago of the", "label": 1}
{"input": "Everything for Chile (Spanish: Todo por Chile) is a Chilean electoral alliance formed in February 2023 to present candidacies for the 2023 Chilean Constitutional Council election that will be held on 7", "label": 0}
{"input": "The 2023 People's Choice Country Awards, the inaugural ceremony, is set to be held on September 28, 2023 at the Grand Ole Opry in Nashville, Tennessee. The ceremony will be broadcast live", "label": 0}
{"input": "On April 6, dozens of rockets were fired from Lebanon into Israel, wounding 3 Israeli civilians. The IDF has said that it has intercepted 25 rockets fired from Lebanon. Warning sirens had", "label": 0}
{"input": "Protests against the 2013 Egyptian coup d'état erupted in July 2013. Immediately following the removal of President Mohamed Morsi by the Egyptian Armed Forces on 3 July 2013 amid demonstrations against Morsi's", "label": 1}
{"input": "Göktürk-3 is a synthetic aperture radar (SAR) Earth observation satellite that will be designed and developed under prime contractorship of Turkish Aerospace Industries (TAI) with support of Military Electronic Industries (ASELSAN) and", "label": 0}
{"input": "The Newark by-election was a by-election in the Newark constituency of the British House of Commons, which was held on 5 June 2014, following the resignation of Patrick Mercer. Conservative Robert Jenrick", "label": 1}
{"input": "The 24th Annual Latin Grammy Awards will take place in November 2023 in Seville, Spain. The awards will honor recordings released between June 1, 2022, and May 31, 2023. It will mark", "label": 0}
{"input": "The 2014–15 season was Galatasaray's 111th in existence and 57th consecutive season in the Süper Lig. The club were aiming for an unprecedented twentieth league title, after finishing in second place in", "label": 1}
{"input": "Miss Colombia 2014 was the 62nd edition of the Miss Colombia pageant. It was held on November 17, 2014 in Cartagena, Colombia. At the end of the event, Paulina Vega of Atlántico", "label": 1}
{"input": "Global news flow (also referred to as international news flow) is a field of study that deals with the news coverage of events in foreign countries. It describes and explains the flow", "label": 0}
{"input": "Miss Grand Peru 2023 will be the inaugural edition of the Miss Grand Peru beauty pageant. Twelve candidates who qualified for the pageant through a virtual casting held earlier in January will", "label": 0}
{"input": "On 21 March 2023, a magnitude 6.5 earthquake struck Badakhshan Province, Afghanistan, with an intermediate depth of approximately 187 km (116 mi). The epicenter of the earthquake was 40 km (25 mi)", "label": 0}
{"input": "On 18 March 2014, Russian president Vladimir Putin gave a speech to both chambers of the Federal Assembly of the Russian Federation in connection with the request for admission by the Crimean", "label": 1}
{"input": "The Western Antarctic Ice Sheet (WAIS) is the segment of the continental ice sheet that covers West Antarctica, the portion of Antarctica on the side of the Transantarctic Mountains that lies in", "label": 1}
{"input": "8Turn (Korean: 에잇턴; stylized in all caps) is a South Korean boy band formed by MNH Entertainment. The group currently consists of eight members: Myungho, Jaeyun, Minho, Yoonsung, Haemin, Kyungmin, Yungyu and", "label": 0}
{"input": "The 2014–15 North American winter was frigid and prolifically wintry, especially across the eastern half of North America in the months of January–March. The season began early, with many places in North", "label": 1}
{"input": "The 50th Annual Daytime Creative Arts Emmy Awards, presented by the National Academy of Television Arts and Sciences (NATAS), will honor the best in US daytime television programming in 2022. The award", "label": 0}
{"input": "The 36th Annual Nickelodeon Kids' Choice Awards ceremony was held on March 4, 2023, at the Microsoft Theater in Los Angeles, California with Nate Burleson and Charli D'Amelio serving as hosts. It", "label": 0}
{"input": "Progress MS-22 (Russian: Прогресс МC-22), Russian production No.452, identified by NASA as Progress 83P, is a Progress spaceflight launched by Roscosmos to resupply the International Space Station (ISS). It is the 175th", "label": 0}
{"input": "A constitutional referendum was held in Uzbekistan on 30 April 2023. It was to be held on proposed constitutional amendments.Parliament approved the referendum on 15 March 2023. It was accepted in the", "label": 0}
{"input": "On February 11, 2023, an octagonal unidentified flying object was detected over northern Montana. It disappeared until spotted the next day in Wisconsin, flying at 20,000 feet over the Upper Peninsula of", "label": 0}
{"input": "The 29th Annual Screen Actors Guild Awards, honoring the best achievements in film and television performances for the year 2022, were presented on February 26, 2023 at the Fairmont Century Plaza in", "label": 0}
{"input": "The eighteenth summit of 'South Asian Association of Regional Cooperation' (SAARC) was held in Kathmandu, the capital of Federal Democratic Republic of Nepal during 26–27 November 2014. The theme of the summit", "label": 1}
{"input": "The 19th Empire Awards ceremony (officially known as the Jameson Empire Awards), presented by the British film magazine Empire, honored the best films of 2013 and took place on 30 March 2014", "label": 1}
{"input": "On 10 January 2023, Constantine II of Greece, Head of the Royal House of Greece, who reigned as the last King of the Hellenes from 6 March 1964 to 1 June 1973,", "label": 0}
{"input": "G 1/13 is a decision issued on 25 November 2014 by the Enlarged Board of Appeal of the European Patent Office (EPO), holding that in opposition proceedings a retroactive effect of a", "label": 1}
{"input": "The 38th Film Independent Spirit Awards, honoring the best independent films and television series of 2022, were presented by Film Independent on March 4, 2023. The film nominations were announced live via", "label": 0}
{"input": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals,", "label": 1}
{"input": "A rescue occurred at Riesending cave between 8–19 June 2014, in Bavaria, Germany, after a speleologist, who had been exploring the cave in a group of three, suffered a traumatic brain injury", "label": 1}
{"input": "The 54th NAACP Image Awards, presented by the NAACP, honored outstanding representations and achievements of people of color in motion pictures, television, music, and literature during the 2022 calendar year. The ceremony", "label": 0}
{"input": "Hidden Treasures Dabur Vatika Shampoo Miss Nepal 2023, the 27th Miss Nepal beauty pageant will be held on 27 May 2023 at the Godavari Sunrise Convention Center, at Godawari, Lalitpur. Miss Nepal", "label": 0}
{"input": "Team Jorge is the name given to an outfit of Israeli contractors specialized in the use of malign cyber activities including hacking, sabotage and bot farm-run social media disinformation campaigns to manipulate", "label": 0}
{"input": "Miss Belgium 2014 was the 46th edition of the Miss Belgium held on January 11, 2014 at the Plopsaland Theater in De Panne, Belgium. The winner, Laurence Langen from Limburg, was crowned", "label": 1}
{"input": "The Indian consulate in Herat, Afghanistan was attacked on 23 May 2014 by four heavily armed militants, three days before the inaugural ceremony of Narendra Modi as the Prime Minister of India.", "label": 1}
{"input": "Geneina (sometimes Al-Junaynah or El Geneina; Arabic: الجنينة, lit. the little garden) is a city in West Darfur, part of dar Masalit region, that joined British Sudan at the end of 1919", "label": 0}
{"input": "The Economic Adjustment Programme for Cyprus, usually referred to as the Bailout programme, is a memorandum of understanding on financial assistance to the Republic of Cyprus in order to cope with the", "label": 1}
{"input": "Mister Global 2022 was the 8th edition of Mister Global pageant, held in Chiang Mai, Thailand on February 11, 2023. Danh Chiếu Linh of Vietnam crowned Juan Carlos Ariosa of Cuba as", "label": 0}
{"input": "Severe Tropical Cyclone Gabrielle was a severe tropical cyclone that devastated the North Island of New Zealand and affected parts of Vanuatu and Australia in February 2023. It is the costliest tropical", "label": 0}
{"input": "On 30 June or 2 July 2014, the Armed Forces of the Democratic Republic of the Congo and United Nations forces launched an offensive against rebel groups in the Masisi and Walikale", "label": 1}
{"input": "On 5 November 2014, in a terrorist ramming attack, a Hamas operative deliberately drove a van at high speed into a crowd of people waiting at the Shimon HaTzadik light rail station", "label": 1}
{"input": "Anguilla competed in the 2014 Commonwealth Games in Glasgow, Scotland from July 23 to August 3, 2014. On June 30, 2014, Anguilla's final squad of 12 athletes in 2 sports was named.", "label": 1}
{"input": "The ANZAC centenary advisory board was established by Department of the Prime Minister and Cabinet of Australia to organise the centenary commemorations of the Australian and jointly New Zealand contribution to the", "label": 1}
{"input": "Sumika (stylized as sumika) is a Japanese rock band from Kawasaki, Kanagawa. The band formed as an indie rock band in 2013, before being signed to a major label in 2018. The", "label": 0}
{"input": "On 11 February 2014, a C-130 Hercules military transport aircraft of the Algerian Air Force, carrying 74 passengers and 4 crew members, crashed into Djebel Fertas mountain near Aïn Kercha, Algeria. Only", "label": 1}
{"input": "The 2023 Toronto mayoral by-election will be held on Monday, June 26, 2023, to elect a candidate to serve as the mayor of Toronto for the remainder of the 2022–2026 city council", "label": 0}
{"input": "The 72nd World Science Fiction Convention (Worldcon), also known as Loncon 3, was held on 14–18 August 2014 at the ExCeL London in London, United Kingdom.The convention committee was co-chaired by Alice", "label": 1}
{"input": "The 2022–23 Toronto Raptors season was the 28th season of the franchise in the National Basketball Association (NBA). Finishing the season as the ninth seed in the Eastern Conference, the Raptors qualified", "label": 0}
{"input": "United Nations Security Council Resolution 2673 was passed by a unanimous vote on 11 January 2023, which extended the United Nations Verification Mission in Colombia and reaffirmed commitment to the Colombian peace", "label": 0}
{"input": "On 20 October 2014, Unijet Flight 074P, a Dassault Falcon 50 business jet taking off from Vnukovo International Airport in Moscow, Russia, crashed into a snow plow that had strayed onto the", "label": 1}
{"input": "The 76th British Academy Film Awards, more commonly known as the BAFTAs, were held on 19 February 2023, honouring the best national and foreign films of 2022, at the Royal Festival Hall", "label": 0}
{"input": "In journalism, local news refers to coverage of events, by the news, in a local context that would not be an interest of another locality, or otherwise be of national or international", "label": 0}
{"input": "José Salvador Alvarenga (Spanish: [xoˈse salβaˈðoɾ alβaˈɾeŋɡa]; born c. 1975) is a Salvadoran fisherman and author who was found on January 30, 2014, aged 36 or 37, on the Marshall Islands after", "label": 1}
{"input": "2023 International Conference on Climate Resilient Pakistan, more commonly referred to as 2023 Geneva conference, was a one-day international conference on aid to Pakistani Government after the devastating floods in 2022. The", "label": 0}
{"input": "The 27th European Film Awards were presented on 13 December 2014 in Riga, Latvia. The winners were selected by more than 2,500 members of the European Film Academy. Nominations for the People's", "label": 1}
{"input": "The 2014 UK Music Video Awards were held on 10 November 2014 at the Queen Elizabeth Hall in Southbank Centre, London and was hosted by Adam Buxton to recognise the best in", "label": 1}
{"input": "A social media newsroom is a company resource, set up to increase the functionality and usability of the traditional online newsroom. Social media newsrooms (SMNs) are intended to encourage dialogue and information", "label": 0}
{"input": "G 1/12 is a decision issued on 30 April 2014 by the Enlarged Board of Appeal of the European Patent Office (EPO), holding that an appellant's identity in a notice of appeal", "label": 1}
{"input": "The African Declaration on Internet Rights and Freedoms (AfDec) has been created in order to promote an Internet environment that conforms to established human rights standards and meets Africa's social and economic", "label": 1}
{"input": "The Honduran gang crackdown, referred to in Honduras as the Régimen de Excepción (Spanish for State of Exception), began in December 2022 after parts of the constitution were suspended to fight criminal", "label": 0}
{"input": "On October 11, 2014, Jennifer Laude (Tagalog pronunciation: [ˈlaʊdɛ]), a Filipina trans woman, was drowned to death by Joseph Scott Pemberton, a Lance Corporal in the United States Marine Corps in Olongapo,", "label": 1}
{"input": "During the 2023 Sudan conflict the outbreak of violence has led foreign governments to monitor the situation in Sudan and move towards the evacuation and repatriation of its nationals. Among some countries", "label": 0}
{"input": "A media monitoring service, a press clipping service or a clipping service as known in earlier times, provides clients with copies of media content, which is of specific interest to them and", "label": 0}
{"input": "Parliamentary elections were held in the Federated States of Micronesia on 7 March 2023 to elect the fourteen members of the Congress: ten representatives of the districts, and four senators each representing", "label": 0}
{"input": "BabyMonster (Korean: 베이비몬스터; stylized in all caps), also known as Baemon, (Korean: 베몬) is an upcoming South Korean girl group formed by YG Entertainment. Consisting of seven members—Ruka, Pharita, Asa, Ahyeon, Haram,", "label": 0}
{"input": "Presidential elections were held in El Salvador on 2 February 2014, with a second round held on 9 March since no candidate won an outright majority. The primary candidates were Vice-President Salvador", "label": 1}
{"input": "The 2023 Australia Day Honours are appointments to various orders and honours to recognise and reward good works by Australian citizens. The list was announced on 26 January 2023 by the Governor", "label": 0}
{"input": "Miss World 2014, the 64th edition of the Miss World pageant, was held on 14 December 2014 at the ExCeL London in London, United Kingdom. 121 contestants competed for the crown. Megan", "label": 1}
{"input": "Cyclones Judy and Kevin were a pair of intense tropical cyclones that made landfall on the Pacific island nation of Vanuatu within 48 hours of each other in March 2023. They were", "label": 0}
{"input": "The 2023 Metro FM Music Awards is the 17th annual ceremony of the Metro FM Music Awards, the ceremony is sponsored by Metro FM and is set to premiere live on SABC1", "label": 0}
{"input": "The Eurovision Song Contest 2014 was the 59th edition of the Eurovision Song Contest. It took place in Copenhagen, Denmark, following the country's victory at the 2013 contest with the song \"Only", "label": 1}
{"input": "The 2023 Salvadoran protests occurred on 1 May 2023 in San Salvador, El Salvador. Protestors marched from the Cuscatlán Park to the Gerardo Barrios Plaza in protest of the 2022–23 gang crackdown", "label": 0}
{"input": "On 24 November 2013, the Joint Plan of Action (برنامه اقدام مشترک), also known as the Geneva interim agreement (Persian: توافق هسته‌ای ژنو), was a pact signed between Iran and the P5+1", "label": 1}
{"input": "Water supply problems in Caleta Olivia occurred on 2014 (called the Thirst Days) and culminated in a series of protests about the lack of water produced by the rupture of the aqueduct", "label": 1}
{"input": "The War of 1812 Monument, officially titled Triumph Through Diversity (Triomphe grâce à la diversité in French), is a bronze and stone memorial, located at Parliament Hill in Ottawa, Ontario, Canada, Canada's", "label": 1}
{"input": "The Educational Irish Research Satellite 1 or EIRSAT-1 mission was proposed in response to the European Space Agency (ESA) FYS2 (Fly Your Satellite System 2) call. The proposal was led by University", "label": 0}
{"input": "Parliamentary elections were held in Colombia on 9 March 2014 to elect members to both chambers of Congress. The nationwide constituency for the 102-member Senate was contested, as well as the 166", "label": 1}
{"input": "The Swedish anti-terrorism bill of 2023 refers to the anti-terrorism legislation debated by the Swedish parliament. The new legislation has been first proposed in 2017 following the Stockholm truck attack and would", "label": 0}
{"input": "Anti-government protests (Khmer: បាតុកម្មប្រឆាំងរាជរដ្ឋាភិបាល) were a series of protests in Cambodia from July 2013 to July 2014. Popular demonstrations in Phnom Penh took place against the government of Prime Minister Hun Sen,", "label": 1}
{"input": "Presidential elections were held in Colombia on 25 May 2014. Since no candidate received 50% of the vote in the first round, a run-off between the two candidates with the most votes", "label": 1}
{"input": "The Hai Yang Shi You 981 standoff, also known as the 2014 China-Vietnam oil rig crisis, refers to the tensions between China and Vietnam arising from the Chinese state-owned China National Offshore", "label": 1}
{"input": "Russkaja (stylized as ЯUSSKAJA) were a ska punk band from Vienna, Austria. The band calls its sound \"Russian Turbo Polka Metal.\" It has drawn on polka, ska, fanfare, pop, rock, and traditional", "label": 0}
{"input": "The Tar Taing massacre was a mass killing of civilians by Burmese military forces between 1 and 2 March 2023, in the village of Tadaing (variously spelt Tataing, Tar Taing, Tatai, Tartaing,", "label": 0}
{"input": "The 2023 Berlin repeat state election was held on 12 February 2023 to once again elect the 19th Abgeordnetenhaus of Berlin. The 19th Abgeordnetenhaus was originally elected on 26 September 2021. On", "label": 0}
{"input": "The 2014 Pentecost weekend storms in Europe were a series of intense supercells and MCSs affecting western and central Europe, which followed a heatwave in early June 2014, resulting from a Spanish", "label": 1}
{"input": "Malaysia Airlines Flight 370 (MH370/MAS370) was an international passenger flight operated by Malaysia Airlines that disappeared on 8 March 2014 while flying from Kuala Lumpur International Airport in Malaysia to its planned", "label": 1}
{"input": "General elections were held in Costa Rica on Sunday, 2 February 2014 to elect a new president, two vice presidents, and 57 Legislative Assembly lawmakers. In accordance with Article 132 of the", "label": 1}
{"input": "The 2014 Honda Indy Toronto was a Canadian open wheel motor race, held as the thirteenth and fourteenth rounds of the 2014 IndyCar Series season. It was the 28th annual edition of", "label": 1}
{"input": "The 2023–24 season will be the 119th season in the existence of Galatasaray and the club's 66th consecutive season in the top flight of Turkish football. In addition to the domestic league,", "label": 0}
{"input": "The Juno Awards of 2023 was a music awards ceremony that was held on March 13, 2023 at Rogers Place in Edmonton, Alberta. It recognized the best recordings, compositions, and artists of", "label": 0}
{"input": "The Rotherham child sexual exploitation scandal consists of the organised child sexual abuse that occurred in the town of Rotherham, South Yorkshire, Northern England from the late 1980s until the 2010s and", "label": 1}
{"input": "The Zhengzhou Airport riot occurred on 5–6 February 2014. Passengers at the airport in Zhengzhou, capital of the Chinese province of Henan, angry over lengthy delays due to snowy weather, smashed computers", "label": 1}
{"input": "The 43rd London Film Critics' Circle Awards honoured the best in film of 2022, as chosen by the London Film Critics' Circle. All films released in a UK cinema or to premiere", "label": 0}
{"input": "World news or international news or even foreign coverage is the news media jargon for news from abroad, about a country or a global subject. For journalism, it is a branch that", "label": 0}
{"input": "The 2014–15 Linafoot season (known as the Vodacom Superligue 2014–15 for sponsorship reasons) is the 54th since its establishment. It began on 4 October 2014. A total of 20 clubs participate in", "label": 1}
{"input": "The 65th Annual Grammy Awards ceremony was a music awards ceremony held at the Crypto.com Arena in Los Angeles on February 5, 2023. It recognized the best recordings, compositions, and artists of", "label": 0}
{"input": "Demonstrations took place in the city of Sinjar, located west of Mosul, the capital of Nineveh Governorate, after dozens of Arab families returned to the town, some of them believed to have", "label": 0}
{"input": "S.A.S. v. France was a case brought for the European Court of Human Rights which ruled that the French ban on face covering did not violate European Convention on Human Rights's (ECHR)", "label": 1}
{"input": "The 2014 by-election for the House of Commons constituency of Clacton in Essex, England, took place on 9 October 2014. The by-election was triggered by the Conservative MP for Clacton, Douglas Carswell,", "label": 1}
{"input": "Brit Awards 2023, the 43rd edition of the ceremony, presented by the British Phonographic Industry (BPI), was held on 11 February 2023 to recognise the best in British and international music. The", "label": 0}
{"input": "A radiation accident occurred in Prachin Buri Province, Thailand on 10 March 2023. When A cylinder, measuring 30 centimeters (4 inches) long and 13 centimeters (5 inches) wide, was reported missing during", "label": 0}
{"input": "The 2023 Tokyo Marathon was the 16th edition of the annual marathon race in Tokyo, held on Sunday, 5 March 2023. A Platinum Label marathon, it was the first of six annual", "label": 0}
{"input": "The Kyiv summit in 3 February 2023 will be an important event in EU-Ukraine bilateral relations due to the Russian invasion of Ukraine in 2022. The meeting will be hosted by the", "label": 0}
{"input": "The South Yorkshire Police and Crime Commissioner by-election was a 2014 by-election on 30 October 2014 for the position of Police and Crime Commissioner in the South Yorkshire Police region of the", "label": 1}
{"input": "On June 19, 2014, torrential rains caused severe flash flooding across northeastern Bulgaria leaving dozens of villages without electricity and submerging large parts of several cities in the region. At least 16", "label": 1}
{"input": "Dormaalocyon (\"dog from Dormaal\") is an extinct genus of placental mammals from clade Carnivoraformes, that lived in Europe during early Eocene. Type species, Dormaalocyon latouri was discovered when fossils were unearthed in", "label": 1}
{"input": "Miss Belgium 2023 was the 55th edition of the Miss Belgium pageant, held on February 11, 2023, at the Plopsaland Theater in De Panne, Belgium. Because of the absence of reigning Miss", "label": 0}
{"input": "The 2023 France–China summit was a three-day state visit by Emmanuel Macron, the President of France, to China from April 5 to 7, 2023. It was Macron's first visit to China since", "label": 0}
{"input": "Chang'e 5-T1 (Chinese: 嫦娥五号T1; pinyin: Cháng'é wǔhào T1) was an experimental robotic spacecraft that was launched to the Moon on 23 October 2014, by the China National Space Administration (CNSA) to conduct", "label": 1}
{"input": "A series of protests against the Nigerian Naira and the 2023 Nigerian presidential election began on February 4 due to the Nigerian Naira, protests due to the election are still occurring as", "label": 0}
{"input": "Azerbaijan participated in the Turkvision Song Contest 2014 which took place in Kazan, Tatarstan, Russia. Azad Azerbaijan TV (ATV) was responsible for organising their entry for the contest. Elvin Ordubadli won the", "label": 1}
{"input": "The 64th annual Berlin International Film Festival was held from 6 to 16 February 2014. Wes Anderson's film The Grand Budapest Hotel opened the festival. British film director Ken Loach was presented", "label": 1}
{"input": "The 2023 WWE Hall of Fame was a professional wrestling event produced by WWE that featured the induction of the 24th class into the WWE Hall of Fame. The ceremony took place", "label": 0}
{"input": "The Streamlining Energy Efficiency for Schools Act of 2014 (H.R. 4092) is a bill that would require the United States Department of Energy to establish a centralized clearinghouse to disseminate information on", "label": 0}
{"input": "The Global Pact for the Environment project was launched in 2017 by a network of experts known as the \"International Group of Experts for the Pact\" (IGEP). The group is made up", "label": 0}
{"input": "The October 2014 Nicaragua earthquake occurred at 21:51 local time with a moment magnitude of 7.3 off the coast of Nicaragua, Honduras and El Salvador. The shock resulted in four deaths and", "label": 1}
{"input": "On April 17, 2023, a robbery occurred at Toronto Pearson International Airport in Canada, with over C$20 million (US$15 million) worth of gold and other high-value items being stolen. A container arrived", "label": 0}
{"input": "Following the simultaneous federal elections and regional elections of 25 May 2014, negotiations started to form a new Federal Government as well as new regional governments: a Flemish, Walloon, French Community and", "label": 1}
{"input": "The 2023 Asian Women's Club Volleyball Championship is the 23rd edition of the Asian Women's Club Volleyball Championship, an annual international women's volleyball club tournament organized by the Asian Volleyball Confederation (AVC)", "label": 0}
{"input": "The Lenborough Hoard is a hoard of more than 5,000 late Anglo-Saxon silver coins, dating to the eleventh century, that was found at Lenborough in Buckinghamshire, England in 2014. It is believed", "label": 1}
{"input": "The 2014 Farafra ambush (also called 2014 Al-Wadi Al-Gedid attack) occurred on 19 July 2014 when unidentified gunmen ambushed a desert checkpoint in the Farafra Oasis Road in Egypt's New Valley Governorate.", "label": 1}
{"input": "The Great Fire of Valparaíso (Spanish: Gran Incendio de Valparaíso) started on 12 April 2014 at 16:40 local time (19:40 UTC), in the hills of the city of Valparaíso, Chile. The wildfire", "label": 1}
{"input": "The 2023 Rebellion was a professional wrestling pay-per-view (PPV) event produced by Impact Wrestling. It took place on April 16, 2023, at the Rebel Entertainment Complex in Toronto, Ontario, Canada. It was", "label": 0}
{"input": "Forum for India-Pacific Islands cooperation (FIPIC) is a multinational grouping developed in 2014 for cooperation between India and 14 Pacific Islands nations which include Cook Islands, Fiji, Kiribati, Marshall Islands, Micronesia, Nauru,", "label": 1}
{"input": "Before the Dawn was a concert residency by the English singer-songwriter Kate Bush in 2014 at the Hammersmith Apollo in London. The residency consisted of 22 dates; it was Bush's first series", "label": 1}
{"input": "The blockade of the Gaza Strip is the ongoing land, air, and sea blockade of the Gaza Strip imposed by Israel and Egypt temporarily in 2005–2006 and permanently from 2007 onwards, following", "label": 1}
{"input": "Mercedes-Benz Fashion Week is an annual fashion industry event held in Sydney, Australia. The event is a part of Australian Fashion Week and has taken place at Carriageworks for two consecutive years.", "label": 1}
{"input": "The Batwa–Luba clashes were a series of clashes in the Democratic Republic of the Congo (DRC) between the Pygmy Batwa people, and the Luba people that began in 2013 and ended in", "label": 1}
{"input": "The Anti-Homosexuality Bill, 2023 is a Ugandan parliamentary bill that restricts freedom of speech on LGBT topics and criminalises homosexuality. On 21 March 2023, the bill was read a third time, and", "label": 0}
{"input": "Polaris Dawn is a planned private human spaceflight mission, operated by SpaceX on behalf of Shift4 Payments CEO Jared Isaacman, scheduled to launch no earlier than September 2023. The flight will be", "label": 0}
{"input": "The 2023 Hong Kong District Council elections are scheduled in November 2023 for all 18 District Councils of Hong Kong. They were the first local elections after the passage of the national", "label": 0}
{"input": "On 3 October 2014, Canadian Prime Minister Stephen Harper announced that he would put forth a motion to send forces to participate in the coalition for military intervention against ISIL by deploying", "label": 1}
{"input": "The 31st Actors and Actresses Union Awards ceremony was held on 13 March 2023 at the Circo Price in Madrid.In addition to the competitive awards, the Ministry of Equality received the 'Mujeres", "label": 0}
{"input": "The Geostationary Defense and Strategic Communications Satellite 2 or SGDC-2 (in Portuguese: Satélite Geoestacionário de Defesa e Comunicações Estratégicas 2) is a Brazilian geostationary communication satellite that is currently in the planning", "label": 0}
{"input": "A constitutional referendum was held in Ecuador on 5 February 2023, alongside the 2023 Ecuadorian local elections. The binding consultation was called on 29 November 2022 by President Guillermo Lasso. Voters were", "label": 0}
{"input": "General elections were held in Fiji on 17 September 2014 to select the 50 members of Parliament. The FijiFirst party led by Prime Minister Frank Bainimarama won a landslide victory, winning 32", "label": 1}
{"input": "The 2023 Al-Aqsa clashes were a series of violent confrontations that occurred between Palestinians and Israeli police at the Al-Aqsa Mosque in Jerusalem in April 2023. After the evening Ramadan prayer, Palestinians", "label": 0}
{"input": "The 2013–14 Burkinabé Premier League is the 52nd edition of top flight football in Burkina Faso. A total of sixteen teams competed in the season beginning on 7 December 2013 and ending", "label": 1}
{"input": "Queen + Adam Lambert Rock Big Ben Live was a concert on New Year's Eve 2014 and New Years Day 2015 performed by Queen + Adam Lambert to celebrate the New Year", "label": 1}
{"input": "General elections will be held in Cambodia on 23 July 2023 to elect members of the National Assembly. It will be the seventh quinquennial election in Cambodia since democratic elections were restored", "label": 0}
{"input": "Cyclone Tini (also referred to as Storm Darwin in Ireland) a European windstorm that Western Europe, particularly Ireland and the United Kingdom on 12 February 2014. The storm brought hurricane-force winds to", "label": 1}
{"input": "Parliamentary elections were held in Turkmenistan on 26 March 2023 to elect the 125 members of the Assembly. The elections took place after the introduction of a separate constitutional authority. The Assembly", "label": 0}
{"input": "Azerbaijan participated in the Eurovision Song Contest 2014 with the song \"Start a Fire\" written by Stefan Örn, Johan Kronlund and Alessandra Günthardt. The song was performed by Dilara Kazimova. The Azerbaijani", "label": 1}
{"input": "The Colombian peace process is the peace process between the Colombian government of President Juan Manuel Santos and the Revolutionary Armed Forces of Colombia (FARC–EP) to bring an end to the Colombian", "label": 1}
{"input": "Xikers (Korean: 싸이커스; RR: Ssaikeoseu; stylized in all lowercase) is a South Korean boy band formed by KQ Entertainment. The group consists of ten members: Minjae, Junmin, Sumin, Jinsik, Hyunwoo, Junghoon, Seeun,", "label": 0}
{"input": "General elections were held in Guam on November 4, 2014. Voters elected the governor, legislature, and territory's delegate to the United States House of Representatives. The Democratic and Republican primary elections were", "label": 1}
{"input": "A by-election was held in the Vaimauga 3 constituency in Samoa on 24 February 2023. The by-election was triggered by the death of the incumbent member of parliament Tapunuu Niko Lee Hang", "label": 0}
{"input": "The 2023 IBA World Boxing Championships are held in Tashkent, Uzbekistan from 30 April to 14 May 2023. Athletes from all five continents take part in the championship. Boxers compete for medals", "label": 0}
{"input": "The Whispers is an American group from Los Angeles, California, who have scored hit records since the late 1960s. They are best known for their two number one R&B singles, \"And the", "label": 0}
{"input": "The Good News International Ministries (GNIM), commonly known as the Malindi cult and previously as the Servant P. N. Mackenzie Ministries, is a new religious movement based in Shakahola, Kilifi, Kenya, that", "label": 0}
{"input": "A series of civil unrest incidents began in France on 19 January 2023, organised by opponents of the pension reform bill proposed by the Borne government, which would increase the retirement age", "label": 0}
{"input": "Axiom Mission 3 (or Ax-3) is a planned private spaceflight to the International Space Station. The flight, scheduled to launch no earlier than November 2023, will be operated by Axiom Space and", "label": 0}
{"input": "At around 6:10 PM EDT on April 26, 2023, what was later determined to be an improvised explosive device exploded in Weare, New Hampshire at a home on NH Route 77. ATF", "label": 0}
{"input": "The 2023 Toronto Blue Jays season is the 47th season of the Toronto Blue Jays franchise, and the Blue Jays’ 32nd full season (34th overall) at Rogers Centre. They started the season", "label": 0}
{"input": "The Agreement on the path to normalisation between Kosovo and Serbia, informally known as the Ohrid Agreement, is an agreement mediated by the European Union that aims to normalise diplomatic relations between", "label": 0}
{"input": "Latvia is set to participate in the Eurovision Song Contest 2023 in Liverpool, United Kingdom, with \"Aijā\" performed by Sudden Lights. The Latvian broadcaster Latvijas Televīzija (LTV) organised the national selection Supernova", "label": 0}
{"input": "The Raluca case refers to the crime of ideological fraud that took place on March 31, 2023, when a Raluca impersonated another Jena L. The case had national and international repercussions.Raluca was", "label": 0}
{"input": "The Trojan Horse scandal, also known as \"Operation Trojan Horse\" or the Trojan Horse affair, involves claims of an alleged conspiracy to introduce an \"Islamist\" or \"Salafist\" ethos into several schools in", "label": 1}
{"input": "Brit Awards 2014 was held on 19 February 2014. It was the 34th edition of the British Phonographic Industry's annual pop Brit Awards. The awards ceremony was held at The O2 Arena", "label": 1}
{"input": "The 2014 Helsinki University massacre plan was a mass murder planned by two people in Helsinki, Finland. The plan was discovered in spring 2014. The attack never happened, because a third person", "label": 1}
{"input": "General elections were held in Bahrain in November 2014 to elect the forty members of the Council of Representatives. The first round of voting took place on 22 November, with a second", "label": 1}
{"input": "The Battle of Shuja'iyya occurred between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades on 20 July 2014 during 2014 Israel–Gaza conflict in the Shuja'iyya neighborhood of Gaza City, in", "label": 1}
{"input": "A by-election was held in the Cook Islands constituency of Mitiaro on 11 November 2014.In the July 2014 general election, the contest for the Mitiaro seat resulted in a tie. Incumbent MP", "label": 1}
{"input": "The XIX Island Games (also known as the 2023 NatWest Island Games for sponsorship reasons) were to have been held in Guernsey, Channel Islands in 2021 however due to the COVID-19 pandemic", "label": 0}
{"input": "Typhoon Hagupit (hə-goo-PEET, [hɐguˈpit]; Filipino word meaning \"lashing or flogging\"), known in the Philippines as Typhoon Ruby, was the second most intense tropical cyclone in 2014. Hagupit particularly impacted the Philippines in", "label": 1}
{"input": "The third competition weekend of the 2014–15 ISU Speed Skating World Cup will be held in Sportforum Hohenschönhausen in Berlin, Germany, from Friday, 5 December, until Sunday, 7 December 2014.Artur Waś of", "label": 1}
{"input": "On February 21, 2023, a mass shooting occurred at a bar in Sinop, Mato Grosso, Brazil. After losing R$20,000 (US$3,710.58) in a pool game, suspects Ezequias Souza Ribeiro and Edgar Ricardo de", "label": 0}
{"input": "Many states and international organisations have reacted to the ongoing Russo-Ukrainian War in the Donbas region of Ukraine, which began in April 2014. In August 2014 when the intervention of Russian troops", "label": 1}
{"input": "The XI Gay Games 2023, also known as Gay Games 11, GGHK2023, GGGDL2023 and Hong Kong - Guadalajara Gay Games 2023, is an upcoming international multi-sport event and cultural gathering organised by,", "label": 0}
{"input": "The 2014 Prix de l'Arc de Triomphe was a horse race held at Longchamp on Sunday, 5 October 2014. It was the 93rd running of the Prix de l'Arc de Triomphe. The", "label": 1}
{"input": "The 2023 La Vuelta Femenina (officially La Vuelta Femenina by Carrefour.es), will be the first edition of the La Vuelta Femenina, a cycling stage race taking place in Spain. The race is", "label": 0}
{"input": "On 18 April 2014, a group of sixteen Chinese citizens, later identified as ethnic Uyghurs, engaged in a shootout with Vietnamese border guards after seizing their guns as they were being detained", "label": 1}
{"input": "The 2014 Toronto Mayoral Election took place on October 27, 2014. Incumbent Mayor Rob Ford initially ran for re-election, but dropped out after being diagnosed with a tumour - instead running for", "label": 1}
{"input": "On 22 February 2023, Israel conducted a military incursion into the Palestinian city of Nablus. After an undercover unit located the house in which two militants were believed to be residing, a", "label": 0}
{"input": "General elections were held in Botswana on 24 October 2014. The result was an eleventh straight victory for the Botswana Democratic Party, which won 37 of the 57 elected seats. Incumbent President", "label": 1}
{"input": "A rocket attack was carried out at a large bank in Khartoum by the Rapid Support Forces, at around 00:00 AM local time on 30 April 2023, during the civil conflict in", "label": 0}
{"input": "General elections are scheduled to be held in Luxembourg by October 2023. All 60 seats of the Chamber of Deputies will be renewed. The incumbent Bettel–Schneider Ministry is a coalition of the", "label": 0}
{"input": "The wedding of Hussein, Crown Prince of Jordan, and Rajwa Al Saif will take place on 1 June 2023 in the Hashemite Kingdom of Jordan. Hussein is the eldest son and heir", "label": 0}
{"input": "On 24 February 2022, Russia invaded and occupied parts of Ukraine in a major escalation of the Russo-Ukrainian War, which had begun in 2014. The invasion has resulted in tens of thousands", "label": 0}
{"input": "SpaceX CRS-28, also known as SpX-28, is a Commercial Resupply Service mission to the International Space Station (ISS) scheduled to be launched on 3 June 2023. The mission is contracted by NASA", "label": 0}
{"input": "The 2023 Brazil–China summit was a four-day state visit by Luiz Inácio Lula da Silva, the President of Brazil, to China from 11 to 14 April 2023. It was Lula's first visit", "label": 0}
{"input": "The 2023 Chinese presidential election (Chinese: 2023年中国国家主席选举) was held on 10 March 2023, at the 14th National People's Congress to indirectly elect the President and the Vice President of China. The President", "label": 0}
{"input": "The 2014 Toronto municipal election was held on October 27, 2014, to elect a mayor and 44 city councillors in Toronto, Ontario, Canada. In addition, school trustees were elected to the Toronto", "label": 1}
{"input": "On 22 April 2014, a freight train derailed near the Katongola Bridge in Haut-Lomami Province of the Democratic Republic of the Congo. The train was carrying hundreds of illegal passengers at the", "label": 1}
{"input": "The 1st ceremony of the Feroz Awards was held at the Cine Callao in Madrid, on January 27, 2014. It was hosted by actress Alexandra Jiménez and aired on national TV through", "label": 1}
{"input": "Spargo are a Dutch band, formed in 1975, known for their hits \"You and Me\", \"Head Up to the Sky\", \"One Night Affair\", \"Just For You\" and \"Hip Hap Hop\" in the", "label": 0}
{"input": "On 22 February 2023, at roughly 8pm local time, two gunmen shot off-duty Detective Chief Inspector John Caldwell in Omagh, Northern Ireland. The gunmen are believed to have been linked to the", "label": 0}
{"input": "The 31st Robert Awards ceremony was held on 26 February 2014 in Copenhagen, Denmark. Organized by the Danish Film Academy, the awards honoured the best in Danish and foreign film of 2013.", "label": 1}
{"input": "2014–2016 Croatian war veterans tent protest was 555 days long war veterans protest, often dubbed in Croatia as The Tenters (Croatian: šatoraši). The protests were initially aimed against Ministry of Croatian Veterans", "label": 1}
{"input": "The Constitution of the Arab Republic of Egypt is the fundamental law of Egypt. The Egyptian Constitution of 2014 was passed in a referendum in January 2014. The constitution took effect after", "label": 1}
